[
  {
    "title": "A Pre-SOTU Guide to Trump’s Economic Claims",
    "content": "<img alt=\"\" class=\"attachment-medium_large size-medium_large wp-post-image\" height=\"274\" src=\"https://cdn.factcheck.org/UploadedFiles/StockExchange1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"640\" />\n<p>In recent weeks, President Donald Trump has made a series of claims about the economy, a topic that should feature prominently in his State of the Union address to Congress on Feb. 24. </p>\n\n\n\n<p>&#8220;We have the hottest country anywhere in the world,&#8221; Trump <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-press-conference-briefing-room-january-20-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> at a White House press briefing on Jan. 20, adding later that &#8220;America is booming.&#8221; He <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-world-economic-forum-davos-january-21-2026/#3\" rel=\"noreferrer noopener\" target=\"_blank\">made similar comments</a> the following day, asserting that &#8220;we were a dead country&#8221; a year ago. </p>\n\n\n\n<p>But his economic boasts include false or misleading claims, and he sometimes pushes an incorrect narrative of an abrupt change in some economic indicators since he came back to the White House.</p>\n\n\n\n<p>As preparation for what we might hear in Tuesday night&#8217;s speech, we offer a guide to a dozen of Trump&#8217;s recent claims about the economy, most of which we&#8217;ve written about before. They touch on <a href=\"https://www.factcheck.org/feed/#inflation\">inflation</a>, <a href=\"https://www.factcheck.org/feed/#economic-growth\">economic growth</a>, <a href=\"https://www.factcheck.org/feed/#manufacturing-construction\">manufacturing</a>, <a href=\"https://www.factcheck.org/feed/#wages\">wages</a>, <a href=\"https://www.factcheck.org/feed/#jobs\">jobs</a>, the <a href=\"https://www.factcheck.org/feed/#deficit\">deficit</a>, <a href=\"https://www.factcheck.org/feed/#stock-market\">stock market</a> and more.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\" id=\"economic-growth\">Economic Growth</h2>\n\n\n\n<p>Proud of federal data showing that economic growth in the second and third quarters of 2025 exceeded expectations, Trump&nbsp;<a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-economy-energy-clive-iowa-january-27-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">in Iowa</a>&nbsp;on Jan. 27 falsely claimed that “under my leadership, economic growth is exploding to numbers unheard of. They’ve never had them before.”</p>\n\n\n\n<p>After declining by an annualized rate of 0.6% in the first quarter of 2025, which covers the three months from January to March, real gross domestic product (meaning it has been adjusted for inflation) grew at a rate of 3.8% in the second quarter of 2025 and at a rate of 4.4% in the third quarter,&nbsp;<a href=\"https://perma.cc/9DQR-APL2\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a>&nbsp;estimates from the Bureau of Economic Analysis.</p>\n\n\n\n<p>But those were not record-setting numbers. They were the largest quarterly increases <a href=\"https://apps.bea.gov/iTable/?reqid=19&amp;step=2&amp;isuri=1&amp;categories=survey&amp;_gl=1*sn2p5o*_ga*MjA0NDMwMzg2OS4xNzY2MTc1OTM5*_ga_J4698JNNFT*czE3NzA4MTMzNjIkbzE2JGcxJHQxNzcwODEzNjI4JGo1NiRsMCRoMA..#eyJhcHBpZCI6MTksInN0ZXBzIjpbMSwyLDNdLCJkYXRhIjpbWyJjYXRlZ29yaWVzIiwiU3VydmV5Il0sWyJOSVBBX1RhYmxlX0xpc3QiLCIxIl1dfQ==\" rel=\"noreferrer noopener\" target=\"_blank\">since</a> the economy expanded at a rate of 4.7% in the third quarter of 2023, under President Joe Biden.</p>\n\n\n\n<p>As <a href=\"https://www.factcheck.org/2026/02/trump-oversells-recent-u-s-economic-growth/\" rel=\"noreferrer noopener\" target=\"_blank\">we wrote</a> this month, the quarterly growth record is 34.9% in the third quarter of 2020, which was at the beginning of the economic recovery during the COVID-19 pandemic. Prior to the pandemic, according to BEA estimates back to 1947, the record was 16.7% growth in the first quarter of 1950. Yearly growth in GDP has averaged about 2.75% over the last 50 years.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\" id=\"jobs\">Jobs</h2>\n\n\n\n<p>Trump&nbsp;<a href=\"https://www.nbcnews.com/politics/trump-administration/trump-interview-nbc-news-extend-transcript-tom-llamas-super-bowl-2026-rcna257410\" rel=\"noreferrer noopener\" target=\"_blank\">told</a>&nbsp;NBC News in <a href=\"https://youtu.be/rT6eucDVmFY?si=ruC7Zho8b2Zj1sKU&amp;t=16\" rel=\"noreferrer noopener\" target=\"_blank\">a Feb. 4 interview</a>: “We have, it was just announced, more jobs right now occupied in the United States of America than at any time during its existence, 250 years. There are more people working today than at any time in the history of our country. Pretty good stat.”</p>\n\n\n\n<p>While accurate, the statistic loses some luster when factoring in steady U.S. population growth. In fact, job growth slowed and the employment-to-population ratio declined a bit in the first year of Trump’s second term.</p>\n\n\n\n<p>According to the&nbsp;<a href=\"https://data.bls.gov/timeseries/CES0000000001\" rel=\"noreferrer noopener\" target=\"_blank\">Bureau of Labor Statistics</a>, there were 158,627,000 people employed in the U.S. in January, and that’s the highest number on record. But by and large, as the&nbsp;<a href=\"https://fred.stlouisfed.org/series/POPTOTUSA647NWDB\" rel=\"noreferrer noopener\" target=\"_blank\">population</a>&nbsp;of the U.S. has grown over the years, so too has the number of people employed in the U.S., with notable exceptions during recessions. This graph from BLS gives the long-term picture:</p>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://cdn.factcheck.org/UploadedFiles/image-41.png\" /></figure>\n\n\n\n<p>Since employment recovered from the COVID-19 pandemic in mid-2022, jobs have reached new highs nearly every single month. Trump’s claim also overlooks that job growth was lower between January 2025 and January 2026 under Trump — a gain of 359,000 jobs or 0.2% — than it was for Biden’s final year — a gain of 1.2 million jobs or 0.8.%.</p>\n\n\n\n<p>There are other, more relevant statistics, on employment growth that factor in population growth. BLS’&nbsp;<a href=\"https://www.bls.gov/charts/employment-situation/employment-population-ratio.htm\">employment-population ratio</a>, which is the percentage of the population that is working, declined from 60.1% in January 2025 to 59.8% in January 2026. Another measure is the&nbsp;<a href=\"https://www.bls.gov/charts/employment-situation/civilian-labor-force-participation-rate.htm\" rel=\"noreferrer noopener\" target=\"_blank\">labor force participation rate</a>, which&nbsp;is the percentage of the total population over age 16 that is either employed or actively seeking work. That rate has stayed relatively the same, going from 62.6% in January 2025 to 62.5% in January 2026. The so-called&nbsp;<a href=\"https://fred.stlouisfed.org/series/LNS11300060#:~:text=Graph%20and%20download%20economic%20data%20for%20Labor,2025%20about%2025%20to%2054%20years%2C%20participation\" rel=\"noreferrer noopener\" target=\"_blank\">“prime age” labor force participation rate</a>, focusing just on those ages 25 to 54, rose from 83.5% in January 2025 to 84.1% in January 2026.</p>\n\n\n\n<p>Trump has frequently cited this hollow statistic about more people being employed than ever before during both his&nbsp;<a href=\"https://www.factcheck.org/2019/01/trumps-pointless-job-boast/\" rel=\"noreferrer noopener\" target=\"_blank\">first</a>&nbsp;and&nbsp;<a href=\"https://www.factcheck.org/2025/12/factchecking-trumps-rapid-fire-prime-time-address/\" rel=\"noreferrer noopener\" target=\"_blank\">second</a>&nbsp;terms, including during his&nbsp;<a href=\"https://www.factcheck.org/2019/02/factchecking-the-state-of-the-union-2/\" rel=\"noreferrer noopener\" target=\"_blank\">State of the Union</a>&nbsp;address in 2019.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\" id=\"inflation\">Inflation</h2>\n\n\n\n<p>In the NBC News interview, Trump repeated his&nbsp;<a href=\"https://www.factcheck.org/2025/12/factchecking-trumps-rapid-fire-prime-time-address/\" rel=\"noreferrer noopener\" target=\"_blank\">false claim</a>&nbsp;that he “inherited the worst inflation in the history of our country,” and added that “now we have almost no inflation.”</p>\n\n\n\n<p>When Trump took office in January 2025, the annualized rate of inflation was 3%,&nbsp;<a href=\"https://www.bls.gov/charts/consumer-price-index/consumer-price-index-by-category-line-chart.htm\" rel=\"noreferrer noopener\" target=\"_blank\">based on</a>&nbsp;the Consumer Price Index. That was far from the 9.1% rate in June 2022, under Biden, which was the highest 12-month increase since November 1981,&nbsp;<a href=\"https://www.bls.gov/news.release/archives/cpi_07132022.htm\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a>&nbsp;the Bureau of Labor Statistics. The&nbsp;<a href=\"https://data.bls.gov/dataViewer/view/timeseries/CUUR0000SA0\" rel=\"noreferrer noopener\" target=\"_blank\">worst inflation</a>&nbsp;in U.S. history was not long after World War I, when the Consumer Price Index was up 23.7% for the 12 months ending in June 1920.&nbsp;</p>\n\n\n\n<p>Trump has repeatedly mocked Democrats for raising the issue of “affordability,” which Trump says he has since solved.</p>\n\n\n\n<p>“Prices are way down. You don’t hear the Democrats talking about affordability anymore, which they caused the affordability problem, very badly,” Trump&nbsp;<a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-press-gaggle-air-force-one-february-6-2026/#5\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>&nbsp;on Feb. 6. “But you don’t hear that word. I haven’t heard that word spoken in a week and a half because they can’t speak because the prices are down.”</p>\n\n\n\n<p>But overall prices are not down. As of January, one year into Trump’s second term, the annual inflation rate was down to 2.4%. However, that’s above the&nbsp;<a href=\"https://www.richmondfed.org/publications/research/econ_focus/2024/q1_q2_federal_reserve\" rel=\"noreferrer noopener\" target=\"_blank\">2% target</a>&nbsp;set by the Federal Reserve. So, prices are still increasing, but at a slower pace than when Trump took office.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Stagflation</h2>\n\n\n\n<p>In the&nbsp;<a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-press-conference-briefing-room-january-20-2026/#35\" rel=\"noreferrer noopener\" target=\"_blank\">Jan. 20 press briefing</a>&nbsp;at the White House, Trump falsely claimed to have “ended Biden stagflation,” which he said is “far worse than inflation.” The U.S. was “plagued by the nightmare of stagflation” under Biden, and now “we are witnessing the exact opposite,” Trump&nbsp;<a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-world-economic-forum-davos-january-21-2026/#3\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>&nbsp;at a World Economic Forum meeting on Jan. 21.</p>\n\n\n\n<p>But,&nbsp;<a href=\"https://www.factcheck.org/2026/02/trump-oversells-recent-u-s-economic-growth/\" rel=\"noreferrer noopener\" target=\"_blank\">as we’ve written</a>, economists told us that the U.S. economy under Biden did not experience stagflation, which <a href=\"https://gps.ucsd.edu/faculty-directory/kyle-handley.html\" rel=\"noreferrer noopener\" target=\"_blank\">Kyle Handley</a>, a professor of economics at the University of California, San Diego, told us “refers to a sustained period of high inflation combined with weak or stagnant real economic growth, typically alongside rising unemployment.” He said that definition did not apply to the Biden economy.</p>\n\n\n\n<p>Inflation was high during Biden’s first two years in office, then declined sharply in the last half of his presidency. “However, real GDP growth during the Biden presidency was positive and often above trend, and unemployment remained historically low,” Handley said.&nbsp;</p>\n\n\n\n<p>In addition,&nbsp;<a href=\"https://economics.wfu.edu/faculty-and-staff/aeimit-k-lakdawala/\" rel=\"noreferrer noopener\" target=\"_blank\">Aeimit Lakdawala</a>, an associate professor of economics at Wake Forest University, told us that there has not been a complete economic turnaround under Trump.</p>\n\n\n\n<p>“What we’re really seeing is a continuation of trends that were already well underway before Trump took office in January 2025,” Lakdawala said. He noted that the annual inflation rate is “modestly lower” under Trump, while the average annualized increase in real GDP under Trump is “a touch lower” than in Biden’s last two years. The&nbsp;<a href=\"https://data.bls.gov/timeseries/LNS14000000\" rel=\"noreferrer noopener\" target=\"_blank\">unemployment rate</a>, at 4.3% as of January, is also slightly higher than it was when Trump took office.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\" id=\"stock-market\">Stock Market</h2>\n\n\n\n<p>Trump has&nbsp;<a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-military-families-fort-bragg-february-13-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">repeatedly</a>&nbsp;boasted that the stock market has outperformed expectations. “Your 401(k)s are doing very well,” Trump&nbsp;<a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-military-families-fort-bragg-february-13-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>&nbsp;in a speech to military families in North Carolina on Feb. 13.</p>\n\n\n\n<p>A Feb. 16&nbsp;<a href=\"https://www.whitehouse.gov/articles/2026/02/president-trump-celebrates-americas-new-golden-era-on-presidents-day/\" rel=\"noreferrer noopener\" target=\"_blank\">press release&nbsp;</a>from the White House put some additional spin on the claim, saying the stock market has “rebounded strongly under President Trump’s leadership.” The release notes that the S&amp;P 500 “surg[ed] nearly 40% from its early-year low.” That’s true. But the low in 2025 came just a few days after Trump’s so-called “Liberation Day” tariff announcement on April 2 that sent stock prices tumbling. Since then, stocks have rebounded and achieved new highs.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full\"><img alt=\"\" class=\"wp-image-280504\" height=\"300\" src=\"https://cdn.factcheck.org/UploadedFiles/StockExchange2.png\" width=\"400\" /><figcaption class=\"wp-element-caption\">Traders work on the floor of the New York Stock Exchange in New York on Jan. 12. Photo by Angela Weiss / AFP via Getty Images.</figcaption></figure></div>\n\n\n<p>Since Trump took&nbsp;office, the <a href=\"https://finance.yahoo.com/quote/%5EGSPC/history/\" rel=\"noreferrer noopener\" target=\"_blank\">S&amp;P 500</a>&nbsp;has risen 14.5% (that’s for the period between the close of the market on Jan. 17, 2025, the last business day before the inauguration, and the close of the market on Feb. 18, 2026).&nbsp;Although Trump has said stocks far outperformed Wall Street expectations, that’s only a little better than many financial analysts forecast for 2025 just before Trump took office.</p>\n\n\n\n<p>As Yahoo! Finance&nbsp;<a href=\"https://finance.yahoo.com/news/heres-where-wall-street-sees-stocks-heading-after-the-best-2-year-stretch-since-97-98-211510523.html\">wro</a><a href=\"https://finance.yahoo.com/news/heres-where-wall-street-sees-stocks-heading-after-the-best-2-year-stretch-since-97-98-211510523.html\" rel=\"noreferrer noopener\" target=\"_blank\">te</a>&nbsp;on Jan. 2, 2025, “The median year-end target for the S&amp;P 500 among strategists tracked by Yahoo Finance sits at 6,600. This would represent about a 12% increase from the index’s current level.”</p>\n\n\n\n<p>“And if you remember when I was first elected, everybody said, if I got it to 50,000, the Dow, or 7,000 with the S&amp;P, if I got it to 50,000 with a Dow, that would be an amazing — that would be in four years from then, from the election,” Trump&nbsp;<a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-press-gaggle-before-marine-one-departure-february-13-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">told reporters</a>&nbsp;on Feb. 13.</p>\n\n\n\n<p>The&nbsp;<a href=\"https://finance.yahoo.com/quote/%5EDJI/history/?period1=1610668800&amp;period2=1737504000&amp;interval=1d&amp;filter=history&amp;frequency=1d\" rel=\"noreferrer noopener\" target=\"_blank\">Dow Jones Industrial Average</a>, made up of 30 large corporations, reached 50,000 in early February, but has since dropped a bit, and was at 49,576 at the open of the market on Feb. 19.</p>\n\n\n\n<p>But it&#8217;s misleading to suggest the stock market “rebounded strongly” under Trump. The stock market performed well in Biden’s final two years in office — with the S&amp;P 500 rising over 20% each of those years — better than the 13% gain Trump saw in his first year. As we wrote in our story, “<a href=\"https://www.factcheck.org/2025/10/bidens-final-numbers/\" rel=\"noreferrer noopener\" target=\"_blank\">Biden’s Final Numbers</a>,” the S&amp;P 500 grew by nearly 58% over the entirety of Biden’s four years. The stock market has been on a good long-term run, with the S&amp;P rising nearly 68% during Trump’s&nbsp;<a href=\"https://www.factcheck.org/2021/10/trumps-final-numbers/\" rel=\"noreferrer noopener\" target=\"_blank\">first four years</a>&nbsp;in office and by 166% during the&nbsp;<a href=\"https://www.factcheck.org/2017/09/obamas-final-numbers/\" rel=\"noreferrer noopener\" target=\"_blank\">eight years&nbsp;</a>under President Barack Obama before that.</p>\n\n\n\n<p>We also note that while Trump often boasts that everyone’s 401(k) retirement account has risen, only about&nbsp;<a href=\"https://news.gallup.com/poll/266807/percentage-americans-owns-stock.aspx\" rel=\"noreferrer noopener\" target=\"_blank\">62%</a>&nbsp;of Americans own any stock, according to a Gallup poll in 2025. Ownership of stock skews heavily to the wealthy — 87% among those in households earning at least $100,000. It was 28% among those in households earning less than $50,000.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Gasoline Prices</h2>\n\n\n\n<p>In a <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-press-gaggle-before-marine-one-departure-february-6-2026/#6\" rel=\"noreferrer noopener\" target=\"_blank\">Feb. 6 gaggle</a> with reporters, in which he claimed that “we’ve had massive price reductions,” Trump misleadingly said that “if you look at gasoline, $1.99 a gallon.” That was far from the national average price.</p>\n\n\n\n<p>Gasoline prices are about 19 cents (or 6%) lower than they were when Trump took office, but, as of the week ending Feb. 9, the average price in the U.S. for a gallon of regular gasoline was $2.90, nearly $1 more than Trump said,&nbsp;<a href=\"https://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=PET&amp;s=EMM_EPMR_PTE_NUS_DPG&amp;f=W\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a>&nbsp;the Energy Information Administration. One week later, the average price was $2.92, as of the week ending Feb. 16.</p>\n\n\n\n<p>There also were no states in which the average price was below $2 at the time of Trump’s claim. Oklahoma had the lowest average price at $2.36 per gallon on Feb. 6,&nbsp;<a href=\"https://web.archive.org/web/20260206160618/https://gasprices.aaa.com/state-gas-price-averages/\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a>&nbsp;AAA data. That state, at $2.29, also had the&nbsp;<a href=\"https://perma.cc/FA4R-VXFA\" rel=\"noreferrer noopener\" target=\"_blank\">lowest average price</a>&nbsp;on Feb. 18.</p>\n\n\n\n<p>Patrick De Haan, head of petroleum analysis at GasBuddy, told us in an email that, as of Feb. 14, there were “about 40 stations in the nation with gasoline below $2/gal, which is what we’ve generally seen on a daily basis for February thus far.” In a&nbsp;<a href=\"https://gaspriceguy.substack.com/p/gas-prices-edge-higher-for-second\" rel=\"noreferrer noopener\" target=\"_blank\">Feb. 16 post</a>&nbsp;on Substack, he wrote that, as of that date, $2.79 was the “most common U.S. gas price encountered by motorists.”</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Energy and Grocery Prices</h2>\n\n\n\n<p>In a&nbsp;<a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-press-gaggle-before-marine-one-departure-january-27-2026/#12\" rel=\"noreferrer noopener\" target=\"_blank\">Jan. 27 press gaggle</a>, Trump also claimed to have “made a lot of progress” on the “very, very high prices” that he inherited. “So, we have the groceries going down. We have the energy going down,” he said. That’s misleading.</p>\n\n\n\n<p>While the average price of&nbsp;<a href=\"https://www.bls.gov/charts/consumer-price-index/consumer-price-index-average-price-data.htm\" rel=\"noreferrer noopener\" target=\"_blank\">some</a>&nbsp;grocery items, such as eggs and bread, has decreased since the start of Trump’s second term, average food prices overall are up — not down. As of January, the Consumer Price Index for at-home food products purchased at a grocery store or supermarket had increased about 2.2%, year over year,&nbsp;<a href=\"https://data.bls.gov/dataViewer/view/timeseries/CUSR0000SAF11;jsessionid=C68FC9C68173EB8F69C5260266D08A15\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a>&nbsp;the most recent BLS data.&nbsp;</p>\n\n\n\n<p>As for energy prices, it’s not clear what Trump is referring to. The&nbsp;<a href=\"https://fred.stlouisfed.org/series/CPIENGSL\" rel=\"noreferrer noopener\" target=\"_blank\">CPI for energy</a>&nbsp;overall was down 0.3% for the 12 months ending in January, while the index for&nbsp;<a href=\"https://data.bls.gov/timeseries/CUuR0000Sah21?output_view=pct_12mths\" rel=\"noreferrer noopener\" target=\"_blank\">household energy</a>&nbsp;specifically rose 6.6% in that period, according to BLS data. Also, the average price of&nbsp;<a href=\"https://data.bls.gov/timeseries/APU000072610?output_view=pct_12mths\" rel=\"noreferrer noopener\" target=\"_blank\">electricity per kilowatt hour</a>&nbsp;has risen about 7.3% in the last year.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\" id=\"deficit\">Budget Deficit</h2>\n\n\n\n<p>In his&nbsp;<a href=\"https://www.wsj.com/opinion/donald-j-trump-my-tariffs-have-brought-america-back-2248391b?gaa_at=eafs&amp;gaa_n=AWEtsqcmrUJj7B8e5rrkQb3uxZL4Y0qVEW9D32LtWqWRsxuOpOmmwuB73yfn69PPaqY%3D&amp;gaa_ts=699349da&amp;gaa_sig=W2LvUSXxRanD7SKIcexdzqighIO0KfvnLudc-2FvqeXymcOuG37e87iucvi2ZPd3pSnkTtY19ZwBp2LP0OrKcw%3D%3D\" rel=\"noreferrer noopener\" target=\"_blank\">Jan. 30 opinion piece</a>&nbsp;for the Wall Street Journal, Trump exaggerated when he wrote that “with the help of tariffs, we have cut that federal budget deficit by a staggering 27% in a single year.”</p>\n\n\n\n<p>Budget deficits occur when federal spending exceeds revenue. The White House has&nbsp;<a href=\"https://www.cnn.com/2026/02/03/politics/fact-check-trump-wsj-op-ed\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>&nbsp;that Trump’s figure was calculated by comparing the cumulative budget deficit from February to November in 2025 with the combined deficit for the same 10 months in 2024.&nbsp;</p>\n\n\n\n<p>But organizations that&nbsp;<a href=\"https://bipartisanpolicy.org/report/deficit-tracker/\" rel=\"noreferrer noopener\" target=\"_blank\">track</a>&nbsp;<a href=\"https://www.pgpf.org/programs-and-projects/fiscal-policy/current-debt-deficit/\" rel=\"noreferrer noopener\" target=\"_blank\">the</a>&nbsp;<a href=\"https://www.cbo.gov/publication/61977\" rel=\"noreferrer noopener\" target=\"_blank\">budget deficit</a>&nbsp;typically compare deficits based on months in fiscal years, not calendar years. The $1.78 trillion budget deficit for&nbsp;<a href=\"https://www.fiscal.treasury.gov/files/reports-statements/mts/mts0925.pdf#page=5&amp;zoom=auto,-73,729\" rel=\"noreferrer noopener\" target=\"_blank\">fiscal year 2025</a>, which began on Oct. 1, 2024, and ended on Sept. 30, decreased about 2.3% from the $1.82 trillion budget gap in fiscal year 2024. (Trump alone was president for a full eight out of the 12 months in FY 2025.)&nbsp;</p>\n\n\n\n<p>As of January, the <a href=\"https://www.cbo.gov/publication/61977\" rel=\"noreferrer noopener\" target=\"_blank\">budget deficit</a> was down about 17% through the first four months of FY 2026 when compared with the same period in FY 2025. An increase in federal revenue, including from tariffs, contributed to the decline. On Feb. 9, the Congressional Budget Office&nbsp;<a href=\"https://www.cbo.gov/system/files/2026-02/61977-MBR.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>, “Customs duties, including tariff revenues, collected this year were more than four times the amount recorded in the first four months of last year, an increase of $90 billion.”&nbsp;</p>\n\n\n\n<p>However, in its most recent long-term budget outlook, the CBO&nbsp;<a href=\"https://www.cbo.gov/publication/62105\" rel=\"noreferrer noopener\" target=\"_blank\">projected</a>&nbsp;that the final FY 2026 budget deficit will end up being close to $1.9 trillion, higher than the deficit in FY 2025. That would be about $140 billion higher than the deficit that CBO&nbsp;<a href=\"https://www.cbo.gov/publication/61172\" rel=\"noreferrer noopener\" target=\"_blank\">projected</a>&nbsp;for FY 2026 in January 2025, before any of Trump’s policies had been implemented.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Trade Deficit</h2>\n\n\n\n<p>Trump’s claim that he has “slashed our gaping trade deficit by a staggering 77%,” as he said Jan. 27 in Iowa, is misleading. In 2025, the U.S. trade deficit in goods and services decreased by 0.2%, or about $2.1 billion, from 2024, <a href=\"https://perma.cc/C9T8-MFCG\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a> data the Bureau of Economic Analysis released Feb. 19. The 2025 goods-and-services trade deficit of roughly $901.5 billion was the third largest going back to 1960.</p>\n\n\n\n<p>Instead, as <a href=\"https://www.factcheck.org/2026/02/trumps-selective-comparison-overstates-trade-deficit-decline/\" rel=\"noreferrer noopener\" target=\"_blank\">we wrote</a> on Feb. 3, Trump’s claim appears to compare the monthly trade deficit in January 2025 to the deficit nine months later in October, a 16-year low. That’s a decrease of 77.6%, <a href=\"https://www.bea.gov/sites/default/files/2026-02/trad-time-series-1225.xlsx\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a> BEA figures revised this month. (The decrease from January to December was 45.2%.)&nbsp;But economic experts told us that comparing the trade deficit in one month to another is not preferable because monthly trade figures can be volatile.</p>\n\n\n\n<p>For instance, in the first three months of 2025, the trade imbalance surged to between roughly $120 billion and $136 billion, as U.S. importers loaded up on foreign goods to get ahead of tariffs on imported products that Trump had proposed. Imports went back down after the tariffs went into effect, producing smaller trade deficits in the months later in the year.&nbsp;</p>\n\n\n\n<p>“Large month-to-month swings are common, even in periods with no underlying structural change in trade policy or economic conditions,”&nbsp;Handley, at the University of California, San Diego, said in an email for our story. “For that reason, economists almost never evaluate claims about the ‘trade deficit’ based on comparisons between two individual months.”</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\" id=\"manufacturing-construction\">Manufacturing Construction</h2>\n\n\n\n<p>Trump has <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-press-conference-briefing-room-january-20-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">repeatedly</a> <a href=\"https://www.weforum.org/stories/2026/01/davos-2026-special-address-donald-trump-president-united-states-america/\" rel=\"noreferrer noopener\" target=\"_blank\">claimed</a> that “factory construction is up by 41%” under his second term. That&#8217;s misleading. The Census Bureau’s&nbsp;<a href=\"https://fred.stlouisfed.org/series/TLMFGCONS\" rel=\"noreferrer noopener\" target=\"_blank\">manufacturing construction spending data</a>, which the White House referred us to, shows that spending has declined since Trump took office.</p>\n\n\n\n<p>The <a href=\"https://fred.stlouisfed.org/graph/?g=1R8lH\" rel=\"noreferrer noopener\" target=\"_blank\">quarterly data</a> show a 6.7% decline, while the drop was 7.3% on a <a href=\"https://fred.stlouisfed.org/graph/?g=1RhZw\" rel=\"noreferrer noopener\" target=\"_blank\">monthly basis</a>, from January 2025 to October, the latest data available. </p>\n\n\n\n<p>As <a href=\"https://www.factcheck.org/2026/02/manufacturing-construction-spending-declines-under-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">we&#8217;ve explained</a>, the White House gets a 41% increase by comparing the monthly average from January to August 2025 with the yearly average for 2021 to 2024. But that methodology fails to take into account the&nbsp;<a href=\"https://fred.stlouisfed.org/graph/?g=1Rb7p\" rel=\"noreferrer noopener\" target=\"_blank\">212% increase</a>&nbsp;in factory construction spending over Biden’s four years, partly fueled by the 2022 <a href=\"https://www.congress.gov/bill/117th-congress/house-bill/4346\" rel=\"noreferrer noopener\" target=\"_blank\">CHIPS Act</a>, which helped fund semiconductor manufacturing facilities and continues to affect construction spending. <a href=\"https://webinars.constructionexec.com/speaker/anirban-basu/\" rel=\"noreferrer noopener\" target=\"_blank\">Anirban Basu</a>, chief economist for the Associated Builders and Contractors, an industry trade association,&nbsp;told us that the manufacturing construction spending in 2025 is “largely due” to the CHIPS Act.</p>\n\n\n\n<p>It&#8217;s worth noting that the economy lost 83,000&nbsp;<a href=\"https://data.bls.gov/timeseries/CES3000000001\" rel=\"noreferrer noopener\" target=\"_blank\">manufacturing jobs</a>&nbsp;in Trump’s first 12 months. In the year before he took office, the decline was 202,000 jobs, according to the Bureau of Labor Statistics.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\" id=\"wages\">Real Wages</h2>\n\n\n\n<p>Trump has repeatedly mentioned the decline in real wages, meaning they are adjusted for inflation, over the four years of Biden&#8217;s presidency and the increase in real wages so far under his second term. It&#8217;s true that real average weekly&nbsp;<a href=\"https://data.bls.gov/timeseries/CES0500000012\" rel=\"noreferrer noopener\" target=\"_blank\">earnings fell 4%</a>, according to the Bureau of Labor Statistics, during Biden&#8217;s term, and they&#8217;ve gone up 1.9% in the year since January 2025. But Trump at times has left the misleading impression that this has been an abrupt turnaround. Over Biden&#8217;s last year, real wages went up 0.7%</p>\n\n\n\n<p>On Jan. 13, Trump <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-detroit-economic-club-january-13-2026/#104\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>: &#8220;After real wages plummeted by $3,000 under sleepy Joe Biden, real wages are up by $1,300 in less than one year under President Trump.&#8221; Later that month, he <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-economy-energy-clive-iowa-january-27-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> that &#8220;wages have gone up &#8230; much faster&#8221; than inflation. With Biden, he said, &#8220;it was just the opposite. Wages in the United States in the last year have gone up.&#8221;</p>\n\n\n\n<p>Wages rose faster than inflation over the last year-and-a-half of Biden&#8217;s presidency. They&#8217;ve outpaced inflation since June 2023, and they&#8217;ve continued to do so since Trump took office. </p>\n\n\n\n<p>“It remains the case that both at the tail end of the Biden administration and the beginning of this Trump administration, real wages have been rising. That is to say, inflation has been rising more slowly than wages have been,”&nbsp;<a href=\"https://www.brookings.edu/people/gary-burtless/\" rel=\"noreferrer noopener\" target=\"_blank\">Gary Burtless</a>, a senior fellow emeritus in economic studies at the Brookings Institution, told us in a phone interview when <a href=\"https://www.factcheck.org/2025/12/factchecking-trumps-rapid-fire-prime-time-address/\" rel=\"noreferrer noopener\" target=\"_blank\">we wrote</a> about this topic in December.</p>\n\n\n\n<p>As for the specific dollar amounts Trump has mentioned &#8212; a $3,000 decline in real wages under Biden and a $1,300 increase under his term &#8212; the White House told us that&#8217;s based on <a href=\"https://data.bls.gov/timeseries/CES0500000011\" rel=\"noreferrer noopener\" target=\"_blank\">weekly wage data from BLS</a> that&#8217;s adjusted for inflation using the <a href=\"https://data.bls.gov/timeseries/CWSR0000SA0\" rel=\"noreferrer noopener\" target=\"_blank\">CPI-W</a>, which is the consumer price index for urban wage earners and clerical workers. It <a href=\"https://www.bls.gov/help/one_screen/cw.htm\" rel=\"noreferrer noopener\" target=\"_blank\">measures</a> the change in prices for a basket of goods purchased by such workers, and it&#8217;s the index Social Security <a href=\"https://www.ssa.gov/oact/STATS/cpiw.html\" rel=\"noreferrer noopener\" target=\"_blank\">uses</a> to calculate cost-of-living adjustments. Using that method, we got a decline of nearly $2,900 over Biden&#8217;s four years and an increase of about $1,400 for Trump&#8217;s first year ($1,363 to be exact), a figure that includes January data released this month.</p>\n\n\n\n<p><a href=\"https://www.epi.org/people/josh-bivens/\" rel=\"noreferrer noopener\" target=\"_blank\">Josh Bivens</a>, chief economist at the Economic Policy Institute, a liberal-leaning think tank, cautioned against looking at wage growth only over presidential terms, calling it &#8220;deeply misleading&#8221; because &#8220;macroeconomic cycles occasionally have huge effects that have nothing to do with presidential performance.&#8221;</p>\n\n\n\n<p>Bivens noted that average wages jumped up during the COVID-19 pandemic when the unemployment rate also spiked as mainly low-wage workers lost their jobs. As those low-wage workers regained employment, &#8220;it had the effect of artificially lowering <em>measured </em>wages in the aggregate.&#8221; (Burtless also said the pandemic had this impact on wage data.)</p>\n\n\n\n<p>&#8220;The lesson is that the proper way to measure macroeconomic variables like average wages is from business cycle peak to business cycle peak, not from the trough to a peak. That’s why, for example, we measure from 2019-2024 or 2025,&#8221; Bivens said. </p>\n\n\n\n<p>But presidents of both parties are apt to take credit or cast blame for increases or declines in real wage growth. </p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Investments</h2>\n\n\n\n<p>The president continues to make the exaggerated boast that &#8220;we secured commitments for a record breaking plus $18 trillion&#8221; in &#8220;new investments,&#8221; as he <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-economy-energy-clive-iowa-january-27-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> in Iowa in late January. In his pre-Super Bowl NBC News interview, Trump also made the claim, <a href=\"https://www.nbcnews.com/politics/trump-administration/trump-interview-nbc-news-extend-transcript-tom-llamas-super-bowl-2026-rcna257410\" rel=\"noreferrer noopener\" target=\"_blank\">saying</a> &#8220;$18 trillion is being invested in our country as we speak.&#8221; At times, he <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-prime-time-address-december-17-2025/\" rel=\"noreferrer noopener\" target=\"_blank\">has attributed</a> this to his policies on tariffs.</p>\n\n\n\n<p>A White House website tallying such promises <a href=\"https://perma.cc/Y4UJ-74UE\" rel=\"noreferrer noopener\" target=\"_blank\">puts the total</a> at $9.6 trillion for &#8220;U.S. and Foreign Investments,&#8221; providing very few details on these agreements. But as <a href=\"https://www.factcheck.org/2025/05/trumps-growing-exaggeration-of-u-s-investments/\" rel=\"noreferrer noopener\" target=\"_blank\">we&#8217;ve written before</a>, even that number is shaky because it includes pledges and planned investments that may not happen. </p>\n\n\n\n<p>“[T]hey’re just&nbsp;<em>promises</em>&nbsp;— and often vague ones at that,”&nbsp;<a href=\"https://www.cato.org/people/scott-lincicome\" rel=\"noreferrer noopener\" target=\"_blank\">Scott Lincicome</a>, vice president of general economics at the libertarian Cato Institute, said in an April 2025&nbsp;<a href=\"https://www.cato.org/commentary/three-big-reasons-doubt-trumps-tariff-driven-investment-boom\" rel=\"noreferrer noopener\" target=\"_blank\">analysis</a>&nbsp;when Trump began making such claims.</p>\n\n\n\n<p>In looking at the White House list in May, we found that some investments may not be due to Trump. A $500 billion artificial intelligence infrastructure project, for example, was reportedly in the planning stages in March 2024, well before the election. And both a labor union and a Democratic governor took credit for the announced reopening of an auto assembly plant that also was on the Trump administration&#8217;s list.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><em>Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through <a href=\"https://giving.aws.cloud.upenn.edu/?fastStart=simpleForm&amp;program=ANS&amp;fund=602014\" rel=\"noreferrer noopener\" target=\"_blank\">our “Donate” page</a>. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, P.O. Box 58100, Philadelphia, PA 19102. </em></p>\n<p>The post <a href=\"https://www.factcheck.org/2026/02/a-pre-sotu-guide-to-trumps-economic-claims/\">A Pre-SOTU Guide to Trump&#8217;s Economic Claims</a> appeared first on <a href=\"https://www.factcheck.org\">FactCheck.org</a>.</p>",
    "url": "https://www.factcheck.org/2026/02/a-pre-sotu-guide-to-trumps-economic-claims/",
    "publication_date": "Thu, 19 Feb 2026 20:24:51 +0000",
    "date_gathered": "2026-02-24T04:09:44.214216",
    "country": "US",
    "organization": "FactCheck"
  },
  {
    "title": "Trump Misleads on Drug Pricing Deals",
    "content": "<img alt=\"\" class=\"attachment-medium_large size-medium_large wp-post-image\" height=\"273\" src=\"https://cdn.factcheck.org/UploadedFiles/TrumpRx-720x307-1.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"640\" />\n<p>President Donald Trump has said that Americans are now paying or will pay &#8220;the lowest price anywhere in the world for drugs,&#8221; thanks to the administration’s negotiations with pharmaceutical companies. The administration has announced discounted cash prices for a small number of brand-name drugs. There isn’t evidence Trump’s deals so far have led to broad decreases in drug prices, nor is it certain they will in the future.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft\"><img alt=\"\" src=\"https://cdn.factcheck.org/UploadedFiles/SciCHECKsquare_4-161x145.png\" /></figure></div>\n\n\n<p>Despite these caveats and ambiguities, Trump often has presented lower drug prices as a fait accompli. “We now are paying the lowest price anywhere in the world for drugs,” he&nbsp;<a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-economy-energy-clive-iowa-january-27-2026/#41\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>&nbsp;in a Jan. 27 speech in Iowa. “Every other president tried for it. They didn&#8217;t try very hard. They didn&#8217;t get anything. I got it done.”&nbsp;</p>\n\n\n\n<p>“The American people were effectively subsidizing the cost of drugs for the entire world, and it&#8217;s not going to happen any longer,” he <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-announcement-launch-drug-website-february-5-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> during the Feb. 5 launch for&nbsp;<a href=\"https://trumprx.gov/\" rel=\"noreferrer noopener\" target=\"_blank\">TrumpRx</a>, the new federal website pointing people toward cash prices negotiated by the administration for brand-name drugs. “We ended it.”&nbsp;</p>\n\n\n\n<p>The TrumpRx&nbsp;<a href=\"https://perma.cc/AQJ6-53QY\" rel=\"noreferrer noopener\" target=\"_blank\">website</a>&nbsp;makes similarly sweeping statements, claiming that the approach of basing U.S. prices off of prices in other countries — referred to as most favored nation, or MFN, pricing — is “guaranteeing huge savings for Americans.”</p>\n\n\n\n<p>Trump&#8217;s efforts may have lowered prices for some consumers buying certain drugs. But experts told us there’s no guarantee of substantial savings for Americans in general.</p>\n\n\n\n<p>Thus far, the Trump administration’s drug price negotiations have <a href=\"https://www.kff.org/quick-take/president-trump-proposes-codifying-mfn-drug-pricing-deals-but-key-details-are-missing/\" rel=\"noreferrer noopener\" target=\"_blank\">resulted</a> in voluntary agreements with <a href=\"https://perma.cc/DW8K-HBMZ\" rel=\"noreferrer noopener\" target=\"_blank\">16 companies</a>, though many of the details remain unclear. Under those agreements, drug manufacturers have <a href=\"https://perma.cc/CXL7-S387\" rel=\"noreferrer noopener\" target=\"_blank\">promised</a> to <a href=\"https://perma.cc/5DV2-LEMF\" rel=\"noreferrer noopener\" target=\"_blank\">offer</a> <a href=\"https://perma.cc/9CYU-YGUW\" rel=\"noreferrer noopener\" target=\"_blank\">discounts</a> on <a href=\"https://perma.cc/6BL9-F7HV\" rel=\"noreferrer noopener\" target=\"_blank\">select</a> <a href=\"https://perma.cc/92H6-5LVT\" rel=\"noreferrer noopener\" target=\"_blank\">drugs</a> to people who pay cash and are not using insurance. Companies have also agreed to launch new drugs or to offer Medicaid drugs at MFN prices. In exchange, the <a href=\"https://archive.is/uDHdq\" rel=\"noreferrer noopener\" target=\"_blank\">companies</a> <a href=\"https://perma.cc/JNR7-KV3W\" rel=\"noreferrer noopener\" target=\"_blank\">have</a> <a href=\"https://www.emdserono.com/us-en/company/news/press-releases/agreement-with-u-s-government-to-expand-access-to-ivf-therapies-16-10-2025.html\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>, they have been promised exemptions from tariffs and other benefits, such as <a href=\"https://perma.cc/PGR7-SQ5N\" rel=\"noreferrer noopener\" target=\"_blank\">exemptions</a> from <a href=\"https://archive.is/1AI41\" rel=\"noreferrer noopener\" target=\"_blank\">future</a> <a href=\"https://perma.cc/CN7S-2Q5F\" rel=\"noreferrer noopener\" target=\"_blank\">mandatory</a> MFN pricing.</p>\n\n\n\n<p>“With rare exception,” the negotiations with drugmakers “don’t appear to have translated into actual savings for people at the pharmacy counter or for public or commercial payers yet,” <a href=\"https://www.bu.edu/questrom/profiles/rena-conti/\" rel=\"noreferrer noopener\" target=\"_blank\">Rena Conti</a>, a health economist at Boston University Questrom School of Business, told us. These exceptions include certain weight loss and fertility drugs, which are often not covered by insurance to begin with and are now being offered at reduced cash prices, she said.</p>\n\n\n\n<p>There is no single, easily tracked measure of drug prices in the U.S., making it&nbsp;<a href=\"https://www.factcheck.org/2019/07/pinning-down-prescription-drug-prices/\" rel=\"noreferrer noopener\" target=\"_blank\">challenging</a>&nbsp;to assess broad claims about whether drug prices are rising or falling. Companies provide list prices, but individuals, health insurers and the government rarely pay these prices, often benefiting from rebates or other discounts.&nbsp;</p>\n\n\n\n<p>That said, there are no signs of widespread slashing of list prices in the U.S. “Typically in January, we will see price increases for already-launched brand drugs, and just like we’ve seen in previous years, we saw prices rise,” Conti said. The median list price increase for hundreds of&nbsp;brand-name drugs so far in 2026 was 4%, which is the same median increase as in 2025, <a href=\"https://www.46brooklyn.com/branddrug-boxscore\" rel=\"noreferrer noopener\" target=\"_blank\">according</a> to the research firm 46brookyln.</p>\n\n\n\n<p>When we asked whether Trump is claiming that Americans in general are now paying the lowest prices, a White House spokesperson asserted they would in the future. “We are going to be paying the same if not lower than other wealthy nations,” the spokesperson wrote in an email. “Either via TrumpRx or once the MFN deals are codified upon passage of Great Healthcare Plan.”</p>\n\n\n\n<p>The <a href=\"https://perma.cc/3NB3-95FM\" rel=\"noreferrer noopener\" target=\"_blank\">Great Healthcare Plan</a> is a series of health policy proposals, <a href=\"https://perma.cc/534S-JBLT\" rel=\"noreferrer noopener\" target=\"_blank\">released</a> Jan. 15, which Trump has called on Congress to pass as legislation. To lower drug prices, the plan calls for “codifying” MFN deals. The Trump administration has also said it will <a href=\"https://perma.cc/AQJ6-53QY\">add</a> more drugs to TrumpRx, and  in December the administration released <a href=\"https://www.healthaffairs.org/content/forefront/administration-releases-proposed-medicare-international-drug-reference-pricing-models\" rel=\"noreferrer noopener\" target=\"_blank\">proposals</a> to apply MFN pricing to a subset of Medicare beneficiaries. </p>\n\n\n\n<p>It is unclear how or whether the MFN deals will be codified, however. Nor is it a given that even a widely applied MFN policy would reduce prices substantially.</p>\n\n\n\n<p>Trump’s claim that he is the first president to lower drug prices also ignores past efforts that have had some success.</p>\n\n\n\n<p>Separate from the MFN pricing efforts, the Trump administration has continued to <a href=\"https://www.nejm.org/doi/full/10.1056/NEJMp2517584\" rel=\"noreferrer noopener\" target=\"_blank\">negotiate</a> lower Medicare prices for some specific drugs under the Inflation Reduction Act. However, this law <a href=\"https://www.congress.gov/bill/117th-congress/house-bill/5376\" rel=\"noreferrer noopener\" target=\"_blank\">was passed</a> in 2022 under the Biden administration.&nbsp;</p>\n\n\n\n<p>And rather than promoting these Medicare negotiations, the Trump administration is “talking about this unclear political pressuring that the White House is applying in general in the health industry and specifically on drugs,”&nbsp;<a href=\"https://www.aei.org/profile/joseph-antos/\" rel=\"noreferrer noopener\" target=\"_blank\">Joseph Antos</a>, a senior fellow emeritus at the American Enterprise Institute, told us. AEI is a conservative-leaning think tank. “Is there any way to actually objectively measure the impact of any of that? I don’t think there is.”</p>\n\n\n\n<p>Below, we explain what we know and don’t know about the impacts of Trump’s MFN negotiations and proposed policies on drug prices.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\"><strong>TrumpRx Features Some Savings Amid Misleading Messages</strong></h2>\n\n\n\n<p>There is some support for Trump’s claim that he has lowered drug costs, in the case of a few specific drugs being offered at relatively low cash prices.</p>\n\n\n\n<p>However, TrumpRx, the website the administration built to promote these cash prices, echoes Trump’s exaggerated claims about the scope of the price reductions.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full\"><img alt=\"\" class=\"wp-image-280393\" height=\"267\" src=\"https://cdn.factcheck.org/UploadedFiles/TrumpRx-400x267-1.jpg\" width=\"400\" /><figcaption class=\"wp-element-caption\">Trump speaks at the Feb. 5 TrumpRx launch. Photo by Saul Loeb / AFP via Getty Images.</figcaption></figure></div>\n\n\n<p>TrumpRx shows cash prices for <a href=\"https://perma.cc/AVS6-YGK8\" rel=\"noreferrer noopener\" target=\"_blank\">43 drugs</a> from five manufacturers that made deals with the administration. People <a href=\"https://perma.cc/AQJ6-53QY\" rel=\"noreferrer noopener\" target=\"_blank\">can either</a> print a coupon to use at pharmacies or, in some cases, go to a manufacturer’s website to make the purchase.</p>\n\n\n\n<p>GoodRx, a prescription drug coupon site that <a href=\"https://www.goodrx.com/corporate/business/goodrx-ipo?srsltid=AfmBOopSjqyA_3f5-Aj1A_EJBubrbTfKAETw7UcOEEoQTnPXu6CCFbqI\" rel=\"noreferrer noopener\" target=\"_blank\">launched</a> in 2011, has <a href=\"https://perma.cc/HF8D-XFAX\" rel=\"noreferrer noopener\" target=\"_blank\">partnered</a> with the administration to provide many of the TrumpRx-branded coupons, and people can in some cases <a href=\"https://www.nytimes.com/2026/02/06/health/trumprx-prescription-drug-prices-consumers.html\" rel=\"noreferrer noopener\" target=\"_blank\">use</a> GoodRx to access coupons providing the same Trump administration-negotiated prices.</p>\n\n\n\n<p>The TrumpRx&nbsp;<a href=\"https://perma.cc/9WQR-DM78\" rel=\"noreferrer noopener\" target=\"_blank\">website</a>&nbsp;advertises the “lowest cash prices” and shows discounts of 50% to 93% off the list price. But most people, particularly those with insurance coverage, don&#8217;t pay the list price.</p>\n\n\n\n<p>“Manufacturers have agreed to discount prices on some drugs that are not well covered by insurance or already have generic competition, and that’s not nothing, but it’s not necessarily going to help a lot of people, right now anyway,”&nbsp;<a href=\"https://www.kff.org/person/juliette-cubanski/\" rel=\"noreferrer noopener\" target=\"_blank\">Juliette Cubanski</a>, deputy director of the Program on Medicare Policy at KFF, told us. KFF is a nonpartisan health policy organization. She explained that most people with health insurance will fare better using their insurance than paying in cash.</p>\n\n\n\n<p>For example, a person with health insurance who pays a flat copay for medications is&nbsp;<a href=\"https://www.statnews.com/2026/02/05/trumprx-prescription-drug-costs-flaws/\" rel=\"noreferrer noopener\" target=\"_blank\">unlikely</a>&nbsp;to get a better price by going to TrumpRx, two economists from the University of Washington explained in an opinion piece published in STAT. In fact, the TrumpRx website&nbsp;<a href=\"https://perma.cc/T6CK-YA4H\" rel=\"noreferrer noopener\" target=\"_blank\">says</a>: “If you have insurance, check your co-pay first—it may be even lower.”</p>\n\n\n\n<p>People with insurance also benefit from caps on their spending in the form of deductibles and out-of-pocket maximums, the economists wrote, as well as prices for drugs negotiated by their insurers. But for now, drugs purchased via TrumpRx are not counted toward deductibles or out-of-pocket maximums. &#8220;A family might hit their out-of-pocket maximum by midyear using insurance, after which their insurer pays 100% of the prescription cost for the rest of the year,&#8221; the economists wrote. &#8220;Under TrumpRx, the family would pay full freight all year long, with no ceiling on their out-of-pocket spending.&#8221;</p>\n\n\n\n<p>One group of people who are sometimes asked to pay list prices for drugs are those without insurance or whose insurance does not cover a specific drug, Cubanski explained.</p>\n\n\n\n<p>But even for those without insurance or whose insurance doesn&#8217;t cover a certain drug, Conti said, there are better deals available on the U.S. market for some drugs featured on TrumpRx. “The majority of drugs that are listed on the TrumpRx website actually have generic competition, and for consumers it pays to shop,” she said. “You can get a better deal by simply buying the generic, even when this coupon is being offered.”</p>\n\n\n\n<p>GoodRx or Mark Cuban&#8217;s <a href=\"https://www.costplusdrugs.com/faq/\" rel=\"noreferrer noopener\" target=\"_blank\">Cost Plus Drugs</a>, another website that negotiates with drug manufacturers, offer cheaper cash prices for generic versions of at least 18 of the 43 brand-name drugs promoted on TrumpRx, according to a&nbsp;<a href=\"https://www.statnews.com/2026/02/06/trumprx-discount-drug-website-undercut-by-cheaper-generics/\" rel=\"noreferrer noopener\" target=\"_blank\">review</a>&nbsp;by STAT. TrumpRx does not notify people that generics may be cheaper than the brand-name drugs.</p>\n\n\n\n<p>Conti did highlight some drugs for which cash prices appear to be “good deals.” These include insulin, the fertility drug Gonal-F and the GLP-1 weight loss drug Zepbound. Patients may benefit from low-cost <a href=\"https://perma.cc/CN8B-33GR\" rel=\"noreferrer noopener\" target=\"_blank\">insulin</a>, which is offered at $25 per 10 milliliters, if they have gaps in their insurance coverage or have a health plan requiring high out-of-pocket payments, she said. Fertility and GLP-1 drugs for weight loss cost more but are often not covered by insurance even for those who have it, so patients may benefit from buying them for reduced cash prices.</p>\n\n\n\n<p>Gonal-F is now available on TrumpRx at <a href=\"https://perma.cc/W3S2-JW2U\" rel=\"noreferrer noopener\" target=\"_blank\">$168</a> for the lowest strength, compared with its list price of around $966. There were already discounts available for people paying for the drugs without insurance, but &#8220;the price that&#8217;s listed on the TrumpRx coupon is lower than the price being offered by the specialty pharmacy, even with other special discounts available,&#8221; Conti said.</p>\n\n\n\n<p>Zepbound is being <a href=\"https://perma.cc/MM5L-T6KM\" rel=\"noreferrer noopener\" target=\"_blank\">offered</a> for $299 per month for the lowest dose, reduced from a list price of $1,087. (However, the lowest dose of the drug had <a href=\"https://www.cnbc.com/2025/12/01/eli-lilly-prices-zepbound-weight-loss-drug-vials.html\" rel=\"noreferrer noopener\" target=\"_blank\">previously</a> been available for $349 per month for cash buyers.)</p>\n\n\n\n<p>Cubanski said the latest weight loss medication discounts “can be seen as a pretty direct byproduct of negotiations between the manufacturers and the White House,” but said that the makers of these drugs have been “steadily offering increasing discounts” even before the negotiations. This is partly because for a while, there were shortages of the drugs, she explained, and companies have been allowed to market relatively inexpensive compounded versions, even though the drugs are under patent and do not have generics.</p>\n\n\n\n<p>“The competitive pressures in the GLP-1 market have likely been responsible to some degree for bringing down cash pay prices,”&nbsp;<a href=\"https://vivo.weill.cornell.edu/display/cwid-pka4006\" rel=\"noreferrer noopener\" target=\"_blank\">Pragya Kakani</a>, a health economist and assistant professor at Weill Cornell Medical College, told us. She added that it is &#8220;challenging to disentangle the effects from the Trump administration’s MFN initiatives vs. pre-existing competitive pressures.&#8221;&nbsp;</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\"><strong>Claims Touting Lowest International Prices Are Difficult to Verify</strong></h2>\n\n\n\n<p>As for the&nbsp;<a href=\"https://perma.cc/AQJ6-53QY\" rel=\"noreferrer noopener\" target=\"_blank\">claim</a>&nbsp;on the website that TrumpRx is offering the “world’s&nbsp;<em>lowest</em>&nbsp;prices,” or the lowest in the developed world, this is challenging to check.</p>\n\n\n\n<p>The Trump administration has provided limited information on how the prices were arrived at during the closed-door negotiations with drug companies. We asked the White House for more detail on what international prices the TrumpRx prices are being compared with, and a spokesperson told us the administration was using prices from other G7 nations but did not provide more details.</p>\n\n\n\n<p>Cubanski said it is difficult to check whether prices are the lowest, as “there’s not a lot of transparency in drug pricing internationally.” It’s possible to find prices, but it’s unclear what rebates or discounts countries have negotiated off of these prices.</p>\n\n\n\n<p>Conti agreed, adding that in many cases, brand-name drugs may not even be offered in other countries because other countries drop brand-name drugs once a generic is available. Since many of the drugs now promoted on TrumpRx are available as generics, it is challenging to determine international prices.</p>\n\n\n\n<p>People can make statements about offering the lowest drug prices internationally “because it’s impossible to check,” Conti said.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Medicaid Deals With Unclear Impact</h2>\n\n\n\n<p>The Trump administration has also said that as part of the <a href=\"https://www.kff.org/quick-take/president-trump-proposes-codifying-mfn-drug-pricing-deals-but-key-details-are-missing/\" rel=\"noreferrer noopener\" target=\"_blank\">MFN deals</a>, companies agreed to sell drugs at MFN prices to Medicaid programs<strong>.</strong> A voluntary <a href=\"https://perma.cc/4BUX-PEJZ\" rel=\"noreferrer noopener\" target=\"_blank\">initiative</a> invites companies to negotiate prices for certain drugs &#8220;aligned with those paid in select other countries,&#8221; according to the Centers for Medicare &amp; Medicaid Services website. The initiative launched in January, a spokesperson for the agency told us.</p>\n\n\n\n<p>It remains unclear exactly what drugs are being offered to Medicaid at these prices and what companies and states are participating, Cubanski said. The CMS spokesperson told us that the agency hasn&#8217;t yet published a list with these details.</p>\n\n\n\n<p>It’s also not clear MFN prices would compare favorably to the prices the programs are already getting. “States pay among the lowest prices through the Medicaid program for prescription drugs of all payers in the U.S.,&#8221; Cubanski said. “So whether the so-called most favored nation price that pharmaceutical companies will be offering on specific medications is lower than what states are currently paying isn&#8217;t really something that we&#8217;re able to rigorously quantify.&#8221;</p>\n\n\n\n<p>The average net Medicaid prices for top-selling drugs are 65% lower than those in Medicare Part D, <a href=\"https://www.cbo.gov/publication/57007\">according</a> to an analysis from the Congressional Budget Office, Kakani said.</p>\n\n\n\n<p>Furthermore, Cubanski said, “People on Medicaid pay very little if not nothing for prescriptions, so the savings would be to the state and federal government, not to people with Medicaid directly.”</p>\n\n\n\n<p>Conti said that the larger current issue for drug affordability for people on Medicaid is that provisions of the One Big Beautiful Bill Act will lead to health care coverage losses. The CBO&nbsp;<a href=\"https://www.cbo.gov/publication/61367#data\">estimated</a>&nbsp;that the law would increase the number of uninsured people in the U.S. by 10 million over 10 years, with 7.5 million of those due to changes to Medicaid. “The administration is weakening insurance protections at the same time that they are offering out the hope of these potential deals,” she said.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\"><strong>No Evidence of Impact on Private Insurance</strong></h2>\n\n\n\n<p>Despite the discounts for a limited group of cash payers, experts said that the Trump administration’s MFN deals do not so far directly affect drug affordability for those with private insurance.</p>\n\n\n\n<p>“The biggest affordability challenges are ones that are related to very high-cost brand drugs,” Conti said. “It’s not obvious that much of what the administration is pursuing right now is going to really make a difference for people who are commercially insured and who are using these high-cost brand drugs.”</p>\n\n\n\n<p>Kakani said that the MFN deals have only addressed commercial insurance in a limited way, to the degree that the negotiations might indirectly influence negotiations between drugmakers and insurers. However, she added that the TrumpRx prices &#8220;are unlikely to be lower than net prices commercial plans were already negotiating,&#8221; as many of the drugs &#8220;face significant competition.&#8221;</p>\n\n\n\n<p>Recently, CMS Administrator Dr. Mehmet Oz has argued that the cash discounts the Trump administration has negotiated will translate into wider price reductions, including for people with private insurance, due to increased transparency.</p>\n\n\n\n<p>“Now that everyone knows the true worldwide most favored nation drug prices, it&#8217;s going to allow employers, insurers and everyone in between to be able to take out the middlemen and drive those prices down,” Oz <a href=\"https://transcripts.cnn.com/show/sitroom/date/2026-02-06/segment/04\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> in a Feb. 6 CNN <a href=\"https://x.com/DrOzCMS/status/2019871006039634180\" rel=\"noreferrer noopener\" target=\"_blank\">interview</a>. He <a href=\"https://transcripts.cnn.com/show/sotu/date/2026-02-08/segment/01\" rel=\"noreferrer noopener\" target=\"_blank\">suggested</a> on <a href=\"https://www.cnn.com/2026/02/08/politics/video/cms-dr-oz-measles-trumprx-vaccine-lower-drug-prices\" rel=\"noreferrer noopener\" target=\"_blank\">CNN</a> two days later that if employers saw a drug price on TrumpRx that was lower than what they were paying, they would ask for that price.</p>\n\n\n\n<p>However, Conti disagreed that transparency would uniformly lead to better deals for Americans. She explained that the current opaque system likely allows some Americans to get particularly good deals on drug prices, because plans and pharmacy benefit managers are negotiating and passing on some savings as lower out-of-pocket costs and premiums.</p>\n\n\n\n<p>&#8220;If we move towards more radical transparency in this system, yes, there are consumers that will benefit, absolutely,” she continued. &#8220;But it also might erode the company’s willingness to offer really good deals&#8221; to some payers.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Uncertainty About Broader MFN Policies</h2>\n\n\n\n<p>Trump has often said that drug prices will dramatically fall due to MFN policies,&nbsp;<a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-announcement-launch-drug-website-february-5-2026/\">referring</a>&nbsp;to <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-cabinet-meeting-january-29-2026/#53\" rel=\"noreferrer noopener\" target=\"_blank\">discounts</a> of <a href=\"https://www.nytimes.com/2026/01/11/us/politics/trump-interview-transcript.html\" rel=\"noreferrer noopener\" target=\"_blank\">as much</a> as 80% or 90%.</p>\n\n\n\n<p>As we have said, proposed MFN strategies range from voluntary deals to launch new drugs or offer Medicaid drugs at lower prices to mandatory MFN pricing for some Medicare beneficiaries or a &#8220;codified&#8221; MFN strategy.</p>\n\n\n\n<p>However, experts said that many details are missing regarding these strategies. Drugs are often launched in the U.S. before they are available in other countries, Conti said. It&#8217;s unclear how the U.S. will ensure it is getting the lowest prices internationally if there are no prices in other countries yet. </p>\n\n\n\n<p>In the case of Medicare, CMS has <a href=\"https://www.healthaffairs.org/content/forefront/administration-releases-proposed-medicare-international-drug-reference-pricing-models\" rel=\"noreferrer noopener\" target=\"_blank\">proposed</a> mandatory pilot programs testing MFN prices for some beneficiaries. But it&#8217;s unclear what drugs and companies will participate. Drug companies that voluntarily agreed to Medicaid MFN pricing may be exempted, Cubanski said, which “could potentially undercut savings.” CMS has estimated that its two initiatives — impacting drugs given by physicians or prescription drugs picked up at pharmacies — will<strong> </strong>generate around $12 billion of savings to Medicare over seven years and $14 billion over six years. “That’s not nothing, but given that Medicare spends roughly $200 billion per year approximately on drugs,” Cubanski said<strong>,</strong> the programs don’t &#8220;really move the needle all that much.&#8221;</p>\n\n\n\n<p>As for broader, mandatory MFN pricing, it could face political headwinds, Cubanski said. “Historically, Republicans have not been in support of efforts to regulate drug prices,” she said, and pharmaceutical companies would also be expected to push back.</p>\n\n\n\n<p>Even if widely implemented, MFN pricing may or may not lead to widespread and substantial reductions in drug prices.</p>\n\n\n\n<p>A survey of health policy experts&nbsp;<a href=\"https://www.healthaffairs.org/content/forefront/experts-mixed-most-favored-nation-drug-pricing-would-affect-prices-access-and\" rel=\"noreferrer noopener\" target=\"_blank\">published</a>&nbsp;Feb. 4 in Health Affairs found that around half thought MFN pricing would &#8220;substantially reduce&#8221; average net prescription drug prices in the U.S. for branded drugs, even if such a policy were broadly implemented.&nbsp;</p>\n\n\n\n<p>“The overall takeaway was it’s really hard to predict what the effect of this policy is going to be, and the simplistic idea that this is going to suddenly reduce drug prices by … 80%, 90% are probably just that – overly simplistic,” said Kakani, the study’s lead author.</p>\n\n\n\n<p>Companies would likely change their international strategies in response to a broad MFN policy, Kakani said. Companies could make it more difficult for the U.S. government to determine what other countries were paying, by issuing rebates in other countries and not disclosing them; they could delay product launches abroad, particularly in countries with very low prices, to set a higher benchmark; or they could increase international prices to a degree that the U.S. did not pay significantly less than before<strong>.</strong></p>\n\n\n\n<p>Kakani added that drug prices in the U.S. are not as high as Trump&#8217;s 80% or 90% discount claims have implied, when compared with other countries. A RAND report, based on 2022 data, found that on average, U.S. prices are 2.78 times higher than in other developed countries, and 4.22 times higher when looking at brand-name drugs before adjusting for discounts by manufacturers, as we&#8217;ve <a href=\"https://www.factcheck.org/2025/05/qa-on-trumps-prescription-drug-pricing-executive-order/\" rel=\"noreferrer noopener\" target=\"_blank\">written</a> in the past. Generic drugs had lower prices overall in the U.S. than in most countries.</p>\n\n\n\n<p>Antos pointed to practical challenges to setting MFN prices. For example, he said it is unclear how the proposed Medicare programs to try out MFN pricing are supposed to work. &#8220;CMS doesn&#8217;t have the authority to force Germany to tell them everything about their pricing, and they also don’t have the ability to get Pfizer to open its books,” he said.</p>\n\n\n\n<p>“Trying to tie it to some kind of European price is doing it the hard way,” Antos said, suggesting that if the U.S. wants price controls, it could just ask more broadly for the already-good prices it gets for Medicaid. “We have domestic reference pricing right here.”</p>\n\n\n\n<p>While Trump <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-announcement-launch-drug-website-february-5-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">claimed</a> that it would be other countries that now pay higher prices, Antos said that “by and large” manufacturers “are not in a position to renegotiate a price” with other countries. (As part of tariff negotiations, the U.K. did <a href=\"https://endpoints.news/with-scant-data-rfk-jr-credits-trump-for-higher-european-drug-prices/\" rel=\"noreferrer noopener\" target=\"_blank\">agree</a> to increase what it pays for new drugs, although it&#8217;s unclear what will happen with drug prices in other countries overall.)</p>\n\n\n\n<p>Antos said that regardless, any attempt at price setting is “not going to necessarily translate into lower prices at the drug store for most people.”&nbsp;</p>\n\n\n\n<p>And it will be difficult to evaluate whether U.S. policies are making a difference for consumers. If copays or deductibles went down, for example, perhaps insurance companies would make up for this by slightly increasing the growth rate of premiums, Antos said, which would be hard to quantify because premiums go up each year and are driven by hospital and doctor costs.</p>\n\n\n\n<p>&#8220;In other words, it&#8217;s very hard to know what the net impact of any of these policies is,&#8221; he said.</p>\n\n\n\n<p><em>Update, Feb. 18: We added that Conti is at the Boston University Questrom School of Business.</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><em>Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through <a href=\"https://giving.aws.cloud.upenn.edu/?fastStart=simpleForm&amp;program=ANS&amp;fund=602014\" rel=\"noreferrer noopener\" target=\"_blank\">our “Donate” page</a>. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, P.O. Box 58100, Philadelphia, PA 19102. </em></p>\n<p>The post <a href=\"https://www.factcheck.org/2026/02/trump-misleads-on-drug-pricing-deals/\">Trump Misleads on Drug Pricing Deals</a> appeared first on <a href=\"https://www.factcheck.org\">FactCheck.org</a>.</p>",
    "url": "https://www.factcheck.org/2026/02/trump-misleads-on-drug-pricing-deals/",
    "publication_date": "Wed, 18 Feb 2026 19:04:17 +0000",
    "date_gathered": "2026-02-24T04:09:44.214249",
    "country": "US",
    "organization": "FactCheck"
  },
  {
    "title": "The Disagreement over Judicial and Administrative Warrants for ICE",
    "content": "<img alt=\"\" class=\"attachment-medium_large size-medium_large wp-post-image\" height=\"273\" src=\"https://cdn.factcheck.org/UploadedFiles/House-ICE-720.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"640\" />\n<p><em>Este artículo también está <a href=\"https://www.factcheck.org/es/2026/02/el-desacuerdo-sobre-las-ordenes-judiciales-y-administrativas-para-ice/\">disponible en español</a>.</em></p>\n\n\n\n<p>One of the sticking points in the standoff between Democrats and Republicans over funding for the Department of Homeland Security has been the Trump administration&#8217;s expanded use of administrative warrants to forcibly enter people&#8217;s homes to make immigration arrests. Democrats argue the new DHS policy runs afoul of the Constitution and have demanded immigration officers obtain judicial warrants — a higher legal bar that requires a judge&#8217;s approval — to forcibly enter a home. </p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full\"><img alt=\"\" class=\"wp-image-280344\" height=\"267\" src=\"https://cdn.factcheck.org/UploadedFiles/ICE-House-400-x-267.png\" width=\"400\" /><figcaption class=\"wp-element-caption\">ICE agents approach a house before detaining two people on Jan. 13 in Minneapolis. Photo by Stephen Maturen/Getty Images.</figcaption></figure></div>\n\n\n<p>The Trump administration contends that immigrants in the country illegally who have received a final order of removal from immigration judges are not entitled to Fourth Amendment protections — a position many immigration law experts dispute. And several lawmakers have argued that the additional requirement for judicial warrants would significantly curtail immigration enforcement efforts.</p>\n\n\n\n<p>Funding for DHS lapsed on Feb. 14 as Republicans have balked at Democrats&#8217; demands to rein in several immigration enforcement measures. Among other requests, Democrats <a href=\"https://jeffries.house.gov/2026/02/04/leaders-jeffries-and-schumer-deliver-urgent-ice-reform-demands-to-republican-leadership/\" rel=\"noreferrer noopener\" target=\"_blank\">are asking</a> for a ban on ICE agents wearing masks, requirements for displaying identification and using body-worn cameras, and the use of judicial warrants on private property. As Congress failed to pass legislation on Feb. 13, <a href=\"https://www.npr.org/2026/02/14/nx-s1-5713914/department-of-homeland-security-shutdown\" rel=\"noreferrer noopener\" target=\"_blank\">parts of DHS</a>, including the Transportation Security Administration, the Federal Emergency Management Agency and Coast Guard, will be affected by the lapse in funding. ICE has enough money to keep operating due to <a href=\"https://www.npr.org/2026/01/21/nx-s1-5674887/ice-budget-funding-congress-trump\" rel=\"noreferrer noopener\" target=\"_blank\">billions in funding</a> from the Republicans&#8217; One Big Beautiful Bill Act, passed last summer.</p>\n\n\n\n<p>Debate over the use of administrative versus judicial warrants has emerged as one of the main impediments in the negotiations. </p>\n\n\n\n<p>During a press conference on Jan. 30, House Minority Leader Hakeem Jeffries <a href=\"https://www.c-span.org/program/news-conference/house-minority-leader-hakeem-jeffries-holds-news-conference/672568\" rel=\"noreferrer noopener\" target=\"_blank\">emphasized</a> that Democrats would &#8220;not walk away from&#8221; their demand that &#8220;judicial warrants should be required before ICE can storm homes and rip people out of their cars.&#8221; On Feb. 4, Jeffries joined Senate Minority Leader Chuck Schumer in writing a <a href=\"https://jeffries.house.gov/2026/02/04/leaders-jeffries-and-schumer-deliver-urgent-ice-reform-demands-to-republican-leadership/\" rel=\"noreferrer noopener\" target=\"_blank\">letter</a> to House Speaker Mike Johnson and Senate Majority Leader John Thune to propose &#8220;targeted enforcement,&#8221; where &#8220;DHS officers cannot enter private property without a judicial warrant.&#8221; In the letter, Jeffries and Schumer proposed 10 &#8220;common sense solutions that protect constitutional rights and ensure responsible law enforcement.&#8221;</p>\n\n\n\n<p>Meanwhile, during a Feb. 1 <a href=\"https://transcripts.cnn.com/show/sotu/date/2026-02-01/segment/01\" rel=\"noreferrer noopener\" target=\"_blank\">interview</a> on CNN&#8217;s &#8220;State of the Union,&#8221; Republican Sen. Ron Johnson called the Democrats&#8217; demand for judicial warrants &#8220;completely unacceptable,&#8221; stating that &#8220;immigration has always been enforced through administrative warrants.&#8221; Also, on Feb. 3, House Speaker Johnson <a href=\"https://youtu.be/0YjF2wKBDTA?t=1400\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> that &#8220;adding an entirely new layer of judicial warrants&#8221; was &#8220;unimplementable.&#8221;</p>\n\n\n\n<p>We&#8217;ll explain the differences between the two types of warrants and how the Trump administration&#8217;s use of administrative warrants has departed from past practices.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Judicial vs. Administrative Warrants</h2>\n\n\n\n<p>According to the <a href=\"https://www.nilc.org/wp-content/uploads/2025/01/2025-Subpoenas-Warrants_.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">National Immigration Law Center</a>, judicial warrants are &#8220;formal written [orders] authorizing a law enforcement officer to make an arrest, a seizure, or a search.&#8221; They are issued by state and federal courts and signed by judges or magistrate judges. As these warrants allow search, seizures and arrests on private property, they are more <a href=\"https://www.motionlaw.com/the-difference-between-judicial-and-administrative-warrants/\" rel=\"noreferrer noopener\" target=\"_blank\">specific</a> than administrative warrants, and include details like the address, time frame and targets of the search.</p>\n\n\n\n<p>Administrative warrants authorize law enforcement officers with federal agencies to make an arrest or seizure, but not a search. “An administrative warrant does not confer authority to enter a home or private area,” the nonpartisan Congressional Research Service <a href=\"https://www.congress.gov/crs_external_products/LSB/PDF/LSB10362/LSB10362.6.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">explained</a> in a 2021 report, linking to a 2007 DHS letter.</p>\n\n\n\n<p>&#8220;Administrative warrants are not reviewed or signed by a federal judge or even an immigration judge, they are reviewed and signed by immigration officers,&#8221; <a href=\"https://www.slgattorneysflorida.com/lawyers/john-gihon/\" rel=\"noreferrer noopener\" target=\"_blank\">John Gihon</a>, an immigration attorney and past chair of the American Immigration Lawyers Association Central Florida Chapter, told us in an email. </p>\n\n\n\n<p>There are two forms of administrative warrants, known as I-200 and I-205 forms. According to the <a href=\"https://www.americanimmigrationcouncil.org/fact-sheet/ice-cbp-legal-analysis/\" rel=\"noreferrer noopener\" target=\"_blank\">American Immigration Council</a>, I-200 forms are issued to arrest &#8220;anyone federal agents believe to be present in the United States in violation of federal immigration law.&#8221; Conversely, the I-205 form &#8220;authorizes an immigration officer to arrest and deport someone who has previously been ordered removed from the United States.&#8221;</p>\n\n\n\n<p>Under the Trump administration, immigration arrests by ICE <a href=\"https://www.factcheck.org/2026/01/as-ice-arrests-increased-a-higher-portion-had-no-u-s-criminal-record/\" rel=\"noreferrer noopener\" target=\"_blank\">have increased</a> considerably, and agents can more quickly obtain administrative, versus judicial, warrants, experts said.</p>\n\n\n\n<p>Regarding Speaker Johnson&#8217;s characterization of judicial warrant requirements as &#8220;unimplementable,&#8221; <a href=\"https://www.migrationpolicy.org/about/staff/kathleen-bush-joseph\" rel=\"noreferrer noopener\" target=\"_blank\">Kathleen Bush-Joseph</a>, a lawyer and U.S. immigration policy analyst at the Migration Policy Institute, told us in a phone interview that when you consider &#8220;the number of arrests that the Department of Homeland Security says that they made last year, which is in the hundreds of thousands … if they had to get judicial warrants for all of those people, that would certainly be a significant administrative burden.&#8221;</p>\n\n\n\n<p>Historically, Sen. Johnson&#8217;s statement that immigration enforcement has &#8220;always&#8221; been conducted with administrative warrants is accurate. According to Gihon, &#8220;immigration law has always been enforced through [administrative] warrants,&#8221; as &#8220;[u]nder the Immigration and Nationality Act, a judicial warrant is not required to make an immigration arrest.&#8221;</p>\n\n\n\n<p>However, the Trump administration has <a href=\"https://www.dhs.gov/news/2026/02/03/icymi-general-counsel-james-percivals-wall-street-journal-op-ed-administrative\" rel=\"noreferrer noopener\" target=\"_blank\">determined</a> — contrary to the practice of previous administrations — that administrative warrants allow immigration officers to &#8220;arrest illegal aliens with final orders of removal in their homes,&#8221; as DHS has said. This position has raised concerns about the Fourth Amendment.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Fourth Amendment and Rights of Noncitizens</h2>\n\n\n\n<p>The Fourth Amendment <a href=\"https://constitution.congress.gov/constitution/amendment-4/\" rel=\"noreferrer noopener\" target=\"_blank\">protects</a> &#8220;[t]he right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures.&#8221; That has historically prevented immigration agents with only an administrative warrant from forcibly entering homes.</p>\n\n\n\n<p>In an <a href=\"https://www.brennancenter.org/our-work/analysis-opinion/dhs-warrantless-home-entry-memos-fourth-amendment-problem\" rel=\"noreferrer noopener\" target=\"_blank\">analysis</a> updated on Feb. 4, <a href=\"https://www.brennancenter.org/about/staff/hannah-james\" rel=\"noreferrer noopener\" target=\"_blank\">Hannah James</a>, a counsel in the Brennan Center for Justice&#8217;s Liberty and National Security Program, wrote that &#8220;the home receives the highest protection under the Fourth Amendment,&#8221; and reiterated that the ability to enter a home with a judicial versus an administrative warrant is &#8220;very different from a Fourth Amendment perspective.&#8221;</p>\n\n\n\n<p>However, in January, the Associated Press <a href=\"https://apnews.com/article/ice-arrests-warrants-minneapolis-trump-00d0ab0338e82341fd91b160758aeb2d\" rel=\"noreferrer noopener\" target=\"_blank\">obtained</a> a leaked May 12, 2025, <a href=\"https://www.documentcloud.org/documents/26499371-dhs-ice-memo-1-21-26/\" rel=\"noreferrer noopener\" target=\"_blank\">memo</a> written by Acting ICE Director Todd Lyons, in which he said: &#8220;Although the U.S. Department of Homeland Security (DHS) has not historically relied on administrative warrants alone to arrest aliens subject to final orders of removal in their place of residence, the DHS Office of General Counsel has recently determined that the U.S. Constitution, the Immigration and Nationality Act, and the immigration regulations do not prohibit relying on administrative warrants for this purpose.&#8221;</p>\n\n\n\n<p>Lyons was referring to the I-205 warrants, which target noncitizens with a final order of removal. According to an American Immigration Council <a href=\"https://www.americanimmigrationcouncil.org/fact-sheet/removal-system-united-states-overview/#:~:text=If%20an%20immigration%20judge%20finds%20a%20noncitizen%20to%20be%20removable,target%20for%20arrest%20by%20ICE.\" rel=\"noreferrer noopener\" target=\"_blank\">fact sheet</a>, final orders of removal are issued when &#8220;an immigration judge finds a noncitizen to be removable&#8221; and the noncitizen fails to file an appeal within 30 days, waives the right to appeal or has an appeal dismissed by the Board of Immigration Appeals. The government can then choose to execute the removal order, where it notifies the noncitizen to surrender to ICE for deportation or face arrest.</p>\n\n\n\n<p>In using the I-205 warrant, the DHS memo said, immigration officers should knock on a resident&#8217;s door and identify themselves. Then, they should &#8220;allow those inside the residence a reasonable chance to act lawfully. Should the alien refuse admittance, ICE officers and agents should use only a necessary and reasonable amount of force to enter the alien&#8217;s residence, following proper notification of the officer’s or agent’s authority and intent to enter.&#8221;</p>\n\n\n\n<p>In a Feb. 4 DHS <a href=\"https://www.dhs.gov/news/2026/02/04/dhs-sets-record-straight-administrative-warrants-and-american-public-support\" rel=\"noreferrer noopener\" target=\"_blank\">press release</a> setting &#8220;the record straight on administrative warrants,&#8221; DHS stated that there is &#8220;broad judicial recognition that illegal aliens aren&#8217;t entitled to the same Fourth Amendment protections as U.S. citizens.&#8221; Accordingly, the press release said, &#8220;While administrative warrants may satisfy the Fourth Amendment for any arrest of an illegal alien, ICE currently uses these warrants to enter an illegal alien&#8217;s residence only when the alien has received a final order of removal from an Immigration Judge.&#8221;</p>\n\n\n\n<p>Therefore, immigration enforcement agencies have claimed the power to use administrative warrants to enter private homes to arrest noncitizens with final orders of removal. However, immigration experts told us this interpretation runs contrary to constitutional protections, particularly the Fourth Amendment.</p>\n\n\n\n<p>Bush-Joseph told us that &#8220;the understanding had been that immigrants, like U.S. citizens, were protected by the Fourth Amendment from forcible entry into their homes without a judicial warrant.&#8221;</p>\n\n\n\n<p>James wrote that the Supreme Court &#8220;has never held, nor suggested, that undocumented immigrants within the United States receive lesser Fourth Amendment protection than citizens or noncitizens with legal status.&#8221; James explained that &#8220;among lower courts, the [prevailing view] is that undocumented immigrants within the United States have the same Fourth Amendment protections as U.S. citizens.&#8221;</p>\n\n\n\n<p>On Feb. 3, Speaker Johnson described his frustration with limitations on administrative warrants, specifically when someone runs into a private home. Johnson commented that &#8220;the controversy has erupt where if someone is … going to be apprehended and they run behind a closed door and lock the door. I mean, what is ICE supposed to do?&#8221;</p>\n\n\n\n<p>The DHS press release echoed such concerns, arguing that &#8220;[b]ecause Congress hasn’t created a mechanism to obtain a judicial warrant, this meant that under previous presidential administrations, ICE would sit outside the homes of fugitive aliens waiting for them to come outside before arresting them.&#8221; DHS said, &#8220;Illegal aliens quickly identified this loophole&#8221; and would &#8220;openly taunt the ICE officers&#8221; waiting outside.</p>\n\n\n\n<p>When asked about the situation Johnson described, Gihon said via email, &#8220;Prior to the current Trump term, immigration officers were trained not to enter private residences or private areas of public property without consent or an exception to the 4th amendment&#8217;s warrant requirement.&#8221;</p>\n\n\n\n<p>We reached out to Johnson&#8217;s office for comment, but did not receive a response. </p>\n\n\n\n<p>The May 2025 DHS memo said that &#8220;standard exceptions to the Fourth Amendment warrant requirement apply equally in the context of Form I-205 warrants,&#8221; including getting consent to go into a person&#8217;s home and &#8220;exigent circumstances,&#8221; such as &#8220;hot pursuit,&#8221; risks of evidence destruction or potential violence, attempts to flee, and &#8220;a substantial risk of harm to the persons involved or to the law enforcement process if the officer or agent must wait for a warrant.&#8221;</p>\n\n\n\n<p>According to a 2021 Congressional Research Service report, the <a href=\"https://www.congress.gov/crs-product/LSB10630\" rel=\"noreferrer noopener\" target=\"_blank\">hot pursuit doctrine</a> &#8220;provides that police may pursue a fleeing felony suspect into a home, when they have probable cause to make an arrest and when they set that arrest in motion in a public place.&#8221;</p>\n\n\n\n<p>However, Gihon told us that the hot pursuit exception wouldn&#8217;t apply to arrests for civil immigration violations. &#8220;The U.S. Supreme Court has held that hot pursuit does not even extend to all criminal offenses,&#8221; he said, citing the 2021 Supreme Court case Lange v. California.</p>\n\n\n\n<p>Referring to the DHS concerns about judicial warrants, James wrote that &#8220;DHS&#8217;s view that it lacks sufficient access to judicial warrants is not a valid basis for the agency to dispense with the requirements of the Fourth Amendment,&#8221; and that &#8220;constraints on ICE&#8217;s ability to obtain judicial warrants … may very well reflect Congress&#8217;s decided judgment that civil immigration violations should not be pursued by entering people&#8217;s homes.&#8221;</p>\n\n\n\n<p>Finally, regarding the DHS position that ICE can use administrative warrants to enter a person&#8217;s residence when there is a final order of removal, Gihon told us that he was unaware of &#8220;any previous controlling interpretation of administrative or constitutional law&#8221; that would permit such entry.</p>\n\n\n\n<p>Ultimately, the issue could be decided by the courts. James wrote that &#8220;the&nbsp;case law in this area is sparse,&#8221; citing three rulings by District Courts. &#8220;The paucity of case law is likely in part because DHS has&nbsp;historically&nbsp;conceded&nbsp;that administrative arrest warrants do not authorize ICE officers to enter people’s homes to arrest them. As a result, courts have rarely had occasion to comment on the issue.&#8221;</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><em>Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through <a href=\"https://giving.aws.cloud.upenn.edu/?fastStart=simpleForm&amp;program=ANS&amp;fund=602014\" rel=\"noreferrer noopener\" target=\"_blank\">our “Donate” page</a>. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, P.O. Box 58100, Philadelphia, PA 19102. </em></p>\n<p>The post <a href=\"https://www.factcheck.org/2026/02/the-disagreement-over-judicial-and-administrative-warrants-for-ice/\">The Disagreement over Judicial and Administrative Warrants for ICE</a> appeared first on <a href=\"https://www.factcheck.org\">FactCheck.org</a>.</p>",
    "url": "https://www.factcheck.org/2026/02/the-disagreement-over-judicial-and-administrative-warrants-for-ice/",
    "publication_date": "Tue, 17 Feb 2026 19:06:22 +0000",
    "date_gathered": "2026-02-24T04:09:44.214256",
    "country": "US",
    "organization": "FactCheck"
  },
  {
    "title": "Trump and Musk Amplify Long-Ago Debunked  Mail-In Vote Fraud Claim",
    "content": "<img alt=\"\" class=\"attachment-medium_large size-medium_large wp-post-image\" height=\"273\" src=\"https://cdn.factcheck.org/UploadedFiles/Mail-ballot.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"640\" />\n<p>A social media post cited by Elon Musk to bolster his argument that mail-in voting should be curtailed, and which was subsequently amplified by President Donald Trump, makes the false and long-ago debunked claim that in the 2020 election, &#8220;Pennsylvania sent out 1,823,148 mail-in ballots but received back around 2.5 MILLION mail-in ballots.&#8221;</p>\n\n\n\n<p>As the Pennsylvania Department of State&#8217;s final <a href=\"https://www.pa.gov/content/dam/copapwp-pagov/en/dos/programs/voting-and-elections/2020-General-Election-Report.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">report</a> on the 2020 election shows, there were 2,673,272 mail-in ballot applications approved for the 2020 general election, so that&#8217;s how many were sent out. And of those, 2,273,490 votes were cast. (See charts 6.2 and 6.3 in the report.) Another 435,932 absentee ballots were also approved, and 374,659 of them were cast.</p>\n\n\n\n<p>&#8220;This claim is based on mixing up statistics from the primary and the general election,&#8221; Charles Stewart III, director of the MIT Election Data and Science Lab, explained to us via email.</p>\n\n\n\n<p>As online <a href=\"https://www.pa.gov/content/dam/copapwp-pagov/en/dos/resources/voting-and-elections/reports/2020-08-01-Act35Report.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">Pennsylvania records</a> show, there were roughly 1.8 million absentee and mail-in ballots approved for the <em>primary</em> election in 2020, nearly 1.5 million of which were cast. In other words, the post mixes up the number of mail-in ballots (including absentee ballots) sent out for the 2020 <em>primary</em> election and then cites approximately the number of mail-in ballots cast in the 2020 <em>general</em> election.</p>\n\n\n\n<p>&#8220;These are long-ago debunked claims that will not disappear despite the availability of official data,&#8221; Stewart said. </p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">The Posts</h2>\n\n\n\n<p>Trump has been making <a href=\"https://www.factcheck.org/2025/08/factchecking-trumps-claims-about-mail-in-ballots-voting-machines-and-states-role/\" rel=\"noreferrer noopener\" target=\"_blank\">false and unfounded claims</a> related to <a href=\"https://www.factcheck.org/2020/09/trumps-repeated-false-attacks-on-mail-in-ballots/\" rel=\"noreferrer noopener\" target=\"_blank\">mail-in voting</a> for years. And he has long called for <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-interview-larry-kudlow-fox-business-february-9-2023/#26\" rel=\"noreferrer noopener\" target=\"_blank\">ending mail-in voting</a> &#8220;other than if you&#8217;re in the military, or you&#8217;re sick, or you&#8217;re away, or some reasonable but good excuse,&#8221; as he said on Feb. 9.</p>\n\n\n\n<p>Tesla and SpaceX CEO Musk, a former Trump adviser, agrees, according to a Feb. 8 <a href=\"https://x.com/LeadingReport/status/2020500166089089159\" rel=\"noreferrer noopener\" target=\"_blank\">post</a> from an X account called The Leading Report: &#8220;Elon Musk calls for mail-in voting to be abolished nationwide except for troops overseas or a serious medical condition.&#8221; Musk reposted it and <a href=\"https://x.com/elonmusk/status/2020521601872048305\" rel=\"noreferrer noopener\" target=\"_blank\">commented</a>, &#8220;Critical to avoid fraud.&#8221;</p>\n\n\n\n<p>The same day, The SCIF &#8212; an X account whose bio identifies the operator as a &#8220;Digital Operator, Creator and Intelligence Researcher&#8221; with the motto, &#8220;Truth is the most effective weapon in a war of information filled with lies&#8221; &#8212; weighed in with <a href=\"https://x.com/TheSCIF/status/2020570499743445054\" rel=\"noreferrer noopener\" target=\"_blank\">an X post</a> that read: &#8220;Elon is right, banning mail-in voting is critical to avoiding fraud in our elections. During the 2020 election, Pennsylvania sent out 1,823,148 mail-in ballots but received back around 2.5 MILLION mail-in ballots. This accounts for Biden&#8217;s fraudulent and impossible 682,000+ vote spike, which were counted with NO observers and were all for Biden, which magically just happened to be enough to steal Trump&#8217;s almost 700,000 vote lead in PA before swing states shut down counting locations at the same time, to steal the 2020 election. PA&#8217;s own Secretary of State website then wiped the 2.5 MILLION mail-in ballot number after the total number was questioned. Trump won the 2020 election in a landslide.&#8221;</p>\n\n\n\n<p>Musk <a href=\"https://x.com/elonmusk/status/2020838047495995886\" rel=\"noreferrer noopener\" target=\"_blank\">reposted</a> that, and commented, &#8220;Essential to stop fraud in elections.&#8221; On Feb. 10, Trump reposted the claim and Musk&#8217;s response on <a href=\"https://truthsocial.com/@realDonaldTrump/posts/116046118344224496\" rel=\"noreferrer noopener\" target=\"_blank\">Truth Social</a>, without comment.</p>\n\n\n\n<p>This latest criticism of mail-in voting comes as Congress considers the <a href=\"https://www.congress.gov/bill/119th-congress/house-bill/7296/text\" rel=\"noreferrer noopener\" target=\"_blank\">SAVE America Act</a>, which would require voters to provide documentary proof of U.S. citizenship when registering to vote, and also photo identification to vote in federal elections. It would not abolish mail-in voting, but it would require a copy of identification to both request and submit a mail-in ballot.</p>\n\n\n\n<p>Mail-in voting is widely used around the country. Eight states and Washington, D.C., conduct their elections mostly by mail, according to the <a href=\"https://www.ncsl.org/elections-and-campaigns/table-18-states-with-all-mail-elections\" rel=\"noreferrer noopener\" target=\"_blank\">National Conference of State Legislatures</a>. Another 28 states &#8212; including Pennsylvania &#8212; offer <a href=\"https://www.ncsl.org/elections-and-campaigns/table-1-states-with-no-excuse-absentee-voting\" rel=\"noreferrer noopener\" target=\"_blank\">&#8220;no excuse&#8221;</a> mail-in voting, meaning that any voter can request a mail-in ballot without needing to provide a reason. (Pennsylvania has both no-excuse mail-in ballots as well as absentee ballots for those who can&#8217;t make it to a polling place due to illness, disability, work or travel.)</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">The Origins</h2>\n\n\n\n<p>The post claiming there were hundreds of thousands more mail-in ballots received than were actually sent out in Pennsylvania &#8212; a swing state that <a href=\"https://www.cnn.com/election/2020/results/president\" rel=\"noreferrer noopener\" target=\"_blank\">broke for Biden</a> in 2020 &#8212; originated in a Nov. 25, 2020, <a href=\"https://www.youtube.com/live/ohe2dQbNJwM?si=f6jghzWFKIs5ZWXP&amp;t=4127\" rel=\"noreferrer noopener\" target=\"_blank\">hearing</a> held by Pennsylvania Senate Republicans (a video of which is attached to the post). During that hearing, then-Trump attorney Rudy Giuliani referred to Pennsylvania voting data and said, &#8220;Now this is the part that is a mystery. Mailed ballots sent out: 1,823,148. But when you go to the count of the final count of the vote, there are 2,589,242 mail-in ballots.&#8221; Giuliani asked witness Phil Waldron, a retired Army colonel, &#8220;How do you account for the 700,000 mail-in ballots that appeared from nowhere?&#8221;</p>\n\n\n\n<p>Waldron, who has <a href=\"https://www.vice.com/en/article/phil-waldron-powerpoint-incited-jan-6/\" rel=\"noreferrer noopener\" target=\"_blank\">promoted</a> many unfounded theories about manipulated voting machines, speculated the voting machines may have been tampered with and called for a &#8220;detailed forensic analysis&#8221; of the voting machines used in Pennsylvania.</p>\n\n\n\n<p>(Waldron later circulated a <a href=\"https://www.nytimes.com/2021/12/10/us/politics/capitol-attack-meadows-powerpoint.html?smid=tw-share\" rel=\"noreferrer noopener\" target=\"_blank\">PowerPoint</a> document to Trump allies that drew the attention of the House committee investigating the Jan. 6, 2021, attack on the Capitol. At the time, Democratic Rep. Bennie Thompson, chair of the panel, <a href=\"https://www.vice.com/en/article/phil-waldron-powerpoint-incited-jan-6/\" rel=\"noreferrer noopener\" target=\"_blank\">called</a> the document &#8220;an alarming blueprint for overturning a nationwide election.&#8221; According to the Jan. 6 <a href=\"https://www.govinfo.gov/content/pkg/GPO-J6-REPORT/pdf/GPO-J6-REPORT.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">committee report</a>, Waldron was among those who &#8220;invoked their Fifth Amendment privilege against self-incrimination when asked by the Select Committee what supposed proof they uncovered that the election was stolen.&#8221;)</p>\n\n\n\n<p>But again, the premise of Giuliani&#8217;s question was flawed. There were not more ballots returned in Pennsylvania than had been sent out. </p>\n\n\n\n<p>&#8220;This is completely false,&#8221; Kathy Boockvar, who was the Pennsylvania secretary of the commonwealth at the time of the 2020 election, said in an email to us about the online claim. She explained the same thing at the time in a Dec. 16, 2020, <a href=\"https://www.pa.gov/content/dam/copapwp-pagov/en/dos/alerts-and-notices/statements/2020-12-16-Senator-Johnson-and-Peters.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">letter</a> to U.S. Sens. Ron Johnson and Gary Peters about similar claims.</p>\n\n\n\n<p>All of the election data are, and were, in public records available online, and they contradict Giuliani&#8217;s claim.</p>\n\n\n\n<p>The claim is also contradicted by the <a href=\"https://electproject.github.io/Early-Vote-2020G/PA.html\" rel=\"noreferrer noopener\" target=\"_blank\">contemporaneous reporting</a> made to the U.S. Elections Project, a clearinghouse for voting data maintained by Mike McDonald, a professor at the University of Florida.</p>\n\n\n\n<p>&#8220;The individual-level Pennsylvania 2020 mail ballot data I received on a daily basis from the Secretary of State’s office does not substantiate these allegations,&#8221; McDonald told us via email. &#8220;Pennsylvania election officials reported issuing a little over 3 million mail ballots during the COVID crisis, of which election officials accepted a little more than 2.6 million returned ballots.&#8221; Those figures include both mail-in and absentee ballots. </p>\n\n\n\n<p>And the claim is further contradicted by news accounts <a href=\"https://www.nbcphiladelphia.com/news/politics/decision-2020/pennsylvania-mail-in-ballot-requests-hit-2-8-million-including-700000-gop-voters/2567670/\" rel=\"noreferrer noopener\" target=\"_blank\">before</a> the election that cited the correct number of ballot requests for the general election.</p>\n\n\n\n<p>Indeed, the bogus claim was <a href=\"https://www.usatoday.com/story/news/factcheck/2020/11/28/fact-check-pennsylvania-ballot-claim-mixes-primary-general-election-data/6450032002/\" rel=\"noreferrer noopener\" target=\"_blank\">widely</a> <a href=\"https://www.reuters.com/article/world/fact-check-post-mixes-pennsylvania-primary-and-general-election-data-to-suggest-idUSKBN28B5NM/\" rel=\"noreferrer noopener\" target=\"_blank\">debunked</a> at the time.</p>\n\n\n\n<p>&#8220;It&#8217;s pretty unbelievable this is still being used,&#8221; <a href=\"https://seventy.org/staff-board\">Eric Kraeutler</a>, a member of the board of directors and former chair of the Committee of Seventy, a Philadelphia-based election watchdog, told us in a phone interview. &#8220;They mixed up data for these two separate elections (the 2020 primary and general elections). &#8230; As far as we&#8217;re concerned, this was disposed of five or six years ago.&#8221;</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><em>Editor’s note:&nbsp;FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through&nbsp;<a href=\"https://giving.aws.cloud.upenn.edu/?fastStart=simpleForm&amp;program=ANS&amp;fund=602014\" rel=\"noreferrer noopener\" target=\"_blank\">our “Donate” page</a>. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, P.O. Box 58100, Philadelphia, PA 19102.&nbsp;</em></p>\n<p>The post <a href=\"https://www.factcheck.org/2026/02/trump-and-musk-amplify-long-ago-debunked-mail-in-vote-fraud-claim/\">Trump and Musk Amplify Long-Ago Debunked  Mail-In Vote Fraud Claim</a> appeared first on <a href=\"https://www.factcheck.org\">FactCheck.org</a>.</p>",
    "url": "https://www.factcheck.org/2026/02/trump-and-musk-amplify-long-ago-debunked-mail-in-vote-fraud-claim/",
    "publication_date": "Fri, 13 Feb 2026 16:14:47 +0000",
    "date_gathered": "2026-02-24T04:09:44.214260",
    "country": "US",
    "organization": "FactCheck"
  },
  {
    "title": "Trump Oversells Recent U.S. Economic Growth",
    "content": "<img alt=\"\" class=\"attachment-medium_large size-medium_large wp-post-image\" height=\"273\" src=\"https://cdn.factcheck.org/UploadedFiles/Shopping-720-x-307.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"640\" />\n<p>In the second and third quarters of 2025, the U.S. economy grew at its fastest pace in two years. Those growth rates were not &#8220;numbers unheard of,&#8221; or figures the U.S. &#8220;never had&#8221; before, as President Donald Trump has claimed.</p>\n\n\n\n<p>In addition, economic experts told us that federal data do not support Trump&#8217;s claim that there was economic &#8220;stagflation&#8221; during the Biden administration and “the complete opposite” during Trump’s first year back in office. Inflation was high during much of Joe Biden&#8217;s presidency, but economic growth was not stagnant, another key indicator of stagflation, the experts said.&nbsp;</p>\n\n\n\n<p>They also said that Trump’s tariff policies likely hindered economic growth, rather than helped spur it, as the president has suggested.&nbsp;</p>\n\n\n\n<p>Trump made those claims while touting the U.S. economy in recent speeches and remarks, as well as in a late January opinion piece written for the Wall Street Journal.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Economic Growth</h2>\n\n\n\n<p>During a Jan. 27 <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-economy-energy-clive-iowa-january-27-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">speech</a> in Iowa, Trump said, “So, under my leadership, economic growth is exploding to numbers unheard of. They&#8217;ve never had them before.”</p>\n\n\n\n<p>He later said in <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-interview-tom-llamas-nbc-news-february-4-2026/#365\" rel=\"noreferrer noopener\" target=\"_blank\">an interview</a> with NBC News on <a href=\"https://youtu.be/rT6eucDVmFY?si=ruC7Zho8b2Zj1sKU&amp;t=16\" rel=\"noreferrer noopener\" target=\"_blank\">Feb. 4</a>, “We have low inflation and we have tremendous growth. You haven&#8217;t had these numbers like this.”</p>\n\n\n\n<p>And when claiming to have achieved &#8220;unprecedented&#8221; growth numbers in a Jan. 29 Cabinet <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-cabinet-meeting-january-29-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">meeting</a> at the White House, Trump said that if not for the <a href=\"https://www.politico.com/live-updates/2025/11/12/congress/trump-signs-bill-ending-longest-government-shutdown-in-us-history-00650189\" rel=\"noreferrer noopener\" target=\"_blank\">43-day</a> federal government shutdown last fall,<strong> “</strong>we would have picked up about a point and a half more than [the] already high numbers, record setting numbers.”</p>\n\n\n\n<p>While the U.S. economy grew significantly in the second and third quarters of 2025, <a href=\"https://perma.cc/9DQR-APL2\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a> the most recent data from the Bureau of Economic Analysis, the numbers did not set records, as Trump claimed.</p>\n\n\n\n<p>After declining by an annualized rate of <a href=\"https://www.bea.gov/sites/default/files/2026-01/gdp3q25-updated.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">0.6%</a> in the first quarter of 2025, which covers the three months from January to March, real gross domestic product (meaning it has been adjusted for inflation) grew at an annualized rate of 3.8% in the second quarter of 2025 and at a rate of 4.4% in the third quarter. Those were the largest quarterly increases since the third quarter of 2023, under Biden, when the economy expanded at an annualized rate of 4.7%, <a href=\"https://apps.bea.gov/iTable/?reqid=19&amp;step=2&amp;isuri=1&amp;categories=survey&amp;_gl=1*sn2p5o*_ga*MjA0NDMwMzg2OS4xNzY2MTc1OTM5*_ga_J4698JNNFT*czE3NzA4MTMzNjIkbzE2JGcxJHQxNzcwODEzNjI4JGo1NiRsMCRoMA..#eyJhcHBpZCI6MTksInN0ZXBzIjpbMSwyLDNdLCJkYXRhIjpbWyJjYXRlZ29yaWVzIiwiU3VydmV5Il0sWyJOSVBBX1RhYmxlX0xpc3QiLCIxIl1dfQ==\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a> BEA estimates.</p>\n\n\n\n<p>The record for quarterly growth is 34.9% in the third quarter of 2020, which happened right after the economy shrunk by 28% at the start of the COVID-19 pandemic. The pre-pandemic quarterly growth record is 16.7% in the first quarter of 1950, <a href=\"https://apps.bea.gov/iTable/?reqid=19&amp;step=2&amp;isuri=1&amp;categories=survey&amp;_gl=1*sn2p5o*_ga*MjA0NDMwMzg2OS4xNzY2MTc1OTM5*_ga_J4698JNNFT*czE3NzA4MTMzNjIkbzE2JGcxJHQxNzcwODEzNjI4JGo1NiRsMCRoMA..#eyJhcHBpZCI6MTksInN0ZXBzIjpbMSwyLDNdLCJkYXRhIjpbWyJjYXRlZ29yaWVzIiwiU3VydmV5Il0sWyJOSVBBX1RhYmxlX0xpc3QiLCIxIl1dfQ==\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a> BEA quarterly data going back to 1947.</p>\n\n\n\n<div style=\"width: 100%; height: 0px; overflow: hidden;\"></div>\n\n\n\n<p>On <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-interview-larry-kudlow-fox-business-february-9-2023/#121\" rel=\"noreferrer noopener\" target=\"_blank\">several</a> <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-world-economic-forum-davos-january-21-2026/#4\" rel=\"noreferrer noopener\" target=\"_blank\">occasions</a>, Trump has said that fourth quarter growth is projected to be 5.4%, a figure that he has <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-cabinet-meeting-january-29-2026/#14\">attributed</a> to the Federal Reserve Bank in Atlanta. But that projection is now out of date.</p>\n\n\n\n<p>Throughout much of January,&nbsp;the Federal Reserve Bank of Atlanta&#8217;s GDPNow model <a href=\"https://www.atlantafed.org/research-and-data/data/gdpnow/archive-of-past-gdpnow-commentaries\" rel=\"noreferrer noopener\" target=\"_blank\">was projecting</a> growth of 5.4% for the fourth quarter of 2025. Then, on Jan. 29, the projection lowered to 4.2%, and, as of Feb. 10, it was down again, to 3.7% projected growth.</p>\n\n\n\n<p>The BEA is <a href=\"http://www.bea.gov/news/schedule\" rel=\"noreferrer noopener\" target=\"_blank\">scheduled</a> to release its advanced estimate of GDP for the fourth quarter, and all of 2025, on Feb. 20.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Stagflation</h2>\n\n\n\n<p>Trump also has claimed that he turned around an economy that had stalled under Biden.</p>\n\n\n\n<p>&#8220;Under the Biden administration, America was plagued by the nightmare of stagflation, meaning low growth and high inflation, a recipe for misery, failure and decline. But now, after just one year of my policies, we are witnessing the exact opposite – virtually no inflation and extraordinarily high economic growth,&#8221; Trump <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-speech-world-economic-forum-davos-january-21-2026/#4\">said</a> at a World Economic Forum meeting on Jan. 21.</p>\n\n\n\n<p>He repeated the &#8220;stagflation&#8221; claim in his Jan. 30 <a href=\"https://www.wsj.com/opinion/donald-j-trump-my-tariffs-have-brought-america-back-2248391b?gaa_at=eafs&amp;gaa_n=AWEtsqdujoYASVpXAKhWH0d8VpV3RR2tTIi7QAPZ6qpGWfoFQhykKbCtEOKJDks8oBw%3D&amp;gaa_ts=698620ab&amp;gaa_sig=Q0bYrtOcyojXwvt8kueM4jmyxBippiMnrV5ItFSvhL7eaJM7JW_yPnIhiII02V46MYjeRy3WB2sN-BQEp75tCA%3D%3D\">opinion piece</a> published in the Wall Street Journal.</p>\n\n\n\n<p>But economists told us that the U.S. economy under Biden did not experience stagflation, which has a specific economic meaning.</p>\n\n\n\n<p>“It refers to a sustained period of high inflation combined with weak or stagnant real economic growth, typically alongside rising unemployment,” <a href=\"https://gps.ucsd.edu/faculty-directory/kyle-handley.html\">Kyle Handley</a>, a professor of economics at the University of California, San Diego, told us in an email. “By that definition, the U.S. economy during the Biden years does not qualify as stagflation.”</p>\n\n\n\n<p>Handley said that the <a href=\"https://www.bls.gov/charts/consumer-price-index/consumer-price-index-by-category-line-chart.htm\" rel=\"noreferrer noopener\" target=\"_blank\">annual inflation rate</a> did “rise sharply” during Biden’s first two years in office. It peaked in June 2022, at 9.1%, before declining dramatically in Biden’s last two years in office.&nbsp;</p>\n\n\n\n<p>“However, real GDP growth during the Biden presidency was positive and often above trend, and unemployment remained historically low,” Handley said. “Real GDP grew strongly in 2021 during the post-pandemic recovery, slowed in 2022 as monetary policy tightened, and then re-accelerated in 2023 and 2024. That is not a period of economic stagnation.”</p>\n\n\n\n<p>In an <a href=\"https://www.clevelandfed.org/collections/infographics/2025/infogr-20251117-stagflation\" rel=\"noreferrer noopener\" target=\"_blank\">infographic</a> from November, the staff of the Federal Reserve Bank of Cleveland wrote that the “last major case” of stagflation in the U.S. “occurred in the mid-1970s, when global crude oil prices surged, triggering widespread rises in other prices and fueling inflation of more than 12 percent and unemployment that peaked at 9 percent.” The infographic said that stagflation &#8212; the combination of rising unemployment and inflation, and slowing economic growth all at the same time &#8212; was &#8220;rare&#8221; and &#8220;an unusual pattern.&#8221;</p>\n\n\n\n<p>When we asked about the basis for the president&#8217;s stagflation claim, a White House spokesperson told us that &#8220;[r]eal wages shrank markedly during the Biden presidency, and growth – once you put aside the early bit of Biden admin when Democrat state officials finally started lifting unscientific and draconian lockdowns – was tepid with inflation at 40-year highs.&#8221;</p>\n\n\n\n<p>There was a decrease in real wages under Biden, <a href=\"https://www.factcheck.org/2025/10/bidens-final-numbers/\" rel=\"noreferrer noopener\" target=\"_blank\">as we&#8217;ve written</a>. But the economy grew by well over 2% each year during his administration, and the rate of inflation, while still elevated, was not near a 40-year high when he left office. The 9.1% annual rate in June 2022 was the highest since <a href=\"https://www.bls.gov/news.release/archives/cpi_07132022.htm\" rel=\"noreferrer noopener\" target=\"_blank\">November 1981</a>.<strong> </strong>The rate was 3% in Biden&#8217;s final 12 months.</p>\n\n\n\n<div style=\"width: 100%; height: 0px; overflow: hidden;\"></div>\n\n\n\n<p>The unemployment rate also decreased under Biden, going from 6.4% when he was inaugurated to 4% in his last month, <a href=\"https://data.bls.gov/timeseries/LNS14000000\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a> the Bureau of Labor Statistics. The average monthly rate for Biden’s presidency was 4.1%, below the historical average. </p>\n\n\n\n<div style=\"width: 100%; height: 0px; padding: 100% 0px 0px; overflow: hidden;\"></div>\n\n\n\n<p>“You had high inflation, yes, but paired with strong growth and a robust labor market,” <a href=\"https://economics.wfu.edu/faculty-and-staff/aeimit-k-lakdawala/\" rel=\"noreferrer noopener\" target=\"_blank\">Aeimit Lakdawala</a>, an associate professor of economics at Wake Forest University, told us in an email. &#8220;That&#8217;s just not stagflation by any standard definition of the term.”&nbsp;</p>\n\n\n\n<p>He said that Trump’s claim of engineering a complete turnaround from the Biden economy is an overstatement.</p>\n\n\n\n<p>“What we&#8217;re really seeing is a continuation of trends that were already well underway before Trump took office in January 2025,” Lakdawala said.</p>\n\n\n\n<p>He noted that the annual inflation rate had cooled to 3% when Trump’s second term started. It had been as low as 2.4% in September 2024.</p>\n\n\n\n<p>“That disinflation happened under Biden, driven largely by the resolution of supply chain issues and Fed monetary policy,” he said, referring to the Federal Reserve. “Under Trump&#8217;s second term so far, inflation has averaged about 2.7%. That&#8217;s modestly lower, but it&#8217;s not a dramatic reversal.”</p>\n\n\n\n<p>Although Trump considers the 2.7% annual inflation rate, as of December, to be “very low” or “virtually no inflation,” it is still above the <a href=\"https://www.richmondfed.org/publications/research/econ_focus/2024/q1_q2_federal_reserve\" rel=\"noreferrer noopener\" target=\"_blank\">2% target</a> set by the Federal Reserve. Prices are still increasing, just at a slightly slower pace than before he became president again.</p>\n\n\n\n<p>As for economic growth, Lakdawala said that the increase in real GDP has “averaged about 2.5% annualized so far under Trump&#8217;s second term, which is solid but actually a touch lower than the 2.9% we saw” in Biden’s last two years as president.</p>\n\n\n\n<p>“So characterizing this as &#8216;extraordinarily high economic growth&#8217; is a stretch,” he said about Trump’s claim. “It&#8217;s good growth, roughly in line with where we&#8217;ve been.”</p>\n\n\n\n<p>The unemployment rate, meanwhile, was 4.3% in January, slightly higher than when Trump took office. </p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Tariff Effect</h2>\n\n\n\n<p>In his Wall Street Journal <a href=\"https://www.wsj.com/opinion/donald-j-trump-my-tariffs-have-brought-america-back-2248391b?gaa_at=eafs&amp;gaa_n=AWEtsqdujoYASVpXAKhWH0d8VpV3RR2tTIi7QAPZ6qpGWfoFQhykKbCtEOKJDks8oBw%3D&amp;gaa_ts=698620ab&amp;gaa_sig=Q0bYrtOcyojXwvt8kueM4jmyxBippiMnrV5ItFSvhL7eaJM7JW_yPnIhiII02V46MYjeRy3WB2sN-BQEp75tCA%3D%3D\" rel=\"noreferrer noopener\" target=\"_blank\">opinion piece</a>, Trump said that the &#8220;entire Trump economic agenda deserves credit for this explosion of growth&#8221; &#8212; but he specifically gave credit for the country&#8217;s &#8220;economic success&#8221; to his tariff policies.</p>\n\n\n\n<p>&#8220;We have proven, decisively, that, properly applied, tariffs do not hurt growth — they promote growth and greatness, just as I said all along,&#8221; the opinion piece said.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-full\"><img alt=\"\" class=\"wp-image-280256\" height=\"267\" src=\"https://cdn.factcheck.org/UploadedFiles/Shopping-400-x-267.png\" width=\"400\" /><figcaption class=\"wp-element-caption\">Shoppers wait in line at a grocery store on Jan. 23 in Lenexa, Kansas. Photo by Chase Castor/Getty Images.</figcaption></figure></div>\n\n\n<p>But the experts we consulted told us that the economy likely grew despite the tariffs, not because of them.</p>\n\n\n\n<p>&#8220;Year-over-year real GDP growth over the past year looks similar to the years immediately preceding the new tariffs,” Handley said. “Outside of the pandemic period, growth has been relatively stable across administrations, which makes it difficult to attribute recent performance to tariffs rather than economic momentum.”</p>\n\n\n\n<p>He noted that the tariffs that Trump placed on imported foreign goods last year were not as high as the rates he originally proposed, and that tariff revenue, which did increase significantly in 2025, is still quite small in relation to GDP (about 1% of GDP as of the third quarter of 2025, <a href=\"https://fredblog.stlouisfed.org/2025/07/the-evolution-of-import-tariffs/\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a> the Federal Reserve Bank of St. Louis).</p>\n\n\n\n<p>&#8220;By construction, a policy of that size cannot plausibly explain an increase in aggregate economic growth,&#8221; he said.</p>\n\n\n\n<p>Lakdawala had a similar take.</p>\n\n\n\n<p>&#8220;Crediting tariffs for economic growth gets the causation backwards,” he said. “The economics on this is fairly clear and there is broad consensus among economists: tariffs are essentially a tax on imports that raises costs for domestic consumers and businesses. If anything, they&#8217;ve been a modest drag on growth, not a driver of it.&#8221;</p>\n\n\n\n<p>He pointed to an analysis done by the Budget Lab at Yale, a nonpartisan research center, that said that in 2025 tariffs <a href=\"https://budgetlab.yale.edu/research/state-us-tariffs-november-17-2025\" rel=\"noreferrer noopener\" target=\"_blank\">slowed</a> real GDP growth by 0.5 percentage points and increased the unemployment rate by 0.3 percentage points. The Budget Lab <a href=\"https://budgetlab.yale.edu/research/state-us-tariffs-january-19-2026\" rel=\"noreferrer noopener\" target=\"_blank\">estimated</a> that tariffs will reduce real GDP growth by 0.4 percentage points in 2026, and said that &#8220;[i]n the long run, the US economy is persistently 0.3% smaller, the equivalent of $100 billion annually in 2025 dollars,&#8221; because of tariffs.</p>\n\n\n\n<p>&#8220;These aren&#8217;t catastrophic numbers and the economy is resilient and has absorbed the tariff shock reasonably well,” Lakdawala said. “But they clearly point in the wrong direction for someone trying to credit tariffs with economic success.”</p>\n\n\n\n<p>The pro-business Tax Foundation also <a href=\"https://taxfoundation.org/research/all/federal/trump-tariffs-trade-war/\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> that Trump&#8217;s imposed tariffs, if the Supreme Court rules that some of them can remain in effect, &#8220;will raise $2.0 trillion in revenue from 2026-2035 on a conventional basis and reduce US GDP by 0.5 percent, all before foreign retaliation&#8221; from other countries.&nbsp;</p>\n\n\n\n<p>The White House told us that, under Trump, the &#8220;[a]nnualized rate of inflation has been trending in the mid-twos and GDP growth in Q3 surpassed expectations by over a full point, hitting above 4 percent. Largely driven by the investments we are seeing thanks in part to tariffs.&#8221;</p>\n\n\n\n<p>But Handley noted that many of the investments <a href=\"https://www.factcheck.org/2025/12/factchecking-trumps-economic-speech/\" rel=\"noreferrer noopener\" target=\"_blank\">touted</a> by Trump are &#8220;announcements rather than realized outcomes.&#8221;</p>\n\n\n\n<p>&#8220;Foreign investment commitments do not directly enter GDP, and they often reflect projects planned years in advance,&#8221; he said, adding that some of the pledges made by foreign countries and companies “may never come to fruition.&#8221;</p>\n\n\n\n<p>We&#8217;ve already <a href=\"https://www.factcheck.org/2025/12/factchecking-trumps-economic-speech/\" rel=\"noreferrer noopener\" target=\"_blank\">written</a> that Trump&#8217;s claim that he has brought in about $18 trillion in investments to the U.S. is exaggerated, according to experts and a White House webpage.</p>\n\n\n\n<p><a href=\"https://www.fordham.edu/academics/departments/economics/faculty/giacomo-santangelo/\" rel=\"noreferrer noopener\" target=\"_blank\">Giacomo Santangelo</a>, a senior lecturer of economics at Fordham University, told us in an interview that consumption is the &#8220;largest portion&#8221; of GDP, and that people are currently taking on more debt to finance that spending. &#8220;That&#8217;s what&#8217;s driving this economy,&#8221; he said.</p>\n\n\n\n<p>Joseph Brusuelas, chief economist at RSM, <a href=\"https://perma.cc/Y3SZ-YAXA\" rel=\"noreferrer noopener\" target=\"_blank\">wrote</a> in December that the third-quarter growth was due to “[h]ousehold consumption driven by higher-income consumers and AI-related investment,” which he said “accounted for just under 70% of total growth during the [third] quarter.”</p>\n\n\n\n<p>In its <a href=\"https://web.archive.org/web/20260211111251/https://www.bea.gov/news/2026/gross-domestic-product-3rd-quarter-2025-updated-estimate-gdp-industry-and-corporate\" rel=\"noreferrer noopener\" target=\"_blank\">news release</a> about third-quarter growth in 2025, the BEA said, &#8220;The increase in real GDP in the third quarter reflected increases in consumer spending, exports, government spending, and investment.&#8221; For the second quarter, the BEA <a href=\"https://web.archive.org/web/20260205035612/https://www.bea.gov/news/2025/gross-domestic-product-2nd-quarter-2025-third-estimate-gdp-industry-corporate-profits\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> the increase &#8220;primarily reflected a decrease in imports, which are a subtraction in the calculation of GDP, and an increase in consumer spending.&#8221;</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><em>Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through <a href=\"https://giving.aws.cloud.upenn.edu/?fastStart=simpleForm&amp;program=ANS&amp;fund=602014\" rel=\"noreferrer noopener\" target=\"_blank\">our “Donate” page</a>. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, P.O. Box 58100, Philadelphia, PA 19102. </em></p>\n<p>The post <a href=\"https://www.factcheck.org/2026/02/trump-oversells-recent-u-s-economic-growth/\">Trump Oversells Recent U.S. Economic Growth</a> appeared first on <a href=\"https://www.factcheck.org\">FactCheck.org</a>.</p>",
    "url": "https://www.factcheck.org/2026/02/trump-oversells-recent-u-s-economic-growth/",
    "publication_date": "Wed, 11 Feb 2026 22:17:07 +0000",
    "date_gathered": "2026-02-24T04:09:44.214265",
    "country": "US",
    "organization": "FactCheck"
  },
  {
    "title": "WHO Didn’t Recommend Lockdowns, Contrary to Health Officials’ Suggestions",
    "content": "<img alt=\"\" class=\"attachment-medium_large size-medium_large wp-post-image\" height=\"273\" src=\"https://cdn.factcheck.org/UploadedFiles/Shutdown-720-x-307.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"640\" />\n<p>As the U.S. formally exited from the World Health Organization last month, Trump administration officials misleadingly claimed that the WHO “pushed” or “promoted” lockdowns during the COVID-19 pandemic. The group did not explicitly recommend lockdowns, although it also did not advise countries not to implement them. It said it recognized that the measures might be needed in some cases.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft\"><img alt=\"\" src=\"https://cdn.factcheck.org/UploadedFiles/SciCHECKsquare_4-161x145.png\" /></figure></div>\n\n\n<p>More than six years after the start of the COVID-19 pandemic, federal health officials are spinning the facts about the WHO as part of their justification to leave the organization. The U.S.&nbsp;<a href=\"https://www.factcheck.org/2025/01/qa-on-trumps-impending-exit-from-the-world-health-organization/\" rel=\"noreferrer noopener\" target=\"_blank\">formally exited</a>&nbsp;the WHO on Jan. 22, a year after giving notice to do so, much to the chagrin of many in public health.</p>\n\n\n\n<p>The WHO “ignored rigorous science and promoted lockdowns,” Acting Centers for Disease Control and Prevention Director Jim O’Neill&nbsp;<a href=\"https://x.com/HHS_Jim/status/2014533604010024980\" rel=\"noreferrer noopener\" target=\"_blank\">wrote</a>&nbsp;on the day of the exit in an X post that also made claims about Taiwan.</p>\n\n\n\n<p>The same day, National Institutes of Health Director Dr. Jay Bhattacharya similarly said in an&nbsp;<a href=\"https://www.youtube.com/watch?v=lnNsfrMXsEo&amp;t=1s\" rel=\"noreferrer noopener\" target=\"_blank\">interview</a>&nbsp;on Fox News that the WHO “absolutely failed during the pandemic … pushing, still to this day … lockdown policies that plagued Americans for years.”</p>\n\n\n\n<p>Those comments led to contentious exchanges with WHO officials who have taken issue with the statements.</p>\n\n\n\n<p>“All untrue,”&nbsp;<a href=\"https://x.com/mvankerkhove\" rel=\"noreferrer noopener\" target=\"_blank\">Maria Van Kerkhove</a>, an infectious disease epidemiologist and the WHO’s technical lead for COVID-19, responded to O’Neill in a Jan. 24&nbsp;<a href=\"https://x.com/mvankerkhove/status/2015061936820322354\" rel=\"noreferrer noopener\" target=\"_blank\">post</a>, adding, “we don&#8217;t ignore science and WHO never recommended lockdowns.”</p>\n\n\n\n<p>The WHO also pushed back in a Jan. 24&nbsp;<a href=\"https://www.who.int/news/item/24-01-2026-who-statement-on-notification-of-withdrawal-of-the-united-states\" rel=\"noreferrer noopener\" target=\"_blank\">statement</a>, writing, “WHO recommended the use of masks, vaccines and physical distancing, but at no stage recommended mask mandates, vaccine mandates or lockdowns. We supported sovereign governments to make decisions they believed were in the best interests of their people, but the decisions were theirs.”</p>\n\n\n\n<p>The dispute recalls a similar situation in October 2020 when President Donald Trump, then in his first term, incorrectly said that the WHO had “just admitted” that he was “right” about lockdowns. Trump had criticized lockdowns, saying they were “worse than the problem itself.&#8221; Trump was in office at the height of the pandemic when COVID-19 restrictions in the U.S. were the most stringent.</p>\n\n\n\n<p>As we wrote&nbsp;<a href=\"https://www.factcheck.org/2020/10/trump-distorts-whos-lockdown-comments/\" rel=\"noreferrer noopener\" target=\"_blank\">then</a>, the WHO’s position on lockdowns had always been more nuanced &#8212; the group neither recommended the measures nor advised against them, saying it recognized that lockdowns can harm society but are sometimes necessary.</p>\n\n\n\n<p>The organization did at times praise China’s aggressive response, and supported countries in their decisions, which could be interpreted as an implicit endorsement of the measures. But it’s an oversimplification to say that the WHO “pushed” or “promoted” lockdowns. We did not find evidence that the WHO explicitly recommended them, consistent with the organization’s statements.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-full\"><img alt=\"\" class=\"wp-image-280183\" height=\"267\" src=\"https://cdn.factcheck.org/UploadedFiles/Shutdown-400-x-267.png\" width=\"400\" /><figcaption class=\"wp-element-caption\">A candy store in downtown Patchogue, New York, that was an early casualty of the coronavirus pandemic. Photo by Steve Pfost/Newsday via Getty Images.</figcaption></figure></div>\n\n\n<p>We reached out to the NIH to ask about Bhattacharya’s comments and to the CDC to ask about O’Neill’s, but did not receive a reply. The WHO pointed us to a Q&amp;A&nbsp;<a href=\"https://www.who.int/news-room/questions-and-answers/item/herd-immunity-lockdowns-and-covid-19\" rel=\"noreferrer noopener\" target=\"_blank\">post</a>&nbsp;&#8212; last updated Dec. 31, 2020 &#8212; that we also previously referenced, which notes that so-called “lockdown” measures can work to slow viral transmission but can have “a profound negative impact,” especially for disadvantaged groups.</p>\n\n\n\n<p>“WHO recognizes that at certain points, some countries have had no choice but to issue stay-at-home orders and other measures, to buy time,” the post continues, adding that “WHO is hopeful that countries will use targeted interventions where and when needed, based on the local situation.”</p>\n\n\n\n<p>Similar language also appears in an April 2020 WHO <a href=\"https://www.who.int/docs/default-source/coronaviruse/covid-strategy-update-14april2020.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">document</a>, which states there is an &#8220;urgent need&#8221; to transition away from lockdown measures, but also cautions that premature lifting of restrictions without careful planning is likely to lead to an uncontrolled surge in COVID-19 cases.</p>\n\n\n\n<p>It’s worth noting that there is&nbsp;<a href=\"https://www.factcheck.org/2022/03/scicheck-what-weve-learned-about-so-called-lockdowns-and-the-covid-19-pandemic/\" rel=\"noreferrer noopener\" target=\"_blank\">no unified definition</a>&nbsp;of what “lockdowns” are. While they generally refer to what the WHO&nbsp;<a href=\"https://www.who.int/news-room/questions-and-answers/item/herd-immunity-lockdowns-and-covid-19\" rel=\"noreferrer noopener\" target=\"_blank\">terms</a>&nbsp;“large scale physical distancing measures and movement restrictions,” they varied greatly in scope and severity in different countries during the COVID-19 pandemic. The U.S. version &#8212; which at its most restrictive involved stay-at-home orders and school and business closures, implemented by states and local governments &#8212; was far lighter than measures imposed in China, for example. </p>\n\n\n\n<p>In some parts of China, residents at times could not leave their cities, were <a href=\"https://www.npr.org/sections/goatsandsoda/2020/02/21/806958341/restrictions-and-rewards-how-china-is-locking-down-half-a-billion-citizens\" rel=\"noreferrer noopener\" target=\"_blank\">not allowed</a> to use their own cars and needed permission to leave their apartments. In the U.S., there was never a federal lockdown, although the Trump administration <a href=\"https://trumpwhitehouse.archives.gov/articles/15-days-slow-spread/\" rel=\"noreferrer noopener\" target=\"_blank\">issued</a> <a href=\"https://trumpwhitehouse.archives.gov/wp-content/uploads/2020/03/03.16.20_coronavirus-guidance_8.5x11_315PM.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">guidelines</a> <a href=\"https://www.nytimes.com/2020/03/29/us/politics/trump-coronavirus-guidelines.html\" rel=\"noreferrer noopener\" target=\"_blank\">that</a> told people to avoid large gatherings and encouraged school and nonessential business closures early in the pandemic. </p>\n\n\n\n<p>&#8220;My administration is recommending that all Americans, including the young and healthy, work to engage in schooling from home when possible. Avoid gathering in groups of more than 10 people. Avoid discretionary travel. And avoid eating and drinking at bars, restaurants, and public food courts,&#8221; Trump <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-press-conference-coronavirus-briefing-march-16-2020/#76\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> on March 16, 2020, when announcing the government&#8217;s &#8220;15 Days to Slow the Spread,&#8221; which was later extended. On March 23, 2020, Trump <a href=\"https://trumpwhitehouse.archives.gov/briefings-statements/remarks-president-trump-vice-president-pence-members-coronavirus-task-force-press-briefing-9/\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> that &#8220;America will again, and soon, be open for business — very soon.&#8221;</p>\n\n\n\n<p>The word &#8220;lockdown&#8221; has sometimes <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC10110335/\" rel=\"noreferrer noopener\" target=\"_blank\">erroneously been applied</a> to any public health measure, even those that don’t limit social interactions.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\"><strong>Contentious Exchanges</strong></h2>\n\n\n\n<p>In response to Van Kerkhove’s post about O’Neill, Bhattacharya pointed to some text of the WHO-China Joint Mission&nbsp;<a href=\"https://www.who.int/docs/default-source/coronaviruse/who-china-joint-mission-on-covid-19---final-report-1100hr-28feb2020-11mar-update.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">report</a>&nbsp;in February 2020, and&nbsp;<a href=\"https://x.com/DrJBhattacharya/status/2015071416966631650\" rel=\"noreferrer noopener\" target=\"_blank\">wrote</a>, “That is just plain false. The WHO mission to China in 2020 lauded the Chinese lockdown as a success, in effect endorsing the model for the rest of the world.”</p>\n\n\n\n<p>The text he cited stated that the measures employed in China &#8212; at their core, proactive surveillance, rapid diagnosis and case isolation and tracking and quarantine of close contacts &#8212; “are the only measures that are currently proven to interrupt or minimize transmission” of the coronavirus. “Given the damage that can be caused by uncontrolled, community-level transmission of this virus, such an approach is warranted to save lives and to gain the weeks and months needed for the testing of therapeutics and vaccine development,” the report added.</p>\n\n\n\n<p>Van Kerkhove, however,&nbsp;<a href=\"https://x.com/mvankerkhove/status/2015076737999077657\" rel=\"noreferrer noopener\" target=\"_blank\">replied</a>: “What you’re reading here is that we acknowledged that governments had to take tough decisions to protect their populations, but lockdowns were never recommended, nor were they a policy recommendation by @WHO.”&nbsp;</p>\n\n\n\n<p>Finishing the exchange, Bhattacharya&nbsp;<a href=\"https://x.com/DrJBhattacharya/status/2015080861050257443\" rel=\"noreferrer noopener\" target=\"_blank\">wrote</a>: “What I&#8217;m not reading here is a condemnation of lockdowns at a time where governments worldwide were seriously considering them. If you want the world to trust the WHO, take honest ownership of this failure.”</p>\n\n\n\n<p>Bhattacharya has also objected to statements from the WHO’s leader, Director-General Dr.&nbsp;<a href=\"https://www.who.int/director-general/tedros-adhanom-ghebreyesus\" rel=\"noreferrer noopener\" target=\"_blank\">Tedros Adhanom Ghebreyesus</a>, who had responded to an X post from Health and Human Services Secretary Robert F. Kennedy Jr.,&nbsp;<a href=\"https://x.com/DrTedros/status/2015065682266800417\" rel=\"noreferrer noopener\" target=\"_blank\">saying</a>&nbsp;that the HHS statement “contains inaccurate information” and that the WHO “never recommended lockdowns.”</p>\n\n\n\n<p>“That is just deeply dishonest,” Bhattacharya&nbsp;<a href=\"https://x.com/DrJBhattacharya/status/2015078563918000598\" rel=\"noreferrer noopener\" target=\"_blank\">wrote</a>&nbsp;in a Jan. 24 X post. “If the WHO opposed lockdowns, where was the WHO condemnation of them in 2020 or 2021? Or of China&#8217;s lockdowns in 2022?”</p>\n\n\n\n<p>A day later, Bhattacharya posted a&nbsp;<a href=\"https://x.com/DrJBhattacharya/status/2015461278563598359\" rel=\"noreferrer noopener\" target=\"_blank\">thread</a>&nbsp;with what he called “receipts” of evidence that the WHO is wrong, which included statements from the WHO about what countries should ideally do before lifting lockdown measures.</p>\n\n\n\n<p>The disagreement between U.S. and WHO officials partly comes down to semantics.&nbsp;Bhattacharya is correct that the WHO mission praised China&#8217;s response &#8212; and that the group did not come out against lockdowns. But Van Kerkhove and the WHO have not claimed to have done so. Moreover, not opposing lockdowns is different from recommending them.</p>\n\n\n\n<p>“WHO neither recommended nor categorically opposed lockdowns,” Van Kerkhove told us in an email responding to questions about the claims. “We recommended a comprehensive risk-based approach including surveillance, contact tracing, testing, quarantine (for those infected), isolation (for contacts), physical distancing, the use of masks/respirators, personal protective equipment for health workers, improved ventilation, vaccines, therapeutics and more. At the same time, we acknowledged that in some circumstances, countries felt they had no choice but to introduce lockdowns to prevent their health systems being overwhelmed resulting in more lives lost. We respected that choice, as it was their sovereign right, but we said that lockdowns should not be used as the primary or default strategy for controlling COVID-19, and highlighted their serious social and economic consequences.”</p>\n\n\n\n<p>“We did say, repeatedly and clearly, that lockdowns came with risks and potential harms, and that they were not a sustainable solution,” she added.</p>\n\n\n\n<p>She <a href=\"https://www.who.int/news-room/speeches/item/who-director-general-s-opening-remarks-at-the-media-briefing-on-covid-19---17-july-2020\" rel=\"noreferrer noopener\" target=\"_blank\">pointed</a> <a href=\"https://www.who.int/news-room/speeches/item/who-director-general-s-opening-remarks-at-the-media-briefing-on-covid-19---21-august-2020\" rel=\"noreferrer noopener\" target=\"_blank\">to</a> <a href=\"https://www.who.int/docs/default-source/coronaviruse/transcripts/covid-19-virtual-press-conference---21-august.pdf?sfvrsn=ada7ae85_0\" rel=\"noreferrer noopener\" target=\"_blank\">multiple</a> <a href=\"https://reliefweb.int/report/world/who-director-generals-opening-remarks-member-states-briefing-covid-19-25-february-2021\" rel=\"noreferrer noopener\" target=\"_blank\">examples</a> <a href=\"https://www.who.int/news-room/speeches/item/who-director-general-s-opening-remarks-at-the-media-briefing-on-covid-19---1-february-2022\" rel=\"noreferrer noopener\" target=\"_blank\">of</a> <a href=\"https://pmnch.who.int/docs/librariesprovider9/meeting-reports/lives-in-the-balance-1-tedros-speech.pdf?sfvrsn=9dadbbc0_5\" rel=\"noreferrer noopener\" target=\"_blank\">the</a> WHO expressing this view or warning about the harms or potential harms of lockdown measures, including a&nbsp;<a href=\"https://www.who.int/news-room/speeches/item/russian-federation-s-international-legal-forum-the-rule-of-corona\" rel=\"noreferrer noopener\" target=\"_blank\">speech</a>&nbsp;the director-general gave in April 2020 that reminded nations that “there is a need to respect human rights and dignity” and that the &#8220;restrictive measures governments are implementing are already having a massive impact on livelihoods.&#8221;</p>\n\n\n\n<p>&#8220;Lockdowns are a blunt instrument that have taken a heavy toll in many countries,&#8221; the WHO director-general similarly <a href=\"https://www.who.int/news-room/speeches/item/who-director-general-s-opening-remarks-at-the-media-briefing-on-covid-19---4-september-2020\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> in September 2020. &#8220;With the right mix of targeted and tailored measures, further national lockdowns can be avoided.&#8221;</p>\n\n\n\n<p>Van Kerkhove also cited a&nbsp;<a href=\"https://x.com/WHO/status/1317156172353441793\" rel=\"noreferrer noopener\" target=\"_blank\">Q&amp;A video</a>&nbsp;from the WHO that Van Kerkhove appeared in and was shared on social media in October 2020.</p>\n\n\n\n<p>Bhattacharya&nbsp;<a href=\"https://x.com/DrJBhattacharya/status/2015461295244382356\" rel=\"noreferrer noopener\" target=\"_blank\">cited</a>&nbsp;the same video in his X thread, saying, “A WHO epidemiologist lauds lockdowns as a way to ‘stop’ covid outbreaks.”</p>\n\n\n\n<p>Van Kerkhove said that was a “deliberate misinterpretation of what was said.” In the clip, speaking for the WHO, she said, &#8220;we haven&#8217;t recommended” lockdowns, adding that “we do recognize that some countries and some areas have had to use what is called so-called lockdown measures because they needed to buy themselves some time.”&nbsp;</p>\n\n\n\n<p>“This clip cannot be interpreted as me ‘lauding’ lockdowns,” she said.</p>\n\n\n\n<p>Other individuals on social media have&nbsp;<a href=\"https://x.com/aya_velazquez/status/2015354631887466940\" rel=\"noreferrer noopener\" target=\"_blank\">highlighted</a>&nbsp;statements from February 2020 by Dr.&nbsp;<a href=\"https://www.worldhealthsummit.org/speaker/edb71f9f-7037-4f6d-9159-9994b01c8f30\" rel=\"noreferrer noopener\" target=\"_blank\">Bruce Aylward</a>, a Canadian physician and epidemiologist who was&nbsp;<a href=\"https://healthpolicy-watch.news/two-who-officials-dropped-in-may-from-senior-leadership-team-move-into-other-roles/\" rel=\"noreferrer noopener\" target=\"_blank\">then</a>&nbsp;a senior adviser to the WHO director-general, that Bhattacharya&nbsp;<a href=\"https://perma.cc/BF4M-3UZ7\" rel=\"noreferrer noopener\" target=\"_blank\">reshared</a>&nbsp;on X.</p>\n\n\n\n<p>During the press conference for the WHO-China joint mission, Aylward emphasized that what China had done did appear to be working. “What China has demonstrated is, you have to do this,” he said at one point. “If you do it, you can save lives and prevent thousands of cases of what is a very difficult disease.”&nbsp;</p>\n\n\n\n<p>Van Kerkhove said this was also a case of misinterpretation. “Dr Aylward spoke positively about China’s overall response to COVID-19, and recognized that other countries including Italy were now taking ‘extremely aggressive actions,’” she told us in an email. “Dr Aylward’s comment that ‘you have to do this’ was a reference to the overall ‘aggressive’ or ‘rigorous’ approach that was needed to stop transmission and save lives, not specifically to the role of lockdowns.”</p>\n\n\n\n<p>Aylward “did not recommend that countries impose lockdowns,” she added, pointing to earlier comments of his that day, in which he said “it’s important that other countries think about” applying “not necessarily the full lockdowns … but that same rigorous approach.”</p>\n\n\n\n<p><a href=\"https://www.law.georgetown.edu/faculty/lawrence-o-gostin/\" rel=\"noreferrer noopener\" target=\"_blank\">Lawrence Gostin</a>, a global health law professor at Georgetown University, told us that it is “certainly true that WHO officials praised China&#8217;s COVID-19 [response], and that was irresponsible.”</p>\n\n\n\n<p>But, he added, “we forget how frightening the early days of the COVID-19 pandemic were. We had no vaccines or treatments and the virus was spreading exponentially. In that context, a temporary lockdown was clearly justified to buy time for the development and deployment of vaccines. Lockdowns were also intended to protect overwhelmed hospitals and health workers. It is easy to blame WHO for its proactive response in the midst of a global crisis. But it&#8217;s wrong.”</p>\n\n\n\n<p>He said Bhattacharya&#8217;s posts “lack any subtlety or context” and emphasized that the WHO “has no power to order lockdowns &amp; it never did.”</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><em>Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through <a href=\"https://giving.aws.cloud.upenn.edu/?fastStart=simpleForm&amp;program=ANS&amp;fund=602014\" rel=\"noreferrer noopener\" target=\"_blank\">our “Donate” page</a>. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, P.O. Box 58100, Philadelphia, PA 19102. </em></p>\n<p>The post <a href=\"https://www.factcheck.org/2026/02/who-didnt-recommend-lockdowns-contrary-to-health-officials-suggestions/\">WHO Didn’t Recommend Lockdowns, Contrary to Health Officials&#8217; Suggestions</a> appeared first on <a href=\"https://www.factcheck.org\">FactCheck.org</a>.</p>",
    "url": "https://www.factcheck.org/2026/02/who-didnt-recommend-lockdowns-contrary-to-health-officials-suggestions/",
    "publication_date": "Mon, 09 Feb 2026 20:49:44 +0000",
    "date_gathered": "2026-02-24T04:09:44.214269",
    "country": "US",
    "organization": "FactCheck"
  },
  {
    "title": "Manufacturing Construction Spending Declines Under Trump",
    "content": "<img alt=\"\" class=\"attachment-medium_large size-medium_large wp-post-image\" height=\"273\" src=\"https://cdn.factcheck.org/UploadedFiles/Samsung-720-x-307.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"640\" />\n<p>Spending to build, expand and rehabilitate manufacturing sites in the U.S. has declined since President Donald Trump took office, according to U.S. Census Bureau data. Yet, Trump has repeatedly boasted that “factory construction” is up 41%.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full\"><img alt=\"\" class=\"wp-image-280141\" height=\"267\" src=\"https://cdn.factcheck.org/UploadedFiles/Samsung-400-x-267.png\" width=\"400\" /><figcaption class=\"wp-element-caption\">A general view of the Samsung Austin Semiconductor plant on April 16, 2024, in Taylor, Texas, which received CHIPS Act funds. Photo by Brandon Bell/Getty Images.</figcaption></figure></div>\n\n\n<p>Trump <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-press-conference-briefing-room-january-20-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">cited the 41% statistic</a> in a White House press conference on Jan. 20 – calling it a “record” increase and suggesting that other presidents cannot compare to this “record.”&nbsp;</p>\n\n\n\n<p>“Investment in American factories is up 41%. That&#8217;s a record. Nobody goes 41% up. You go 2% up, 1% up. You go down by 3%. If Kamala [Harris] got elected, the 41% up would be 41% down,” Trump said at the press conference, referring to the former vice president and Democratic presidential nominee who lost to Trump in the 2024 election.</p>\n\n\n\n<p>A day later, in a <a href=\"https://www.weforum.org/stories/2026/01/davos-2026-special-address-donald-trump-president-united-states-america/\" rel=\"noreferrer noopener\" target=\"_blank\">Jan. 21 speech</a> at the World Economic Forum Annual Meeting in Davos, Switzerland, Trump repeated the 41% figure.&nbsp;</p>\n\n\n\n<p>“Factory construction is up by 41%, and that number is really going to skyrocket right now, because that&#8217;s during a process that they&#8217;re putting in to get their approvals and we&#8217;ve given very, very quick, fast approvals,” Trump said.&nbsp;</p>\n\n\n\n<p>This claim is part of a theme the president <a href=\"https://www.whitehouse.gov/articles/2025/10/president-trump-continues-to-drive-an-american-manufacturing-boom/\" rel=\"noreferrer noopener\" target=\"_blank\">has emphasized</a> of a &#8220;manufacturing boom&#8221; or &#8220;<a href=\"https://www.weforum.org/stories/2026/01/davos-2026-special-address-donald-trump-president-united-states-america/\" rel=\"noreferrer noopener\" target=\"_blank\">booming</a>&#8221; economy due to his trade policies.</p>\n\n\n\n<p>At our request, the White House sent us a link to the Census Bureau&#8217;s <a href=\"https://fred.stlouisfed.org/series/TLMFGCONS\" rel=\"noreferrer noopener\" target=\"_blank\">manufacturing construction spending data</a> via the Federal Reserve Bank of St. Louis&#8217; online database <a href=\"https://fredhelp.stlouisfed.org/fred/about/about-fred/what-is-fred/\" rel=\"noreferrer noopener\" target=\"_blank\">known as FRED</a>. We provide more about the White House response later, but let&#8217;s focus first on what the data show.</p>\n\n\n\n<p>Under President Joe Biden &#8212; who served from Jan. 20, 2021, to Jan. 20, 2025 &#8212; there was a significant increase in manufacturing construction spending in all four years, <a href=\"https://fred.stlouisfed.org/graph/?g=1Rb7p\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a> the Census Bureau’s annual average estimates. After declining 6.9% in 2020 – the last year of Trump’s first term – manufacturing construction spending started to rise in 2021, the data show.&nbsp;</p>\n\n\n\n<p>(Technical note: The Census Bureau provides average <a href=\"https://fred.stlouisfed.org/graph/?g=1RgEY\" rel=\"noreferrer noopener\" target=\"_blank\">quarterly</a> and <a href=\"https://fred.stlouisfed.org/graph/?g=1Rb7p\" rel=\"noreferrer noopener\" target=\"_blank\">annual</a> estimates and <a href=\"https://fred.stlouisfed.org/graph/?g=1RhZw\" rel=\"noreferrer noopener\" target=\"_blank\">monthly</a> reports for construction spending, including manufacturing construction spending, based on its monthly <a href=\"https://www.census.gov/construction/c30/about_the_survey.html\" rel=\"noreferrer noopener\" target=\"_blank\">Value of Construction Put in Place</a> survey. We use all three in this story.)&nbsp;</p>\n\n\n\n<p>Initially, the increases during the Biden years were in response to the COVID-19 pandemic, <a href=\"https://webinars.constructionexec.com/speaker/anirban-basu/\" rel=\"noreferrer noopener\" target=\"_blank\">Anirban Basu</a>, chief economist for the Associated Builders and Contractors, an industry trade association, told us in an email.&nbsp;</p>\n\n\n\n<p>“Supply chain disruptions at the start of the COVID-19 pandemic convinced many producers to reshore capacity, while a sudden and sharp increase in construction materials prices—which rose more than 40% during the early years of the pandemic—also boosted nominal construction spending,” Basu said.&nbsp;</p>\n\n\n\n<p>Manufacturing construction spending <a href=\"https://www.atlanticcouncil.org/blogs/econographics/the-ira-and-chips-act-are-supercharging-us-manufacturing-construction/\" rel=\"noreferrer noopener\" target=\"_blank\">accelerated</a> after Biden signed legislation in August 2022 designed to encourage private investment in U.S. manufacturing for <a href=\"https://www.congress.gov/bill/117th-congress/house-bill/4346\" rel=\"noreferrer noopener\" target=\"_blank\">semiconductors</a> and <a href=\"https://seia.org/news/president-bidens-signature-historic-inflation-reduction-act-secures-americas-position-global/\" rel=\"noreferrer noopener\" target=\"_blank\">clean energy</a>. The bipartisan <a href=\"https://www.congress.gov/bill/117th-congress/house-bill/4346\" rel=\"noreferrer noopener\" target=\"_blank\">CHIPS Act</a>, for example, included $39 billion to help fund semiconductor manufacturing facilities in the U.S., as explained in an <a href=\"https://crsreports.congress.gov/product/pdf/R/R47523\" rel=\"noreferrer noopener\" target=\"_blank\">April 2023 report</a> by the Congressional Research Service.</p>\n\n\n\n<p>During Biden’s four years, the <a href=\"https://fred.stlouisfed.org/graph/?g=1Rb7p\">annual average rate</a> of manufacturing construction spending jumped more than 200%, from $75.5 billion to $235.6 billion, <a href=\"https://fred.stlouisfed.org/graph/?g=1Rb7p\" rel=\"noreferrer noopener\" target=\"_blank\">according to</a> Census Bureau estimates. Spending surged 62% in a single year – 2023, a year after Biden signed the CHIPS Act.&nbsp;</p>\n\n\n\n<div class=\"embed-container\"></div>\n\n\n\n<p>But manufacturing construction spending peaked in the third quarter of 2024 and has been trending down slightly ever since. Census Bureau <a href=\"https://fred.stlouisfed.org/graph/?g=1R8lH\" rel=\"noreferrer noopener\" target=\"_blank\">quarterly data</a> show that under Trump, measuring from the last quarter in 2024 through the third quarter in 2025, spending declined 6.7%.&nbsp;</p>\n\n\n\n<p>That decline is expected to continue in 2026 and 2027, according to the <a href=\"https://www.aia.org/resource-center/consensus-construction-forecast/january-2026\" rel=\"noreferrer noopener\" target=\"_blank\">most recent survey</a> of construction economists that is conducted twice a year by the American Institute of Architects.</p>\n\n\n\n<p>“Manufacturing construction spending has seen phenomenal growth in recent years, increasing by over 50% in 2022, another 62% in 2023, and then another 16% in 2024,” the AIA consensus construction forecast published Jan. 15 said. “However, growth paused last year as spending in this category fell about 5% and is projected to decline another 4% this year and 1% in 2027.”</p>\n\n\n\n<p>Despite the slight declines, the AIA construction forecast noted that the semiconductor fabrication plants continue to fuel manufacturing construction spending and will do so in the long term. </p>\n\n\n\n<p>&#8220;The longer-term prospects look much more promising, as construction starts for manufacturing projects have shot up again,&#8221; the AIA forecast said. &#8220;Since many of these starts are for megaprojects, such as large semiconductor fabrication plants that entail a complex construction process, it may take a while before the activity shows up in the construction spending data.&#8221;</p>\n\n\n\n<p>In January, Basu analyzed the Census Bureau’s <a href=\"https://www.census.gov/construction/c30/pdf/release.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">most recent monthly report</a> for nonresidential construction spending, which showed manufacturing construction spending as of October had <a href=\"https://fred.stlouisfed.org/graph/?g=1RhZw\" rel=\"noreferrer noopener\" target=\"_blank\">declined for nine straight months</a>.&nbsp;</p>\n\n\n\n<p>“With CHIPS Act-enabled megaprojects winding down and the stiff headwind of trade policy, manufacturing construction spending has fallen by nearly 10% over the past 12 months, accounting for more than the entire decline in private nonresidential spending,” Basu said in<a href=\"https://www.abc.org/News-Media/News-Releases/abc-nonresidential-construction-spending-remains-stagnant-in-october\" rel=\"noreferrer noopener\" target=\"_blank\"> an ABC press release</a> issued Jan. 21. (By “trade policy,” Basu is referring to the <a href=\"https://www.abc.org/News-Media/News-Releases/abc-tariffs-push-construction-materials-prices-higher-in-november\" rel=\"noreferrer noopener\" target=\"_blank\">economic impact of Trump’s tariffs</a> on construction materials.)</p>\n\n\n\n<p>On a <a href=\"https://fred.stlouisfed.org/graph/?g=1RhZw\" rel=\"noreferrer noopener\" target=\"_blank\">monthly basis</a>, the Census Bureau shows a 7.3% decline in manufacturing construction spending last year under Trump from January through October, the most recent data available. </p>\n\n\n\n<div class=\"embed-container\"></div>\n\n\n\n<p>Beginning on Jan. 23, we asked the White House on multiple occasions to provide support for the 41% figure used in Trump&#8217;s Jan. 20 and 21 remarks. After not receiving a response, we sent another email on Feb. 2 after the president wrote an <a href=\"https://www.wsj.com/opinion/donald-j-trump-my-tariffs-have-brought-america-back-2248391b\" rel=\"noreferrer noopener\" target=\"_blank\">opinion piece</a> for the Wall Street Journal on Jan. 30 that said, &#8220;Factory construction is up by 42% since 2022.&#8221; We asked how it arrived at a 42% increase “since 2022.” That evening, the White House sent us a link to the Census Bureau&#8217;s <a href=\"https://fred.stlouisfed.org/series/TLMFGCONS\">manufacturing construction spending data</a>, saying it compared &#8220;averages of Jan – August 2025 vs 2021-2024 average.&#8221;</p>\n\n\n\n<p>That&#8217;s true &#8212; as far as it goes. On an annualized basis, monthly manufacturing construction spending averaged $226.1 billion for January through August &#8212; which is 40% higher than the annual average of $161.1 billion in Biden&#8217;s four years. But Trump wrote that the 42% increase was “since 2022,” not 2021. (We’ve asked the White House for a clarification.)</p>\n\n\n\n<p>More importantly, the White House methodology fails to take into account the <a href=\"https://fred.stlouisfed.org/graph/?g=1Rb7p\">212% increase</a> in factory construction spending over Biden&#8217;s four years, which peaked in 2024 at an annual average of $235.6 billion, and how the Biden-era CHIPS Act continues to fuel manufacturing construction spending.</p>\n\n\n\n<p>As we noted earlier, Basu attributed the recent decline to Trump&#8217;s tariffs and the slowing &#8212; not the halting &#8212; of construction projects spurred by the CHIPS Act. Asked to elaborate on his analysis, Basu told us that the manufacturing construction spending in 2025 is &#8220;largely due&#8221; to the CHIPS Act.</p>\n\n\n\n<p>&#8220;While spending in the segment remains elevated from 2022 levels, that&#8217;s partially due to a precipitous increase in materials prices that occurred in 2022 and 2023 &#8212; these data are in nominal terms &#8212; and largely due to the surge in megaproject activity induced by the CHIPS Act,&#8221; Basu said.</p>\n\n\n\n<p>He added that Trump&#8217;s tariffs have helped drive up the costs of fabricated metal &#8212; which has increased manufacturing construction costs. </p>\n\n\n\n<p>&#8220;[I]t should be noted&nbsp;that spending in the fabricated metal manufacturing subsegment is up 19% over the past year,&#8221; Basu said. &#8220;Some of the increase can be contributed to tariffs and the resulting increase in demand for domestic production.&#8221; </p>\n\n\n\n<p>We should note that even with the recent surge in manufacturing construction spending, there has been a decline in the number of manufacturing jobs. As we <a href=\"https://www.factcheck.org/2026/01/trumps-numbers-second-term/\" rel=\"noreferrer noopener\" target=\"_blank\">reported last month</a>, the economy lost 63,000 <a href=\"https://data.bls.gov/timeseries/CES3000000001\" rel=\"noreferrer noopener\" target=\"_blank\">manufacturing jobs</a> in Trump’s first 11 months. That followed a loss of 98,000 in the preceding 11 months, according to the Bureau of Labor Statistics.</p>\n\n\n\n<p>Shortly before Biden left office, Manufacturing Today, a trade magazine, <a href=\"https://manufacturing-today.com/news/us-factory-construction-boom-struggles-to-deliver-immediate-jobs/\" rel=\"noreferrer noopener\" target=\"_blank\">wrote</a> in <a href=\"https://manufacturing-today.com/news/us-factory-construction-boom-struggles-to-deliver-immediate-jobs/\" rel=\"noreferrer noopener\" target=\"_blank\">December 2024</a> that manufacturing jobs were slow to materialize despite Biden’s incentives to spur manufacturing construction. But the magazine predicted the jobs “will materialize in the future.”</p>\n\n\n\n<p>“Unlike traditional industrial projects, today’s semiconductor and clean energy facilities require longer timelines,” the article said. “Factories of this scale can take two to three years to complete, with even longer delays for more complex facilities, such as semiconductor plants. This extended timeline means the full benefits will not be realized for several more years.”</p>\n\n\n\n<p>Basu agreed that CHIPS-related spending will result in an overall increase in U.S. manufacturing jobs – but cautioned that the impact of Trump’s tariffs could offset those gains.&nbsp;</p>\n\n\n\n<p>“The massive facilities incentivized by the CHIPS Act will employ thousands of people,” Basu told us. “That said, all else is not equal, and recent trade policy and the effects on manufacturing input prices have put downward pressure on the industry’s employment.” (<a href=\"https://www.bls.gov/k12/productivity-101/content/what-is-productivity/what-are-inputs.htm\">Input prices</a> are costs of materials and other resources manufacturers need to produce goods, with some of those materials being imported.)</p>\n\n\n\n<p>Others are bullish that Trump’s trade policies will encourage more manufacturers to expand in the U.S.&nbsp;</p>\n\n\n\n<p>In April, when Trump <a href=\"https://perma.cc/GL6U-5QY3\" rel=\"noreferrer noopener\" target=\"_blank\">announced</a> higher tariffs on nearly all foreign imports, Morgan Stanley analyst Chris Snyder <a href=\"https://www.cnbc.com/2025/04/05/trump-says-tariffs-will-accelerate-reshoring-but-experts-say-its-not-that-easy.html\" rel=\"noreferrer noopener\" target=\"_blank\">called</a> tariffs “a positive catalyst&#8221; for relocating manufacturing to the U.S. More recently, Snyder <a href=\"https://www.morganstanley.com/insights/podcasts/thoughts-on-the-market/us-manufacturing-transformation-2026\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> in a podcast last month that the tariffs have changed the &#8220;supply chain cost calculation&#8221; and will result in new U.S. factories.&nbsp;</p>\n\n\n\n<p>&#8220;What we&#8217;re seeing is the cost of imports have gone higher with tariffs, and now it&#8217;s more economically advisable for these companies to make the product in the United States,&#8221; Snyder said. &#8220;And if that&#8217;s the case, that means that when they need a new factory, it&#8217;s going to come to the United States. They might not need a factory now, but when they do, the U.S. is at least incrementally better positioned to get that factory.&#8221;</p>\n\n\n\n<p>In a January news article, the Wall Street Journal <a href=\"https://www.wsj.com/economy/u-s-manufacturing-is-in-retreat-and-trumps-tariffs-arent-helping-d2af4316?st=5tdeYf&amp;reflink=article_copyURL_share\" rel=\"noreferrer noopener\" target=\"_blank\">wrote</a> that Trump&#8217;s tariffs &#8220;haven&#8217;t worked, so far.&#8221; The article said tariffs have increased manufacturers&#8217; costs for foreign parts, adding that the &#8220;White House’s stop-and-start&#8221; tariff policy announcements have &#8220;also led to what many executives view as a lost year for investment.&#8221;</p>\n\n\n\n<p>In a <a href=\"https://www.wsj.com/politics/elections/trump-isnt-certain-his-economic-policies-will-translate-to-midterm-wins-455e0d46?st=68swNa&amp;reflink=article_copyURL_share\" rel=\"noreferrer noopener\" target=\"_blank\">December interview</a> with the Wall Street Journal, Trump cited &#8212; <a href=\"https://www.factcheck.org/2025/05/trumps-growing-exaggeration-of-u-s-investments/\" rel=\"noreferrer noopener\" target=\"_blank\">as he often does</a> &#8212; the value of investments that he says his administration has secured to date. (As <a href=\"https://www.factcheck.org/2025/12/factchecking-trumps-economic-speech/\" rel=\"noreferrer noopener\" target=\"_blank\">we&#8217;ve written</a>, he has exaggerated pledges to invest made by various companies and countries that may or may not materialize, experts say.) But he couldn&#8217;t say if the investments would show results in time for the midterm elections, when the Republican Party is in <a href=\"https://apnews.com/article/house-control-congress-trump-2026-elections-434e7e16a5d70ce44a3f26e316bf251e\" rel=\"noreferrer noopener\" target=\"_blank\">jeopardy</a> of losing its slim majority in the House. “I can’t tell you. I don’t know when all of this money is going to kick in,” the president told the Journal, adding that it may happen in the second quarter of this year.</p>\n\n\n\n<p>What will happen in the coming months and years remains to be seen. But what we can say is that factory construction so far has declined under Trump and his claim that it has increased 41% depends on a spending surge that occurred under Biden.&nbsp;</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><em>Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through <a href=\"https://giving.aws.cloud.upenn.edu/?fastStart=simpleForm&amp;program=ANS&amp;fund=602014\" rel=\"noreferrer noopener\" target=\"_blank\">our “Donate” page</a>. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, P.O. Box 58100, Philadelphia, PA 19102. </em></p>\n<p>The post <a href=\"https://www.factcheck.org/2026/02/manufacturing-construction-spending-declines-under-trump/\">Manufacturing Construction Spending Declines Under Trump</a> appeared first on <a href=\"https://www.factcheck.org\">FactCheck.org</a>.</p>",
    "url": "https://www.factcheck.org/2026/02/manufacturing-construction-spending-declines-under-trump/",
    "publication_date": "Fri, 06 Feb 2026 22:10:00 +0000",
    "date_gathered": "2026-02-24T04:09:44.214273",
    "country": "US",
    "organization": "FactCheck"
  },
  {
    "title": "ICE Officers and Bonuses",
    "content": "<img alt=\"\" class=\"attachment-medium_large size-medium_large wp-post-image\" height=\"273\" src=\"https://cdn.factcheck.org/UploadedFiles/ICE-Arrest-720-x-307.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"640\" />\n<p><strong>Q:&nbsp;Is it true that ICE agents are financially rewarded for the number of people taken into custody?</strong></p>\n\n\n\n<p><strong>A:</strong> <strong>The Department of Homeland Security has said there is no such policy, and an immigration think tank told us it is unaware of any payments per arrest. The Wall Street Journal reported that agents &#8220;are rewarded for making arrests&#8221; but didn&#8217;t say how they are rewarded. Immigration and Customs Enforcement quickly scrapped a proposed program to pay bonuses to speed up deportations. </strong></p>\n\n\n\n<span id=\"more-279939\"></span>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>FULL ANSWER</strong></h2>\n\n\n\n<p>We&#8217;ve received several questions from readers about whether Immigration and Customs Enforcement agents get a bonus for each person they arrest. One reader asked if agents are paid $1,500 for each immigrant they arrest. Versions of this claim <a href=\"https://archive.is/5eQY5\" rel=\"noreferrer noopener\" target=\"_blank\">have circulated</a> on social media, with <a href=\"https://archive.ph/8dPzI\" rel=\"noreferrer noopener\" target=\"_blank\">some posts</a> pointing to a Wall Street Journal article that said ICE officers were &#8220;under pressure&#8221; to meet a daily nationwide arrest goal and were &#8220;rewarded for making arrests.&#8221; Some have interpreted this to mean a financial bonus. </p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full\"><img alt=\"\" class=\"wp-image-280111\" height=\"267\" src=\"https://cdn.factcheck.org/UploadedFiles/ICE-Arrest-400-x-267.png\" width=\"400\" /><figcaption class=\"wp-element-caption\">Federal agents arrest a man after stopping and questioning him in the street in Minneapolis on Jan. 14. Photo by Mostafa Bassim/Anadolu via Getty Images.</figcaption></figure></div>\n\n\n<p>The Department of Homeland Security and ICE didn&#8217;t respond to our multiple inquiries asking whether agents receive a bonus payment for each arrest. However, a DHS spokesperson <a href=\"https://www.snopes.com/news/2026/01/25/ice-arrest-bonuses/\" rel=\"noreferrer noopener\" target=\"_blank\">told</a>&nbsp;Snopes, which wrote about these claims, that &#8220;this policy has never and never was in effect.&#8221;</p>\n\n\n\n<p>The <a href=\"https://www.migrationpolicy.org/about/about-migration-policy-institute\" rel=\"noreferrer noopener\" target=\"_blank\">Migration Policy Institute</a>, a nonpartisan think tank, also told us it wasn&#8217;t aware of any per-arrest bonus structure. <a href=\"https://www.migrationpolicy.org/about/staff/michelle-mittelstadt\" rel=\"noreferrer noopener\" target=\"_blank\">Michelle Mittelstadt</a>, MPI&#8217;s director of communications and public affairs, said, &#8220;We do not believe these claims regarding bonuses for arrests are accurate. ICE and its parent agency, DHS, have never indicated that they would set up a bonus payment structure rewarding personnel per arrest.&#8221;</p>\n\n\n\n<p>In August, the New York Times reported on an ICE proposal to pay bonuses for quicker deportations — but it was canceled before it started and didn&#8217;t pertain to arrests.<strong>&nbsp;</strong><a href=\"https://www.nytimes.com/2025/08/05/us/politics/ice-bonuses-immigrants-deportations.html\" rel=\"noreferrer noopener\" target=\"_blank\">According</a>&nbsp;to the Times, an internal ICE email proposed &#8220;cash bonuses to agents for deporting people quickly, an incentive meant to motivate the staff to speed up President Trump’s mass deportation campaign. Less than four hours later, the agency abruptly canceled what was supposed to be a 30-day pilot program.&#8221;</p>\n\n\n\n<p>The Times reported that documents it reviewed called for $100 and $200 bonuses for each immigrant deported within one or two weeks of arrest. But a subsequent email to ICE field offices from Liana J. Castano, an ICE field operations official, told staff to &#8220;PLEASE DISREGARD&#8221; the program, the newspaper reported.&nbsp;</p>\n\n\n\n<p>As we said, some social media posts about arrest bonuses have pointed to a Jan. 17 Wall Street Journal article.&nbsp;The article about immigration enforcement in Minneapolis&nbsp;<a href=\"https://www.wsj.com/us-news/the-standoff-that-has-turned-minnesota-into-a-tinderbox-a3a7e672\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>&nbsp;that&nbsp;&#8220;officers here and elsewhere are under pressure from daily arrest quotas that leadership has set at 3,000 a day across the country—the number it would take to reach one million arrests in a year, according to ICE officials familiar with the matter. Though ICE has never come close to meeting that daily goal, officers are rewarded for making arrests, even if the immigrants they take in are later released.&#8221;</p>\n\n\n\n<p>The administration has publicly acknowledged the 3,000 arrest goal. In May, senior White House adviser Stephen Miller <a href=\"https://www.youtube.com/watch?v=MJNXsOqFSZs\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> on Fox News that the administration was &#8220;looking to set a goal of a minimum of 3,000 arrests for ICE every day and President Trump is going to keep pushing to get that number up higher each and every single day.&#8221;</p>\n\n\n\n<p>It&#8217;s unclear from the Wall Street Journal article how officers are &#8220;rewarded for making arrests&#8221;; the story says nothing about financial payments and doesn&#8217;t offer any more explanation about these rewards. We reached out to the Journal reporters for clarification, but we did not receive a response.</p>\n\n\n\n<p>We also didn&#8217;t get a response from DHS or ICE when we asked for comment on the Journal&#8217;s article. </p>\n\n\n\n<p>Some, including Minnesota Democratic Sen. Amy Klobuchar, <a href=\"https://www.facebook.com/amyklobuchar/posts/rewarding-ice-agents-for-arrests-even-if-the-person-is-released-without-charges-/1447187416763420/\" rel=\"noreferrer noopener\" target=\"_blank\">posted</a> that ICE was &#8220;rewarding&#8221; agents, an accurate summary of that article. Others interpreted this as a &#8220;bonus.&#8221; For instance, David J. Bier, the director of immigration studies at the libertarian Cato Institute, <a href=\"https://archive.is/Krda3\" rel=\"noreferrer noopener\" target=\"_blank\">posted</a> part of the article on X and said, &#8220;ICE agents get bonuses when they make wrongful arrests of US citizens.&#8221; Democratic Sen. Ruben Gallego, of Arizona, <a href=\"https://archive.is/ri2X1\" rel=\"noreferrer noopener\" target=\"_blank\">shared</a> Bier&#8217;s post and said, &#8220;Mistakenly arrest a US citizen? You get a big fat bonus.&#8221;</p>\n\n\n\n<p>Beyond these interpretations of the Journal&#8217;s article, we were unable to find evidence regarding claims about per-arrest bonuses. Bier told us the Journal story was the only information he had. Gallego&#8217;s office hasn&#8217;t responded to our inquiry. </p>\n\n\n\n<p>Snopes reported that some of its readers appeared to misconstrue the daily 3,000 arrest goal with a &#8220;$3,000 bonus for each arrest,&#8221; as some readers asked about. </p>\n\n\n\n<p>According to DHS&nbsp;<a href=\"https://www.dhs.gov/news/2025/07/29/dhs-launches-defend-homeland-nationwide-recruit-patriots-join-ice-law-enforcement\" rel=\"noreferrer noopener\" target=\"_blank\">press</a>&nbsp;<a href=\"https://www.ice.gov/news/releases/ice-announces-most-successful-federal-law-enforcement-agency-recruitment-campaign\" rel=\"noreferrer noopener\" target=\"_blank\">releases</a>, there is a signing bonus of up to $50,000 for new ICE hires.&nbsp;But that&#8217;s a recruitment and retention incentive, and there&#8217;s no indication it is&nbsp;tied to the number of arrests, or deportations for that matter, that an agent performs.</p>\n\n\n\n<p>The Republicans&#8217; 2025 budget bill, called the One Big Beautiful Bill Act, <a href=\"https://www.congress.gov/bill/119th-congress/house-bill/1/text/eh\" rel=\"noreferrer noopener\" target=\"_blank\">provided</a> $858 million for the signing bonuses, which, the legislation says, would be for new agents, officers or attorneys who agree to serve for five years or those already working for ICE who agree to stay with the agency for two more years. </p>\n\n\n\n<p>Last year, DHS&nbsp;<a href=\"https://www.dhs.gov/news/2025/09/02/dhs-announces-new-reimbursement-opportunities-state-and-local-law-enforcement\" rel=\"noreferrer noopener\" target=\"_blank\">announced</a>&nbsp;incentive funding&nbsp;to state and local law enforcement agencies that partner with ICE to arrest&nbsp;immigrants living in the country illegally. Beginning Oct.&nbsp;1, DHS said that&nbsp;participating agencies would receive&nbsp;reimbursement for trained officers’ salaries and benefits along with quarterly performance-based bonuses. These monetary awards range from $500 to $1,000 per&nbsp;&#8220;eligible task force officer,&#8221;&nbsp;depending on&nbsp;&#8220;the successful location of illegal aliens provided by ICE and overall assistance to further ICE’s mission to Defend the Homeland.&#8221;</p>\n\n\n\n<p>But that quarterly bonus program is for state and local police that cooperate with ICE, not a payment per arrest for ICE officers.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><em>Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through <a href=\"https://giving.aws.cloud.upenn.edu/?fastStart=simpleForm&amp;program=ANS&amp;fund=602014\" rel=\"noreferrer noopener\" target=\"_blank\">our “Donate” page</a>. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, P.O. Box 58100, Philadelphia, PA 19102. </em></p>\n<p>The post <a href=\"https://www.factcheck.org/2026/02/ice-officers-and-bonuses/\">ICE Officers and Bonuses</a> appeared first on <a href=\"https://www.factcheck.org\">FactCheck.org</a>.</p>",
    "url": "https://www.factcheck.org/2026/02/ice-officers-and-bonuses/",
    "publication_date": "Thu, 05 Feb 2026 22:17:27 +0000",
    "date_gathered": "2026-02-24T04:09:44.214277",
    "country": "US",
    "organization": "FactCheck"
  },
  {
    "title": "Trump’s Immediate Speculation on Shootings Bucks Presidential Norms",
    "content": "<img alt=\"\" class=\"attachment-medium_large size-medium_large wp-post-image\" height=\"273\" src=\"https://cdn.factcheck.org/UploadedFiles/TrumpPrettiThumb.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"640\" />\n<p>President Donald Trump wasted no time in responding to the deaths of two U.S. citizens last month during protests against an immigration crackdown in Minneapolis. Trump and other top administration officials made inaccurate or unsupported statements within hours of the incidents, a departure from how previous presidents responded in similar situations, experts told us.</p>\n\n\n\n<p>Hours after an Immigration and Customs Enforcement agent shot and killed <a href=\"https://apnews.com/article/ice-shooting-minneapolis-minnesota-9aa822670b705c89906f2c699f1d16c5\" rel=\"noreferrer noopener\" target=\"_blank\">Renee Good</a> on Jan. 7, Trump <a href=\"https://perma.cc/LLH9-3KCY\" rel=\"noreferrer noopener\" target=\"_blank\">claimed</a> that Good was &#8220;very disorderly, obstructing and resisting, who then violently, willfully, and viciously ran over the ICE Officer, who seems to have shot her in self defense.&#8221; The president included a video clip of the shooting, captured from a distance, but closer video showed the agent wasn&#8217;t run over.</p>\n\n\n\n<p>Then, hours after federal agents shot and killed <a href=\"https://apnews.com/article/immigration-enforcement-minnesota-protester-alex-pretti-15ade7de6e19cb0291734e85dac763dc\" rel=\"noreferrer noopener\" target=\"_blank\">Alex Pretti</a> on Jan. 24, Trump <a href=\"https://perma.cc/2CJH-85YH\" rel=\"noreferrer noopener\" target=\"_blank\">posted</a> a picture of a handgun and wrote, &#8220;This is the gunman&#8217;s gun, loaded (with two additional full magazines!), and ready to go – What is that all about? Where are the local Police? Why weren’t they allowed to protect ICE Officers? The Mayor and the Governor called them off? It is stated that many of these Police were not allowed to do their job, that ICE had to protect themselves — Not an easy thing to do!&#8221;</p>\n\n\n\n<p>Department of Homeland Security officials also made <a href=\"https://x.com/DHSgov/status/2015115351797780500\" rel=\"noreferrer noopener\" target=\"_blank\">statements</a> that Pretti &#8220;approached&#8221; officers with a handgun, &#8220;violently resisted&#8221; an attempt to &#8220;disarm&#8221; him, and &#8220;wanted to do maximum damage and massacre law enforcement.&#8221; As we&#8217;ve <a href=\"https://www.factcheck.org/2026/01/politicians-reach-different-conclusions-on-minnesota-shooting-video/\" rel=\"noreferrer noopener\" target=\"_blank\">explained</a>, in the immediate aftermath of a shooting, it&#8217;s difficult to know exactly what happened, but bystander videos contradicted DHS&#8217; account. They don&#8217;t show Pretti holding the gun or threatening officers with it.</p>\n\n\n\n<p>The president, himself, softened his remarks,&nbsp;<a href=\"https://www.wsj.com/politics/policy/trump-says-administration-is-reviewing-everything-about-minneapolis-shooting-a501f48e?gaa_at=eafs&amp;gaa_n=AWEtsqdB6uIi_aTjQ7wInLoGsnJByGNVICEFVVP_5ibNcCmPpx_4Zlyi16HynxBxy3M%3D&amp;gaa_ts=6977e434&amp;gaa_sig=Y-3MrAYWdTU51S30o49JRHzlMwf-942u9VeAYLoDLh9pXwwHih3Ix-kkqWAiF8nhKku7U6g-t1BWPYwVU1eitg%3D%3D\">saying</a>&nbsp;the next day, &#8220;We&#8217;re reviewing everything and will come out with a determination&#8221; on whether the federal agent&#8217;s actions were justified. And the civil rights division of the Justice Department is now <a href=\"https://www.npr.org/2026/01/30/nx-s1-5694313/alex-pretti-shooting-doj-civil-rights-investigation\" rel=\"noreferrer noopener\" target=\"_blank\">investigating</a> the Pretti killing.</p>\n\n\n\n<p>All four of the experts we spoke to &#8212; a group that included political communications researchers and historians &#8212; said that Trump&#8217;s remarks following these deaths marked a shift from previous presidents, and even from some of his own rhetoric during his first term.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft is-resized\"><img alt=\"\" class=\"wp-image-280034\" height=\"267\" src=\"https://cdn.factcheck.org/UploadedFiles/TrumpPrettiFull.jpg\" style=\"width: 452px; height: auto;\" width=\"400\" /><figcaption class=\"wp-element-caption\">Trump speaks to reporters on Jan. 27 about the shooting of Alex Pretti in Minneapolis. Photo by Kyle Mazza/Anadolu via Getty Images.</figcaption></figure></div>\n\n\n<p>&#8220;As with so much else Trump, yes &#8212; he&#8217;s extremely different,&#8221; <a href=\"https://gspm.gwu.edu/matt-dallek\" rel=\"noreferrer noopener\" target=\"_blank\">Matt Dallek</a>, a political historian and professor at George Washington University&#8217;s Graduate School of Political Management, told us in an interview.</p>\n\n\n\n<p>&#8220;He&#8217;s much more extreme and far more untethered from facts and the reality on the ground,&#8221; Dallek said, noting that, importantly, it&#8217;s not just the president, but also his officials who have taken this tack.</p>\n\n\n\n<p>Others we spoke to made the same point.</p>\n\n\n\n<p>&#8220;Without question,&#8221; there has been a shift, <a href=\"https://commstudies.utexas.edu/faculty/roderick-hart\" rel=\"noreferrer noopener\" target=\"_blank\">Roderick Hart</a>, a professor emeritus of communication at the University of Texas at Austin with expertise in politics and the mass media, told us. &#8220;And it has very little to do with this particular situation in Minneapolis. He&#8217;s&nbsp;a rhetoric-first guy. &#8230; And he&#8217;s chosen his people who have exactly the same instincts,&#8221; Hart said.</p>\n\n\n\n<p>Presidents are normally judicious, particularly when reacting to an event, Hart said. But, &#8220;Trump talks before the event is even finished.&#8221;</p>\n\n\n\n<p>The Minnesota fatal shootings, however, involved federal agents, while examples from past presidencies concern state or local officers.&nbsp;</p>\n\n\n\n<p>For example, former President Barack Obama &#8212; who was in office at a <a href=\"https://basslab.usc.edu/bass-and-beyond/witnessing-police-brutality/#:~:text=The%20videos%20of%20Grant's%20shooting%20helped%20galvanize,in%202012%20and%20Michael%20Brown%20in%202014.\" rel=\"noreferrer noopener\" target=\"_blank\">moment</a> when the ubiquity of camera phones and the rise of social media <a href=\"https://bja.ojp.gov/sites/g/files/xyckuh186/files/media/document/public-perceptions-of-the-justifiability-of-police-shootings.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">converged</a> to shine light on the killings of unarmed Black men and boys &#8212; took more time before publicly expressing his thoughts.</p>\n\n\n\n<p>One of the first illustrations of this moment didn&#8217;t actually feature an officer, but rather a neighborhood watch volunteer in central Florida, who shot and killed 17-year-old <a href=\"https://www.britannica.com/event/shooting-of-Trayvon-Martin\" rel=\"noreferrer noopener\" target=\"_blank\">Trayvon Martin</a> on Feb. 26, 2012. About a month after that, in response to a reporter&#8217;s question, Obama <a href=\"https://www.presidency.ucsb.edu/documents/remarks-the-nomination-jim-yong-kim-be-president-the-world-bank-and-exchange-with\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>, in part, &#8220;Well, I&#8217;m the head of the executive branch, and the attorney general reports to me, so I&#8217;ve got to be careful about my statements to make sure that we&#8217;re not impairing any investigation that&#8217;s taking place right now. But obviously, this is a tragedy. I can only imagine what these parents are going through. And when I think about this boy, I think about my own kids. And I think every parent in America should be able to understand why it is absolutely imperative that we investigate every aspect of this and that everybody pulls together &#8212; federal, state, and local &#8212; to figure out exactly how this tragedy happened.&#8221; </p>\n\n\n\n<p>Obama continued: &#8220;But my main message is to the parents of Trayvon Martin. If I had a son, he&#8217;d look like Trayvon. And I think they are right to expect that all of us as Americans are going to take this with the seriousness it deserves and that we&#8217;re going to get to the bottom of exactly what happened.&#8221;</p>\n\n\n\n<p>In 2014, a <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0047272721001936#:~:text=Highly%20publicized%20police%20killings%20during,Michael%20Brown%20in%20Ferguson%2C%20Missouri%2C\" rel=\"noreferrer noopener\" target=\"_blank\">year</a> that saw several high-profile police killings, Obama waited three days to publicly respond to the Aug. 9 <a href=\"https://www.justice.gov/sites/default/files/opa/press-releases/attachments/2015/03/04/doj_report_on_shooting_of_michael_brown_1.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">death</a> of 18-year-old <a href=\"https://www.npr.org/2024/08/09/nx-s1-5064675/michael-brown-ferguson-killing-10-years\" rel=\"noreferrer noopener\" target=\"_blank\">Michael Brown</a>, who was shot and killed by a local police officer in Ferguson, Missouri, sparking <a href=\"https://www.ebsco.com/research-starters/political-science/2014-ferguson-unrest\" rel=\"noreferrer noopener\" target=\"_blank\">widespread</a> <a href=\"https://nmaahc.si.edu/explore/stories/remembering-ferguson\" rel=\"noreferrer noopener\" target=\"_blank\">protests</a>.</p>\n\n\n\n<p>Then, Obama said in a <a href=\"https://obamawhitehouse.archives.gov/realitycheck/the-press-office/2014/08/12/statement-president-passing-michael-brown\" rel=\"noreferrer noopener\" target=\"_blank\">statement</a>: &#8220;The death of Michael Brown is heartbreaking, and Michelle and I send our deepest condolences to his family and his community at this very difficult time. As Attorney General Holder has indicated, the Department of Justice is investigating the situation along with local officials, and they will continue to direct resources to the case as needed. I know the events of the past few days have prompted strong passions, but as details unfold, I urge everyone in Ferguson, Missouri, and across the country, to remember this young man through reflection and understanding. We should comfort each other and talk with one another in a way that heals, not in a way that wounds. Along with our prayers, that&#8217;s what Michael and his family, and our broader American community, deserve.&#8221;</p>\n\n\n\n<p>The former president waited three weeks &#8212; when he was asked about it in an interview &#8212; to comment on the shooting death that year of 12-year-old <a href=\"https://www.justice.gov/archives/opa/pr/justice-department-announces-closing-investigation-2014-officer-involved-shooting-cleveland\" rel=\"noreferrer noopener\" target=\"_blank\">Tamir Rice</a> in Cleveland. In a lengthy answer to a question about how responsible he felt his administration was for addressing police shootings, Obama <a href=\"https://www.bet.com/article/cqro4z/transcript-bet-s-exclusive-interview-with-president-obama\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>, &#8220;Well, I think an enormous amount. Not just because, as president, you&#8217;re always responsible for what happens in this country and you&#8217;ve got to be part of the solution, not part of the problem, but because of my particular experiences that I bring to this office.&#8221;</p>\n\n\n\n<p>And Obama took more than four months to make remarks on the July 17, 2014, death of Eric Garner in New York &#8212; the former president had waited until a grand jury <a href=\"https://www.usatoday.com/story/news/nation/2014/12/03/chokehold-grand-jury/19804577/\" rel=\"noreferrer noopener\" target=\"_blank\">decided</a> not to indict the police officer who had <a href=\"https://www.nytimes.com/2019/05/15/nyregion/eric-garner-death-daniel-pantaleo-chokehold.html\" rel=\"noreferrer noopener\" target=\"_blank\">choked</a> Garner. In December 2014, Obama <a href=\"https://obamawhitehouse.archives.gov/the-press-office/2014/12/03/remarks-president-tribal-nations-conference\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>, in part, &#8220;My tradition is not to remark on cases where there may still be an investigation. But I want everybody to understand that this week, in the wake of Ferguson, we initiated a Task Force whose job it is to come back to me with specific recommendations about how we strengthen the relationship between law enforcement and communities of color and minority communities that feel that bias is taking place; that we are going to take specific steps to improve the training and the work with State and local governments when it comes to policing in communities of color; that we are going to be scrupulous in investigating cases where we are concerned about the impartiality and accountability that&#8217;s taking place.&#8221;</p>\n\n\n\n<p>Before the era of the camera phone, the <a href=\"https://www.britannica.com/biography/Rodney-King\" rel=\"noreferrer noopener\" target=\"_blank\">Rodney King</a> case in 1991 grabbed national attention when a man in a nearby apartment videotaped Los Angeles police beating King during a traffic stop.</p>\n\n\n\n<p>Then-President George H.W. Bush waited almost three weeks before commenting. Then, in a prepared statement on March 21, 1991, he <a href=\"https://www.govinfo.gov/content/pkg/PPP-1991-book1/html/PPP-1991-book1-doc-pg295.htm\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>, in part, &#8220;We&#8217;ve all seen those shocking videotapes and have seen transcripts of the incident in Los Angeles. And without getting into the specifics of the case, those terrible scenes stir us all to demand an end to gratuitous violence and brutality. Law enforcement officials cannot place themselves above the law that they are sworn to defend. This administration will investigate possible breaches of federal law aggressively and will prosecute violators to the full extent of the law. &#8230; I was shocked by what I saw in that tape&#8211;that violence. And to the degree there&#8217;s a federal role here, I&#8217;m confident we will go the extra mile to see that that is fulfilled.&#8221;</p>\n\n\n\n<p>Going back even further, to the 1970s, Dallek said, &#8220;Even Nixon&#8217;s comments in the wake of the Kent State killings were far more restrained and measured than anything Trump has offered the American people.&#8221;</p>\n\n\n\n<p>On May 4, 1970, the same day that the National Guard shot and killed four students during a protest of the Vietnam War at Kent State University in Ohio, then-President Richard Nixon issued a <a href=\"https://www.presidency.ucsb.edu/documents/statement-the-deaths-four-students-kent-state-university-kent-ohio\" rel=\"noreferrer noopener\" target=\"_blank\">statement</a> that said, &#8220;This should remind us all once again that when dissent turns to violence, it invites tragedy. It is my hope that this tragic and unfortunate incident will strengthen the determination of all the Nation&#8217;s campuses&#8211;administrators, faculty, and students alike&#8211;to stand firmly for the right which exists in this country of peaceful dissent and just as strongly against the resort to violence as a means of such expression.&#8221;</p>\n\n\n\n<p>When he was asked about the proper role of the National Guard &#8212; which, in this <a href=\"https://www.kent.edu/may-4-historical-accuracy\" rel=\"noreferrer noopener\" target=\"_blank\">case</a>, had been called in by the state&#8217;s governor &#8212; at a press conference four days later, Nixon <a href=\"https://www.presidency.ucsb.edu/documents/the-presidents-news-conference-144\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>, &#8220;I want to know what the facts are. I have asked for the facts. When I get them, I will have something to say about it. But I do know when you do have a situation of a crowd throwing rocks and the National Guard is called in, that there is always the chance that it will escalate into the kind of a tragedy that happened at Kent State. If there is one thing I am personally committed to, it is this: I saw the pictures of those four youngsters in the Evening Star the day after that tragedy, and I vowed then that we were going to find methods that would be more effective to deal with these problems of violence, methods that would deal with those who would use force and violence and endanger others, but, at the same time, would not take the lives of innocent people.&#8221;</p>\n\n\n\n<p>&#8220;There are some echoes, I think,&#8221; Dallek said, comparing Trump&#8217;s recent statements with Nixon&#8217;s. But Nixon was much more measured in the aftermath, Dallek said, adding that &#8220;he never branded [the students] as traitors or domestic terrorists.&#8221; (After the Good killing, DHS Secretary Kristi Noem <a href=\"https://www.rev.com/transcripts/noem-speaks-on-mn-ice-shooting\" rel=\"noreferrer noopener\" target=\"_blank\">called</a> Good&#8217;s actions &#8220;domestic terrorism,&#8221; and Noem <a href=\"https://www.rev.com/transcripts/dhs-press-brirfing-1-24-25\" rel=\"noreferrer noopener\" target=\"_blank\">used the same phrase</a> to describe Pretti&#8217;s actions.)</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Minneapolis Cases Involved Federal Agents</h2>\n\n\n\n<p>One distinction between these previous examples and the current situation is that agents deployed in Minneapolis are federal, rather than state or local, <a href=\"https://millercenter.org/experts/barbara-perry\" rel=\"noreferrer noopener\" target=\"_blank\">Barbara Perry</a>, a professor of governance at the University of Virginia&#8217;s <a href=\"https://millercenter.org/about/who-we-are\" rel=\"noreferrer noopener\" target=\"_blank\">Miller Center</a>, which focuses on the American presidency, told us in an interview.</p>\n\n\n\n<p>Since most previous cases of officer-involved shootings implicated state or local police, presidents could distance themselves, she said, and say that the Justice Department would investigate.</p>\n\n\n\n<p>&#8220;So they could keep at arms length the legal process while expressing their sorrow,&#8221; Perry said.</p>\n\n\n\n<p>Similarly, Guian A. McKee, a professor of public affairs at the Miller Center, told us in an email, &#8220;Trump administration statements about the recent killings in Minneapolis have been immediate, they have been political, and they have had little regard for facts or willingness to wait until evidence is clear.&#8221;</p>\n\n\n\n<p>He went on to explain that one reason for this may be that &#8220;the recent killings have been done by federal agents acting as instruments of the president&#8217;s own policies and the tactics chosen to implement them. This has not been the case in most other law enforcement-involved deaths, where the officers were state or local. So the actions and their consequences fall much closer to the president.&#8221;</p>\n\n\n\n<p>Near the end of his first term, Trump made conciliatory remarks about a high-profile case that involved local police officers, not federal agents.</p>\n\n\n\n<p>Two days after the May 25, 2020, killing of <a href=\"https://www.nytimes.com/2020/05/31/us/george-floyd-investigation.html\" rel=\"noreferrer noopener\" target=\"_blank\">George Floyd</a>, whose death under the knee of a Minneapolis police officer led to widespread protests, Trump wrote on <a href=\"https://x.com/realDonaldTrump/status/1265774767493148672?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1265774767493148672%7Ctwgr%5E78f1ad20895f7eb11203918257df148bab7ad2b4%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.thetrumparchive.com%2F%3Fsearchbox%3D22georgefloyd22\" rel=\"noreferrer noopener\" target=\"_blank\">Twitter</a>, &#8220;At my request, the FBI and the Department of Justice are already well into an investigation as to the very sad and tragic death in Minnesota of George Floyd.&#8221;</p>\n\n\n\n<p>And, two days after that, on May 29, he <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-roundtable-reopening-economy-coronavirus-may-29-2020/#266\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> at the start of an event for business leaders, &#8220;I want to express our nation&#8217;s deepest condolences and most heartfelt sympathies to the family of George Floyd. A terrible event. Terrible, terrible thing that happened. I&#8217;ve asked that the Department of Justice expedite the federal investigation into his death and do it immediately, do it as quickly as absolutely possible. &#8230; It should never be allowed to happen, a thing like that.&#8221;</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><em>Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through <a href=\"https://giving.aws.cloud.upenn.edu/?fastStart=simpleForm&amp;program=ANS&amp;fund=602014\" rel=\"noreferrer noopener\" target=\"_blank\">our “Donate” page</a>. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, P.O. Box 58100, Philadelphia, PA 19102. </em></p>\n<p>The post <a href=\"https://www.factcheck.org/2026/02/trumps-immediate-speculation-on-shootings-bucks-presidential-norms/\">Trump&#8217;s Immediate Speculation on Shootings Bucks Presidential Norms</a> appeared first on <a href=\"https://www.factcheck.org\">FactCheck.org</a>.</p>",
    "url": "https://www.factcheck.org/2026/02/trumps-immediate-speculation-on-shootings-bucks-presidential-norms/",
    "publication_date": "Tue, 03 Feb 2026 22:20:26 +0000",
    "date_gathered": "2026-02-24T04:09:44.214281",
    "country": "US",
    "organization": "FactCheck"
  },
  {
    "title": "Americans Don’t Need ‘Dramatically’ More Protein, Despite Officials’ Claims",
    "content": "<img alt=\"\" class=\"attachment-medium_large size-medium_large wp-post-image\" height=\"273\" src=\"https://cdn.factcheck.org/UploadedFiles/Food-Pyramid-720-x-307.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"640\" />\n<p>In unveiling&nbsp;new dietary guidelines, federal health officials have claimed they are correcting past guidance that&nbsp;created a “generation of kids low in protein”&nbsp;and that Americans should get &#8220;dramatically&#8221; more of the nutrient.&nbsp;While&nbsp;some&nbsp;individuals may&nbsp;benefit from&nbsp;more protein,&nbsp;Americans are&nbsp;not generally protein-deficient.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft\"><img alt=\"\" src=\"https://cdn.factcheck.org/UploadedFiles/SciCHECKsquare_4-161x145.png\" /></figure></div>\n\n\n<p>In fact,&nbsp;many&nbsp;Americans, including a majority of children, already meet or come near to meeting the lower end of the higher daily protein goals promoted in the new&nbsp;<a href=\"https://cdn.realfood.gov/DGA.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">guidelines</a>, which range from 1.2 to 1.6 grams per kilogram of body weight per day. There’s some uncertainty about how much protein people should consume for optimal health. Multiple factors affect protein needs, which may be higher for older adults, as well as for people who are building muscle through exercise or actively losing weight.</p>\n\n\n\n<p>Despite this nuance, officials portrayed the 2025-2030 Dietary Guidelines for Americans, released Jan. 7, as righting a clear wrong, while misleadingly stating or implying that Americans in general need to eat significantly more protein. The new guidelines include an inverted food pyramid that prominently features a large steak, and the website promoting the guidelines <a href=\"https://perma.cc/9D7R-ASDQ\" rel=\"noreferrer noopener\" target=\"_blank\">proclaims</a>, &#8220;We are ending the war on protein.&#8221;</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full\"><img alt=\"\" class=\"wp-image-280019\" height=\"267\" src=\"https://cdn.factcheck.org/UploadedFiles/Food-Pyramid-400-x-267.png\" width=\"400\" /><figcaption class=\"wp-element-caption\">A phone shows the new food pyramid. Photo by Smith Collection/Gado/Getty Images</figcaption></figure></div>\n\n\n<p>“The old guidelines had about half the protein that you need,” Dr. Marty Makary, the Food and Drug Administration commissioner,&nbsp;<a href=\"https://www.instagram.com/reel/DTTjiHWCWMj/\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>&nbsp;<a href=\"https://www.instagram.com/reel/DTTkin-CcgM/\" rel=\"noreferrer noopener\" target=\"_blank\">during</a> a Jan. 9 <a href=\"https://transcripts.cnn.com/show/sitroom/date/2026-01-09/segment/04\" rel=\"noreferrer noopener\" target=\"_blank\">appearance</a> on CNN. “Look at the consequence of the old, corrupt food pyramid: a generation of kids low in protein, struggling with muscle mass, weak, having trouble concentrating, addicted to ultraprocessed foods and refined carbohydrates.”</p>\n\n\n\n<p>&#8220;The science was clear enough on proteins that we should dramatically increase our input of proteins,” Department of Health and Human Services Secretary Robert F. Kennedy Jr.&nbsp;<a href=\"https://www.youtube.com/live/37zoZLUC9_Y\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>&nbsp;during a Jan. 21 rally.</p>\n\n\n\n<p>Nutrition experts we interviewed objected to the idea that Americans in general need to “dramatically increase” protein intake, or that children are broadly deficient. HHS did not reply to an email asking for more information to support these claims.</p>\n\n\n\n<p>&#8220;When you look at most intake surveys, most Americans were getting in the range of intakes that is being recommended, close to 1.2&#8221; grams per kilogram of body weight per day,&nbsp;<a href=\"https://mira.mcmaster.ca/our-faculty/stuart-phillips/\" rel=\"noreferrer noopener\" target=\"_blank\">Stuart Phillips</a>, a professor who studies the effects of nutrition and exercise on skeletal muscle at McMaster University in Canada, told us.</p>\n\n\n\n<p>For reference, the recommended range would translate to around 108 to 144 grams of protein per day for a 199-pound man or 94 to 125 grams per day for a 172-pound woman, the <a href=\"https://www.cdc.gov/nchs/fastats/body-measurements.htm\" rel=\"noreferrer noopener\" target=\"_blank\">average weights</a> for U.S. adults. A 3-ounce <a href=\"https://www.cspi.org/article/how-much-protein-eggs-chicken-beans-or-other-foods\" rel=\"noreferrer noopener\" target=\"_blank\">serving</a> of chicken breast has 26 grams of protein; a 3-ounce serving of cooked salmon has 19 grams; half a cup of cooked lentils or white beans has 9 grams; and a cup of milk has 8 grams.</p>\n\n\n\n<p>Moreover, “probably less than 5% of the U.S. population eat diets that are consistent with the previous dietary guidelines,” <a href=\"https://hhs.purdue.edu/directory/wayne-campbell/\" rel=\"noreferrer noopener\" target=\"_blank\">Wayne Campbell</a>, a Purdue University professor who studies nutrients, foods and dietary patterns, told us. “It is an inappropriate attack on past guidelines to say that the guidelines are the reason why everybody eats a poor diet and is not as healthy as they hopefully would be.”</p>\n\n\n\n<p>“There is no evidence of widespread protein deficiency in the U.S. population,” Dr.&nbsp;<a href=\"https://hsph.harvard.edu/profile/frank-b-hu/\" rel=\"noreferrer noopener\" target=\"_blank\">Frank B. Hu</a>, a&nbsp;professor of nutrition and epidemiology at Harvard T.H. Chan School of Public Health, told us.</p>\n\n\n\n<p>Previous editions of the dietary guidelines did not give a particular figure for the amount of protein people should eat, experts said. Hu explained that a different group of experts helps set daily recommendations for specific ranges of protein and other nutrients.</p>\n\n\n\n<p>“Who is going to track how many grams per kilogram body weight of protein” they are eating? <a href=\"https://ucanr.edu/people/wendi-gosliner\" rel=\"noreferrer noopener\" target=\"_blank\">Wendi Gosliner</a>, who leads research projects at the University of California’s Nutrition Policy Institute, told us, noting that the guidelines are meant to guide federal food programs and nutrition education by providing advice that is &#8220;digestible&#8221; for the general public.</p>\n\n\n\n<p>Raising protein intake recommendations requires data showing &#8220;widespread protein inadequacy&#8221; or that there are benefits to eating more protein beyond the minimum, Hu said. “We don’t have any of those data at this point to substantially increase protein intake recommendations&#8221; for the general population, Hu said. He added that an argument could be made for relatively high protein intake for certain segments of the population, including people on weight loss drugs, older adults and people engaged in physical activity that builds muscles.</p>\n\n\n\n<p>Some experts are supportive of the protein recommendations in the new guidelines.</p>\n\n\n\n<p>Phillips, who was not involved in the guidelines, said that the new range is “more in line with what I would recommend,” agreeing the evidence is particularly strong for certain subgroups and depends on physical activity level. However, he disagreed with the implication that prior guidelines led to widespread deficiency.</p>\n\n\n\n<p>Claims that the old food pyramid “produced a ‘generation of children low in protein’ or broadly impaired muscle mass or cognition are not supported by direct evidence,” Phillips told us. “Childhood health challenges are far more plausibly linked to excess energy intake, poor diet quality, physical inactivity, and high consumption of ultra-processed foods than to insufficient protein per se.”</p>\n\n\n\n<p>(To be clear, the new food pyramid does not replace the original 1992 food pyramid people may remember, which was&nbsp;<a href=\"https://www.politifact.com/article/2025/nov/07/food-pyramid-history-my-plate-healthy-diet/\" rel=\"noreferrer noopener\" target=\"_blank\">replaced</a>&nbsp;by another, less hierarchical pyramid in 2005 and then <a href=\"https://web.archive.org/web/20260101004950/https://www.myplate.gov/\" rel=\"noreferrer noopener\" target=\"_blank\">MyPlate</a> in 2011.)</p>\n\n\n\n<p>“My takeaway from all of it is that we’ve elevated protein in people’s thinking, it&#8217;s front and center, and we gave people very specific goals,”&nbsp;<a href=\"https://fshn.illinois.edu/directory/dlayman\" rel=\"noreferrer noopener\" target=\"_blank\">Donald Layman</a>, a protein biochemist and professor emeritus at the University of Illinois at Urbana-Champaign, told us. “I think we’ve made an enormous step forward in clarity.” Layman, who is also a food company consultant, owns a fat loss company that sells meal replacement shakes, although he told us he has lost money on this latter endeavor.</p>\n\n\n\n<p>Layman and nutritional physiologist&nbsp;<a href=\"https://nutrition.utexas.edu/directory/heather-leidy\" rel=\"noreferrer noopener\" target=\"_blank\">Heather Leidy</a>&nbsp;of the University of Texas at Austin co-authored&nbsp;<a href=\"https://cdn.realfood.gov/Scientific%20Report%20Appendices.pdf#page=348\" rel=\"noreferrer noopener\" target=\"_blank\">reviews</a>&nbsp;of the effects of the new recommended protein range on weight management and nutrient adequacy for HHS and the U.S. Department of Agriculture, the agencies that produce the guidelines.</p>\n\n\n\n<p>Unusually, Layman, Leidy and&nbsp;<a href=\"https://cdn.realfood.gov/Scientific%20Report.pdf#page=10\" rel=\"noreferrer noopener\" target=\"_blank\">seven</a>&nbsp;additional scientists were asked to perform these reviews in under three months,&nbsp;<a href=\"https://www.statnews.com/2026/01/17/new-food-pyramid-behind-the-scenes-dietary-guideline-development/\" rel=\"noreferrer noopener\" target=\"_blank\">according</a>&nbsp;to STAT. A 20-person committee of nutrition researchers had previously spent years identifying research questions, reviewing the literature and formulating recommendations. The scientific advisory committee does not write the guidelines, but their conclusions inform them.&nbsp;The guidelines in the past have been <a href=\"https://www.dietaryguidelines.gov/sites/default/files/2020-12/Dietary_Guidelines_for_Americans_2020-2025.pdf#page=9\" rel=\"noreferrer noopener\" target=\"_blank\">credited</a> to a list of HHS and USDA staff, although this year&#8217;s guidance <a href=\"https://cdn.realfood.gov/DGA.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">document</a> does not name authors.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\"><strong>Muddled Messages on the Role of the Dietary Guidelines</strong></h2>\n\n\n\n<p>Makary has&nbsp;<a href=\"https://www.rev.com/transcripts/new-white-house-dietary-guidelines\" rel=\"noreferrer noopener\" target=\"_blank\">repeatedly</a>&nbsp;<a href=\"https://www.thefp.com/p/why-we-threw-out-the-broken-food\" rel=\"noreferrer noopener\" target=\"_blank\">said</a>&nbsp;<a href=\"https://x.com/RapidResponse47/status/2009257110081589453\" rel=\"noreferrer noopener\" target=\"_blank\">that</a>&nbsp;the new Dietary Guidelines for Americans increased recommended daily protein intake by “50% to 100%.”</p>\n\n\n\n<p>It’s true that the new recommended intake of 1.2 to 1.6 grams per kilogram of body weight per day is 50% to 100% above the&nbsp;<a href=\"https://www.health.harvard.edu/nutrition/what-are-rdas-dris-and-dvs\" rel=\"noreferrer noopener\" target=\"_blank\">Recommended Dietary Allowance</a>&nbsp;of 0.8 grams per kilogram per day for adults. (Children have somewhat&nbsp;<a href=\"https://publications.aap.org/aapbooks/monograph/734/chapter/11477417/Protein\" rel=\"noreferrer noopener\" target=\"_blank\">higher</a>&nbsp;RDAs, when measured per kilogram of body weight.) These RDAs were established to set baselines for nutrients to prevent deficiency in the vast majority of Americans.</p>\n\n\n\n<p>But to be clear, the Dietary Guidelines for Americans do not set RDAs, Campbell explained, which are instead set via a process&nbsp;<a href=\"https://ods.od.nih.gov/HealthInformation/nutrientrecommendations.aspx\" rel=\"noreferrer noopener\" target=\"_blank\">led</a>&nbsp;by the Food and Nutrition Board of the National Academies of Sciences Engineering, and Medicine.&nbsp;</p>\n\n\n\n<p>The RDA is “not a recommendation for people to purposefully try to eat that amount of protein,” Campbell said, but rather represents an amount people should not fall below. “If you’re eating 1.0 gram per kilo, 1.2 or 1.4 — or even very few people eat 1.6 — then that’s all within a range &#8230; that the 0.8 would support.”</p>\n\n\n\n<p>The RDAs, along with other values,&nbsp;<a href=\"https://www.health.harvard.edu/nutrition/what-are-rdas-dris-and-dvs\" rel=\"noreferrer noopener\" target=\"_blank\">inform</a>&nbsp;the dietary guidelines. However, Campbell said that the guidelines are meant to recommend which food types to eat, not particular nutrient intakes. Researchers do modeling to ensure what they are recommending “meets or moderately exceeds” the nutrient minimums, he said. He was not involved in the current guidelines but served on the scientific advisory committee for the 2015-2020 guidelines.</p>\n\n\n\n<p>Campbell said that the current RDA&nbsp;was&nbsp;based on the best&nbsp;evidence&nbsp;available in the early 2000s, when it was last reviewed, and that there&#8217;s &#8220;inconsistent&#8221; evidence since on whether it should be changed. <a href=\"https://www.nationalacademies.org/units/HMD-FNB-21-P-406\" rel=\"noreferrer noopener\" target=\"_blank\">Ann Yaktine</a>, director of the Food and Nutrition Board, told us that protein is among the nutrients set to be updated, although she said she could not predict a timeline. Until that update is complete, she said, the current RDA “will remain,” adding that RDAs and other nutrient-related values inform the dietary guidelines, &#8220;not the reverse.&#8221;</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\"><strong>For Most, No &#8216;Dramatic&#8217; Increase in Protein Needed</strong></h2>\n\n\n\n<p>Americans mostly exceed the minimal requirement to prevent protein deficiency and, in many cases, even meet the higher goal set in the new Dietary Guidelines for Americans.</p>\n\n\n\n<p>“The consensus has not been that there is a dramatic shortage of protein in this country,” Gosliner said, contrary to Kennedy’s claim that Americans need to “dramatically” increase intake.</p>\n\n\n\n<p>Using survey&nbsp;<a href=\"https://www.ars.usda.gov/northeast-area/beltsville-md-bhnrc/beltsville-human-nutrition-research-center/food-surveys-research-group/docs/wweianhanes-overview/\" rel=\"noreferrer noopener\" target=\"_blank\">data</a>&nbsp;on American diets collected by the U.S. government, researchers have estimated that adults on average get&nbsp;<a href=\"https://kcklatt.substack.com/p/ambiguous-dgas-and-the-ranchers-pyramid\" rel=\"noreferrer noopener\" target=\"_blank\">near</a>&nbsp;or even slightly&nbsp;<a href=\"https://perma.cc/6CRH-6SXT\" rel=\"noreferrer noopener\" target=\"_blank\">above</a>&nbsp;1.2 grams of protein per kilogram of body weight per day &#8212; the bottom of the range now recommended by the dietary guidelines.</p>\n\n\n\n<p>“Because the intake of protein is already pretty high, especially animal protein, in the U.S. population, there is no evidence that further increasing protein intake, especially in a major way, will confer significant health benefit,” Hu said.</p>\n\n\n\n<p>However, Layman pointed out that there’s variation in how much protein Americans consume. The people who already consume protein within the new recommended range do not need to increase their intake, he said, but some people &#8220;need to dramatically increase&#8221; protein intake.</p>\n\n\n\n<p>A 2018&nbsp;<a href=\"https://www.sciencedirect.com/science/article/pii/S0002916522029215?via%3Dihub\" rel=\"noreferrer noopener\" target=\"_blank\">study</a>&nbsp;on protein intakes between 2001 and 2014&nbsp;<a href=\"https://ajcn.nutrition.org/action/showFullTableHTML?isHtml=true&amp;tableId=t1&amp;pii=S0002-9165%2822%2902921-5\" rel=\"noreferrer noopener\" target=\"_blank\">shows</a>&nbsp;that nonelderly American adult males on average exceeded 1.2 grams per kilogram, but that the average fell to closer to 1.0 as they aged. Women on average got between approximately 1.0 and 1.15 grams per kilogram per day, with amounts also falling with age.</p>\n\n\n\n<p>Phillips also said there was room for improvement in protein consumption. “Many Americans meet the RDA only marginally, consume protein in uneven daily patterns, or obtain it largely from low-quality, ultra-processed sources,” he said. However, he added that most Americans “are not protein deficient in the clinical sense.” He cautioned against framing the new recommendations as being driven by deficiency, rather than a way to optimize certain outcomes.</p>\n\n\n\n<p>Makary’s claim that prior guidelines led to “a generation of kids low in protein” also overstates the prevalence of protein deficiency in the U.S.</p>\n\n\n\n<p>“It’s not like there’s growth stunting on a large scale in the United States because kids are protein deficient,” Phillips said. “It’s disingenuous at best and flat out wrong at worst.”</p>\n\n\n\n<p>The 2018 study <a href=\"https://www.sciencedirect.com/science/article/pii/S0002916522029215?via%3Dihub#t3\" rel=\"noreferrer noopener\" target=\"_blank\">found</a> that virtually no children age 8 and under ate less than the RDA — the level meant to prevent deficiency in the vast majority of the population. Protein underconsumption did rise with age for minors, with 11% of teenage boys and 23% of teenage girls not meeting the RDA.</p>\n\n\n\n<p>Most age groups of children, both male and female, on average exceeded 1.2 grams of protein per kilogram of body weight per day. The exception was adolescent girls, who consumed around 1.1 grams of protein per kilogram daily.</p>\n\n\n\n<p>Layman acknowledged a relative lack of research on children and protein intake but also pointed to data showing that adolescents are at risk of not eating enough protein. He also listed the many poor health outcomes for American children today and argued that past guidance had preceded changes in kids&#8217; diets.</p>\n\n\n\n<p>&#8220;We know it&#8217;s not working,&#8221; he said. &#8220;We know that after the original guidelines in 1980 that mothers, thinking they were doing the right thing and avoiding cholesterol and saturated fat, switched from having eggs and bacon and milk at breakfast to having Pop-Tarts and Cap&#8217;n Crunch and orange juice.&#8221;</p>\n\n\n\n<p>However, Hu detailed a long list of factors other than protein that have led to childhood obesity and other metabolic conditions. These include generally low-quality diets in an obesity-promoting environment, lack of sufficient sleep, inactivity and excessive social media use. “Those are all important drivers of adverse health incomes in children,” he said. “I don’t think protein inadequacy or protein deficiency is a major driver.”</p>\n\n\n\n<p>“I wish I could tell you that I thought that &#8230; we just haven’t been feeding kids enough protein, particularly animal protein, and that’s what&#8217;s causing all of the very sad dietary-related challenges that kids are experiencing,” Gosliner said. “From my perspective, there is no evidence of that being true.”</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">More Protein May Benefit Certain Groups</h2>\n\n\n\n<p>A separate question is whether people are generally healthier if they consume&nbsp;substantially more protein than the RDA&#8217;s minimum requirement.</p>\n\n\n\n<p>Campbell said that this is a challenging question to answer rigorously. “It’s very difficult to do controlled feeding studies of sufficient length to actually feed people different quantities of protein for months on end to see what happens to them,” he said.</p>\n\n\n\n<p>“Where the science is strongest is in showing that certain groups benefit from protein intakes above the RDA,” Phillips said. “Older adults, people engaged in regular resistance or endurance training, individuals recovering from illness or injury, and those intentionally losing weight all appear to achieve better outcomes at intakes closer to 1.2–1.6 g/kg/day. In these contexts, higher protein supports the maintenance of lean mass, functional capacity, and satiety.”&nbsp;</p>\n\n\n\n<p>However, Hu criticized the new guidelines for setting this intake goal broadly, saying that they “are not designed for specific groups of U.S. adults,” but rather the general population.&nbsp;</p>\n\n\n\n<p>In a Jan. 7 opinion&nbsp;<a href=\"https://www.thefp.com/p/why-we-threw-out-the-broken-food\" rel=\"noreferrer noopener\" target=\"_blank\">article</a>&nbsp;in the Free Press, Makary and an FDA co-author referred specifically to benefits of higher protein intakes for weight loss. “Eating more protein in line with these recommendations consistently improves weight and body composition without harm,&#8221; they wrote.&nbsp;</p>\n\n\n\n<p>Layman and Leidy’s&nbsp;<a href=\"https://cdn.realfood.gov/Scientific%20Report%20Appendices.pdf#page=348\" rel=\"noreferrer noopener\" target=\"_blank\">review</a>, used to justify the new guidelines, concluded there was “moderate to strong” evidence that eating protein within the new recommended range promotes weight management.</p>\n\n\n\n<p>However,&nbsp;Gosliner said that the review relied on studies of people engaged in weight loss, which are not necessarily generalizable. “They are extrapolating that to the entire population, which doesn’t make sense,” she said.</p>\n\n\n\n<p>Layman countered that 75% of Americans are overweight or obese. “Should they basically be guidelines to keep people fat or to get people to ideal weight?” he said. He said that the weight loss studies included in his review in many cases included a maintenance period where people were not restricting calories.</p>\n\n\n\n<p>But just because many Americans could benefit from calorie restriction or strength training does not mean that most adults are engaging in these behaviors, other experts said.</p>\n\n\n\n<p>A higher protein diet while people are “purposefully energy restricting their diets to lose weight” may help people maintain lean tissue and muscle, Campbell explained. But protein is “not going to be a magical solution for you to actually permanently keep any weight off.”</p>\n\n\n\n<p>“Protein without resistance exercise, during weight loss, does very little,” Phillips&nbsp;<a href=\"https://theconversation.com/2025-was-the-year-protein-jumped-the-shark-272614\" rel=\"noreferrer noopener\" target=\"_blank\">wrote</a>&nbsp;in a Jan. 6 article on protein hype published in the Conversation. “Exercise is the major driver that helps lean mass retention. Protein is the supporting material.”</p>\n\n\n\n<p>Phillips also pointed out that older adults, who can benefit from higher protein intake, make up an increasing share of the population. Protein is &#8220;important,&#8221; he said, &#8220;but it is not a stand-alone solution to metabolic health, childhood development, or healthy aging.”</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\"><strong>Overall Diet Also Matters</strong></h2>\n\n\n\n<p>The impact of the new dietary guidelines will depend on how people interpret them, some experts said.</p>\n\n\n\n<p>Phillips&nbsp;<a href=\"https://theconversation.com/2025-was-the-year-protein-jumped-the-shark-272614\" rel=\"noreferrer noopener\" target=\"_blank\">wrote</a>&nbsp;in his Conversation article that 2025 was the year protein “jumped the shark,” explaining a cultural context where it has been “oversold, overvalued and overhyped.” One concern, he told us, is that people will think they are doing “something good for their health&#8221; simply by increasing their protein intake, even if they are already consuming a relatively high amount.</p>\n\n\n\n<p>If people eat “substantially” more protein, it could increase the risk of chronic disease, Hu said, explaining that consuming too much protein — and particularly animal protein — is associated with increased risk of chronic disease. “It depends on what comes together with the protein,” he said. For example, he said, people who consume more animal protein also consume more saturated fat, cholesterol and &#8220;other unhealthy components.&#8221;</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full\"><img alt=\"\" class=\"wp-image-280018\" height=\"267\" src=\"https://cdn.factcheck.org/UploadedFiles/Protein-400-x-267.png\" width=\"400\" /><figcaption class=\"wp-element-caption\">A sign advertises protein cold foam at a Starbucks in October 2025. Photo by Smith Collection/Gado/Getty Images</figcaption></figure></div>\n\n\n<p>“At the end of the day you are eating foods for multiple compounds and nutrients, not just protein,” Campbell said.</p>\n\n\n\n<p>The guidelines themselves <a href=\"https://cdn.realfood.gov/DGA.pdf#page=3\" rel=\"noreferrer noopener\" target=\"_blank\">encourage</a> eating a “variety” of protein foods from animal and plant sources, but the new <a href=\"https://cdn.realfood.gov/DGA.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">food pyramid</a> prominently features a large steak in the upper left-hand corner, with nuts and legumes further down.</p>\n\n\n\n<p>The original committee <a href=\"https://www.statnews.com/2026/01/17/new-food-pyramid-behind-the-scenes-dietary-guideline-development/\" rel=\"noreferrer noopener\" target=\"_blank\">tasked</a> under the Biden administration with the scientific review for the dietary guidelines&nbsp;<a href=\"https://www.dietaryguidelines.gov/sites/default/files/2024-12/Part%20E.%20Chapter%201_Overarching%20Advice_FINAL_508.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">recommended</a>&nbsp;an emphasis on consuming more peas, beans and lentils and less red and processed meat. The new dietary guidelines&nbsp;<a href=\"https://cdn.realfood.gov/Scientific%20Report.pdf#page=4\" rel=\"noreferrer noopener\" target=\"_blank\">rejected</a>&nbsp;this advice, with the exception of recommending&nbsp;<a href=\"https://cdn.realfood.gov/DGA.pdf#page=3\" rel=\"noreferrer noopener\" target=\"_blank\">against</a>&nbsp;processed meat.</p>\n\n\n\n<p>If someone replaced refined carbohydrates and sugar in their diet with plant protein, lean protein and eggs, that would be “reasonable,” Hu said. But people who consume a large quantity of animal protein tend to eat significantly less nutrient-dense plant protein sources, he said.</p>\n\n\n\n<p>Further, Hu said, supermarkets are now stocked with numerous highly processed protein products.&nbsp;</p>\n\n\n\n<p>The new guidelines discourage eating highly processed foods. But Gosliner reiterated that people often do not follow dietary advice. “There’s no reason to think now that if protein is all the rage and people are saying, ‘Eat more protein,’ that you&#8217;re not going to start seeing ice cream with protein powder and cookies with protein powder.”&nbsp;</p>\n\n\n\n<p>When asked about the risk of the new guidance feeding into the current trend for promoting highly processed foods as sources of protein, Layman replied, “I think you need to step back and look at the guidelines. What&#8217;s the opening words? Eat real food.”</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><em>Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through <a href=\"https://giving.aws.cloud.upenn.edu/?fastStart=simpleForm&amp;program=ANS&amp;fund=602014\" rel=\"noreferrer noopener\" target=\"_blank\">our “Donate” page</a>. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, P.O. Box 58100, Philadelphia, PA 19102. </em></p>\n<p>The post <a href=\"https://www.factcheck.org/2026/02/americans-dont-need-dramatically-more-protein-despite-officials-claims/\">Americans Don&#8217;t Need &#8216;Dramatically&#8217; More Protein, Despite Officials’ Claims</a> appeared first on <a href=\"https://www.factcheck.org\">FactCheck.org</a>.</p>",
    "url": "https://www.factcheck.org/2026/02/americans-dont-need-dramatically-more-protein-despite-officials-claims/",
    "publication_date": "Tue, 03 Feb 2026 21:30:56 +0000",
    "date_gathered": "2026-02-24T04:09:44.214285",
    "country": "US",
    "organization": "FactCheck"
  }
]