[
  {
    "title": "Donald Trump - Is President Donald Trump right that drugs entering the US by sea have dropped by 97%?",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-false/b66409be4b4b0cf7a7054c1f752359b2.jpg\" /><p>President Donald Trump has cited dramatic results from U.S. strikes on vessels in the Caribbean Sea and Pacific Ocean, saying they’ve nearly stopped the flow of drugs trafficked to the U.S. by water.</p>\n<p>Since September 2025, the U.S. has <a href=\"https://www.wola.org/2025/11/us-military-strikes-trump-drugs-caribbean/\" target=\"_blank\">struck</a> at least 40 alleged drug vessels, killing 149 people.</p>\n<p>\"With our action in the Gulf of America, that sounds so nice when I hear the Gulf of America, drugs entering our country by sea are down 97%,\" Trump said at a Jan. 29 <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-drug-addiction-prevention-white-house-january-29-2026/#22\" target=\"_blank\">White House</a> event. \"So when you see the boats being hit, those boats kill on average 25,000 people a boat.\" We’ve rated the statement about 25,000 deaths <a href=\"https://www.politifact.com/factchecks/2025/oct/16/donald-trump/US-military-drug-boat-strike-Venezuela-save-25000/\">Pants on Fire.</a> </p>\n<p>Even though Trump mentioned the Gulf of America, his comments appeared to reference the Caribbean and Pacific strikes.</p>\n<p>When asked for evidence about the 97% claim, the White House pointed us to Customs and Border Protection statistics from July 2025 to November 2025. Those numbers show a 98% drop in the pounds of drugs seized by <a href=\"https://www.cbp.gov/newsroom/stats/cbp-enforcement-statistics/air-and-marine-operations-statistics\" target=\"_blank\">CBP air and marine operations</a>. </p>\n<p>But drug seizures tell us only how many drugs are <a href=\"https://www.politifact.com/article/2023/mar/20/ask-politifact-what-do-higher-fentanyl-seizures-us/\">stopped from entering</a> the U.S. There isn’t data to show how many drugs are being sent to the U.S. or how many are making it in. Drug experts also say changes in drug seizure data aren’t sufficient to make definitive statements about policy outcomes.</p>\n<p>\"No one knows how much doesn't get caught, so no one can cite a precise percentage change,\" Jonathan Caulkins, a Carnegie Mellon University drug policy researcher, said. \"Trump is making a claim about something that is unknowable.\"</p>\n<p>The White House didn’t explain why it chose those months. There has been a drop in CBP drug seizures since September 2025 when the vessel strikes began, but the percentage drop fluctuates depending on the months compared.</p>\n<p>Additionally, the Coast Guard — not CBP — oversees most drug seizures on water, especially in international waters, an agency spokesperson <a href=\"https://www.politifact.com/article/2026/jan/21/live-fact-check-trump-davos-speech/\">told PolitiFact</a>. Its data shows a spike in annual cocaine seizures — 200% in fiscal year 2025 compared with its yearly average. (The Coast Guard generally focuses on cocaine seizures, while CBP’s 98% decline is mainly related to marijuana.) </p>\n<p>While the White House cites a drop in CBP drug seizures as a success, the Coast Guard cites an increase in seizures as a sign of strong enforcement.</p>\n<p><img src=\"https://static.politifact.com/politifact/photos/AP26023846053153.jpg\" /></p>\n<p><em>This image from video provided by U.S. South Command, shows a vessel accused of trafficking drugs in the eastern Pacific Ocean shortly before it was destroyed by the U.S. military, killing two and injuring one, Jan. 23, 2026. (U.S. Southern Command via AP)</em></p>\n<h2>An uncharacteristically high month for marijuana seizures inflates percent drop</h2>\n<p>The White House’s calculation starts in July 2025, which was an outlier with an uncharacteristically high number of marijuana seizures. In July, CBP seized 224,000 pounds of drugs, including 203,000 pounds of marijuana. CBP seizes about 20,000 pounds of all types of drugs in a month.</p>\n<p>From August 2025, the last month before the vessel strikes began, to January, the latest available data, CBP drug seizures dropped 79%.</p>\n<p>For the Coast Guard, drug seizures are up.</p>\n<p>In the 2025 fiscal year which ended in September, the Coast Guard <a href=\"https://www.news.uscg.mil/Press-Releases/Article/4328665/coast-guard-sets-historic-record-with-amount-of-cocaine-seized-in-fy25/\" target=\"_blank\">seized</a> 510,000 pounds of cocaine, a 200% increase from a typical fiscal year when the Coast Guard seizes about 167,000 pounds of cocaine. </p>\n<p>In August 2025, the Coast Guard launched an operation to target cartels and criminal organizations. From August 2025 to February 2026, the Coast Guard <a href=\"https://www.news.uscg.mil/Press-Releases/Article/4398360/us-coast-guard-marks-200000-pounds-of-cocaine-seized-in-operation-pacific-viper/\" target=\"_blank\">seized</a> 200,000 pounds of cocaine more than it seizes in a typical year, according to agency press releases. </p>\n<p>The Coast Guard has <a href=\"https://www.news.uscg.mil/Press-Releases/Article/4398360/us-coast-guard-marks-200000-pounds-of-cocaine-seized-in-operation-pacific-viper/\" target=\"_blank\">hailed</a> the increase in seizures as a success in \"preventing the flow of dangerous drugs into American communities.\"</p>\n<h2>Statistics don’t show how many drugs make it into the US</h2>\n<p>Regardless of the data point, it’s unknown how many drugs enter the U.S. each year. Drug seizures show only how many pounds of a drug were stopped from getting into the U.S.</p>\n<p>\"It's a black market. And so by definition, we do not have good market data,\" Elizabeth Dickinson, deputy program director for Latin America and the Caribbean at the International Crisis Group, a nonprofit that researches global crises.</p>\n<p>The decrease in CBP seizures could point to less enforcement or fewer drugs moving on a specific route, Dickinson said. \"There's really not a good way to understand that data,\" she said.</p>\n<p>Dickinson said the Trump administration’s drug enforcement efforts, such as the vessel strikes, have \"scared some traffickers away from using specific routes.\" </p>\n<p>Rather than stop trafficking, they might have rerouted. </p>\n<p>\"Drug trafficking is a very old and mature business, in many ways, these organizations have been in a cat and mouse game with law enforcement, not just for years, but really for decades,\" Dickinson said. They \"are expert at reconfiguring routes, finding new ways to ship things, and innovating in a way to avoid enforcement.\"</p>\n<h2>Our ruling</h2>\n<p>Trump said, after U.S. vessel strikes in the Caribbean Sea and Pacific Ocean, \"drugs entering our country by sea are down 97%.\"</p>\n<p>The administration hasn’t provided any evidence that the vessels it has struck were carrying drugs.</p>\n<p>There has been a drop in CBP drug seizures since the strikes began. But the Coast Guard — not CBP — oversees most drug seizures on water, especially in international waters. And that agency has seen a steep increase in drug seizures.</p>\n<p>The White House cites a drop in CBP drug seizures as a success at the same time the Coast Guard cites an increase in drug interdictions as a success, too. </p>\n<p>However, neither an increase nor a decrease in drug seizures shows how many drugs are entering the U.S. That number is unknowable, according to drug experts. Drug seizures tell us only how many drugs are stopped from entering the U.S.</p>\n<p>Trump’s statement is unsubstantiated. We rate it False.</p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/23/donald-trump/drug-water-down-97-percent-cocaine-seizures-sea/",
    "publication_date": "Mon, 23 Feb 2026 21:22:04 +0000",
    "date_gathered": "2026-02-24T04:09:44.406141",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Social Media - This isn’t a real image of Puerto Vallarta on fire after the killing of a cartel leader; it’s AI",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-false/b66409be4b4b0cf7a7054c1f752359b2.jpg\" /><p>The Mexican military killed Nemesio \"El Mencho\" Oseguera Cervantes, Mexico’s <a href=\"https://www.state.gov/nemesio-ruben-oseguera-cervantes-el-mencho-2\" target=\"_blank\">most wanted</a> cartel boss, during an <a href=\"https://www.gob.mx/defensa/prensa/la-secretaria-de-la-defensa-nacional-informa-sobre-una-operacion-para-la-detencion-de-ruben-n-a-mencho?idiom=es\" target=\"_blank\">operation</a> aided by U.S. intelligence information in Tapalpa, a town within the Mexican state of Jalisco.  </p>\n<p><a href=\"https://www.cnn.com/world/live-news/mexico-el-mencho-killed-travel-chaos-02-23-26-intl-hnk?t=1771862650020\" target=\"_blank\">Violence spread</a> after Oseguera Cervantes’ Feb. 22 killing, with suspected gang members torching buses and businesses while clashing with the authorities in multiple Mexican cities, including Puerto Vallarta in Jalisco. </p>\n<p>Images of Puerto Vallarta in flames have <a href=\"https://www.businessinsider.com/photos-show-puerto-vallarta-mexico-chaos-after-cartel-leader-killed-2026-2\" target=\"_blank\">been</a> <a href=\"https://komonews.com/news/local/washington-state-residents-in-puerto-vallarta-shelter-in-place-lockdown-cartel-violence-alaska-airlines-flight-cancellations-delays-seatac-airport-seattle\" target=\"_blank\">widely</a> <a href=\"https://abc7news.com/post/el-mencho-bay-area-residents-stuck-puerto-vallarta-mexico-amid-unrest-killing-powerful-drug-lord/18637358/\" target=\"_blank\">reported</a>, but one photo shared online is not real. </p>\n<p>A Feb. 22<a href=\"https://mvau.lt/media/327d9285-c4d9-4a01-94c0-c24220bbeb30\" target=\"_blank\"> TikTok post</a> said it shows an image of Puerto Vallarta with scattered buildings on fire.</p>\n<p>\"This is not a scene from a movie, this is the city of Puerto Vallarta, Jalisco in Mexico. Look at all these fires going around the city,\" says the man in the TikTok video. \"Well, what’s happening is they’re saying that they took down the leader of El Cartel de Jalisco Nueva Generación, AKA El Mencho… and all his people are going around all the city and just burning cars, shooting random people, fighting against the police.\"</p>\n<p><a href=\"https://mvau.lt/media/0b7e4cd9-d2f9-40cc-bb56-59c7559e7573\" target=\"_blank\">Instagram</a> <a href=\"https://mvau.lt/media/25426e99-09da-4c2b-8872-95e4fd51d9eb\" target=\"_blank\">and</a> <a href=\"https://mvau.lt/media/e7528e5e-778e-4cd2-8200-fa9917a9920a\" target=\"_blank\">X users</a> also shared the same image with English and Spanish captions claiming to show the unrest in Puerto Vallarta.</p>\n<div class=\"artembed\"><img src=\"https://static.politifact.com/politifact/photos/ai_puerto_vallarta.002.jpeg\" /></div>\n<p><em>(Screenshot of the Instagram post.)</em></p>\n<p>But that was generated with artificial intelligence. </p>\n<p>The image shows the logo of Gemini, Google’s AI chatbot, at the bottom right corner. </p>\n<p>PolitiFact uploaded the image to Gemini and it confirmed the image was generated using its generative AI program. </p>\n<p>Visual inconsistencies signal the image is fake. Some of the cars on the streets are indistinguishable, while others look on top of each other. Some of the buildings look distorted and the smoke and the fire have unusual patterns. For example, the fire is bright orange and it sits on top of the buildings without consuming the structure, and the smoke seems to be going up in the same direction without being disrupted by the wind. </p>\n<div class=\"artembed\"><img src=\"https://static.politifact.com/politifact/photos/ai_puerto_vallarta.001.jpeg\" /></div>\n<p><em>(Screenshot of AI-generated image highlighting with red circles visual inconsistencies. At the bottom right is the Google Gemini logo.)</em></p>\n<p>This image doesn’t show Puerto Vallarta after the killing of Oseguera Cervantes. We rate this claim False. </p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/23/social-media/El-Mencho-Mexico-cartel-Puerto-Vallarta-AI/",
    "publication_date": "Mon, 23 Feb 2026 20:55:21 +0000",
    "date_gathered": "2026-02-24T04:09:44.406152",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Robert F. Kennedy Jr. - This chronic illness statistic touted by RFK Jr. and RealFood.gov doesn’t check out",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-false/b66409be4b4b0cf7a7054c1f752359b2.jpg\" /><p>Have you seen the Mike Tyson ad telling people to eat \"real food?\" The black-and-white spot that debuted during the Super Bowl is the latest promotion for the federal government’s new dietary guidelines. </p>\n<p>With a quick scroll, football watchers who visited the <a href=\"https://realfood.gov/\" target=\"_blank\">website</a> in the ad would have encountered the statistic that \"90% of U.S. healthcare spending goes to treating chronic disease — much of which is linked to diet and lifestyle.\" </p>\n<p>This statistic also appeared in the dietary <a href=\"https://cdn.realfood.gov/DGA.pdf\" target=\"_blank\">guidelines</a> and on the <a href=\"https://www.cdc.gov/chronic-disease/data-research/facts-stats/index.html\" target=\"_blank\">CDC’s website</a>. Health and Human Services Secretary Robert F. Kennedy Jr. said it this way in his <a href=\"https://www.youtube.com/live/pqzh65k7ekw?si=G8Sgcyjls_7-PSi8&amp;t=628\" target=\"_blank\">Jan. 7 announcement</a>: \"The CDC reports that 90% of healthcare spending treats chronic disease.\" </p>\n<p>This number grabbed podcaster Michael Hobbes’ attention. \"I couldn't find anyone fact-checking this number,\" Hobbes said on the Jan. 30 episode of \"Maintenance Phase,\" a podcast that digs into the science behind health and wellness trends.<br />\n<br />\nNo worries — PolitiFact is here to answer the call! </p>\n<p>The 90% figure has roots in a <a href=\"https://www.rand.org/content/dam/rand/pubs/tools/TL200/TL221/RAND_TL221.pdf\" target=\"_blank\">2017 report</a> by the Rand Corp., a nonpartisan research organization. But one of the researchers told PolitiFact that the claim, as stated by Kennedy and <a href=\"http://realfood.gov\" target=\"_blank\">RealFood.gov</a>, didn’t accurately reflect their findings. </p>\n<p>The Rand report calculated all health spending on people with chronic illnesses, which includes a majority of Americans. It did not isolate the total spending on treating chronic illness itself.</p>\n<p>Here’s another way to think about it: If someone with asthma broke a leg, got glasses or picked up antibiotics, that all counted as spending on a person with a chronic disease — even if it’s not treating the asthma. </p>\n<p>The department did not respond to our request for comment. HHS relayed the research more accurately in the <a href=\"https://cdn.realfood.gov/DGA.pdf\" target=\"_blank\">dietary guidelines document</a> and <a href=\"https://www.cdc.gov/chronic-disease/data-research/facts-stats/index.html\" target=\"_blank\">CDC website</a>. </p>\n<h2>What the report really said</h2>\n<p>A trail of footnotes in the dietary <a href=\"https://cdn.realfood.gov/DGA.pdf\" target=\"_blank\">guidelines</a> leads to the 2017 <a href=\"https://www.rand.org/content/dam/rand/pubs/tools/TL200/TL221/RAND_TL221.pdf\" target=\"_blank\">Rand report</a>.</p>\n<p>Rand used data from an annual government-run survey. The Medical Expenditure Panel Survey asks families to report a year’s worth of <a href=\"https://meps.ahrq.gov/mepsweb/about_meps/survey_back.jsp\" target=\"_blank\">personal health care use and spending</a> — including doctor’s visits, prescriptions and hospital stays. It also collects data on people’s health conditions, which can be categorized as chronic or not chronic.</p>\n<p>The sample size has varied over the years, ranging from about <a href=\"https://meps.ahrq.gov/survey_comp/hc_sample_size.jsp\" target=\"_blank\">18,000 to 37,000 people</a>. Experts said it is among the best data sources on personal health spending. </p>\n<p>The report defines a <a href=\"https://hcup-us.ahrq.gov/toolssoftware/chronic/chronic.jsp\" target=\"_blank\">chronic condition</a> as a mental or physical health condition lasting over a year that either requires functional restrictions or ongoing medical treatment. Many conditions fall into this category, including hypertension, diabetes, depression, anxiety, osteoarthritis, asthma, heart disease, high cholesterol, and cancer. </p>\n<p>Using survey data collected in 2014, Rand researchers estimated almost 60% of Americans had at least one chronic condition. </p>\n<p>Then they looked at people’s health care costs, including payments made by insurers and out-of-pocket costs. </p>\n<p>According to Rand, spending on the 60% of people with one or more chronic conditions made up 90% of all spending. The 40% with no chronic illnesses made up 10% of the spending. </p>\n<p>\"A person in a year spends or incurs health care costs for multiple related things,\" said Christine Buttorff, a Rand health policy researcher and study co-author. \"It could be their chronic disease, but it also could be something as simple as an acute illness where they had to go to the doctor or go to the emergency room for something totally unrelated to the chronic disease. So our estimates lump all of that together.\" </p>\n<p>The claim that 90% of U.S. health care spending goes to treating chronic disease is \"not an accurate reflection of our report,\" Buttorff said. </p>\n<h2>Limited data on chronic illness treatment spending</h2>\n<p>Estimating how much Americans spend on treating chronic illness is harder. It typically requires using insurance claims data, which is spread across government databases and private insurers. </p>\n<p>It can be difficult to link expenses and conditions. If, for example, a person with asthma is hospitalized with pneumonia, is that part of their chronic disease treatment or an acute case? If a person pays to see a psychiatrist but has both anxiety and depression, which diagnosis is that cost linked to? </p>\n<p>University of Washington researchers have been tackling this question. The university’s Institute for Health Metrics and Evaluation in <a href=\"https://jamanetwork.com/journals/jama/fullarticle/2830568?guestAccessKey=783582d7-4e27-4a8c-8b5a-ecebb4c21894&amp;utm_source=For_The_Media&amp;utm_medium=referral&amp;utm_campaign=ftm_links&amp;utm_content=tfl&amp;utm_term=021425\" target=\"_blank\">2025</a> analyzed personal health care spending from 2010 to 2019 on 148 health conditions, without distinguishing chronic illnesses from other ailments. </p>\n<p>In 2019, the top three most expensive conditions were Type 2 diabetes ($143.9 billion), musculoskeletal disorders such as joint pain and osteoporosis ($108.6 billion), and oral disorders such as cavities and orthodontia ($93 billion). </p>\n<p>\"Reality is, we spend a ton of money on things that people don't associate with chronic diseases,\" said Joseph L. Dieleman, a University of Washington health metrics sciences professor and study co-author.</p>\n<p>PolitiFact did not find any studies <a href=\"https://milkeninstitute.org/sites/default/files/reports-pdf/ChronicDiseases-HighRes-FINAL_2.pdf\" target=\"_blank\">since 2018</a> that looked specifically at past chronic disease treatment spending. </p>\n<p>One recent report tried to model future spending on chronic disease. A 2025 report from GlobalData and the Partnership to Fight Chronic Disease estimated an average of <a href=\"https://www.fightchronicdisease.org/post/new-report-chronic-disease-could-cost-the-u-s-47-trillion-over-next-15-years\" target=\"_blank\">$2.2 trillion</a> annually in medical costs over the next 15 years. </p>\n<p>Given that current health care spending is over <a href=\"https://www.cms.gov/data-research/statistics-trends-and-reports/national-health-expenditure-data/historical\" target=\"_blank\">$5.3 trillion</a> annually, that rate of spending would put chronic disease spending around 42% annually. </p>\n<h2>Rising chronic illness burden is not all related to diet and lifestyle</h2>\n<p>U.S. chronic illness rates are rising.</p>\n<p>In 2010, about <a href=\"https://www.researchgate.net/publication/265376294_Multiple_Chronic_Conditions_Chartbook_2010_MEPS_Data\" target=\"_blank\">50% of Americans</a> had at least one chronic condition. The number has <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC12007472/\" target=\"_blank\">climbed </a>closer to 75% in <a href=\"https://meps.ahrq.gov/data_files/publications/rf52/rf52.pdf\" target=\"_blank\">recent</a> years, boosted in part by better diagnostics and longer lifespans. </p>\n<p>\"Chronic conditions linked to lifestyle choices such as physical inactivity or diet are a huge issue in the U.S., even if their use of this statistic isn’t quite right,\" Buttorff said. </p>\n<p>Several of the most common chronic conditions — hypertension, Type 2 diabetes, heart disease, and high cholesterol — have <a href=\"https://www.cdc.gov/diabetes/risk-factors/index.html\" target=\"_blank\">been</a> <a href=\"https://www.cdc.gov/high-blood-pressure/risk-factors/index.html\" target=\"_blank\">linked</a> to <a href=\"https://www.cdc.gov/cholesterol/risk-factors/index.html\" target=\"_blank\">diet</a> and <a href=\"https://www.cdc.gov/heart-disease/risk-factors/index.html\" target=\"_blank\">lifestyle</a> related risk factors. </p>\n<p>Others can’t always be linked to lifestyle, including mental health conditions, asthma, Type 1 diabetes, cancer, rheumatoid arthritis, Alzheimer's disease, and dementia.</p>\n<h2>Our ruling</h2>\n<p>Kennedy and his department said that 90% of health care spending is for treating chronic disease.</p>\n<p>The statistic is based on all health spending on people with chronic diseases, not spending on treatment itself. </p>\n<p>A majority of Americans have chronic illnesses, so it’s likely the real number is high. We were unable to find a reliable report that isolated chronic illness spending in the past few years, but a predictive report estimated it could be around 2.2 trillion annually, which would be less than half of current health spending. HHS did not provide evidence to support the claim about treatment spending. </p>\n<p>We rate this statement False. </p>\n<p><em>Staff Researcher Caryn Baird contributed to this report</em></p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/19/robert-f-kennedy-jr/chronic-disease-90-percent-health-spending-rfk/",
    "publication_date": "Thu, 19 Feb 2026 21:34:38 +0000",
    "date_gathered": "2026-02-24T04:09:44.406158",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Bruce Blakeman - Comparing tax burdens, New York at (or near) the top of the list",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-mostly-true/b89e6c69bebfa0e3868d4cdccbafe965.jpg\" /><p>In a line of attack that Empire State Republicans have deployed over many election cycles, Nassau County Executive Bruce Blakeman has focused on New York’s tax climate as he mounts a campaign to unseat Gov. Kathy Hochul.</p>\n<p>The Long Island Republican said <a href=\"https://www.instagram.com/p/DTf7JYdD_wI/?img_index=1\" target=\"_blank\">New York ranks No. 1 </a>in the nation for highest individual tax burden.</p>\n<p>Given the state’s notorious tax reputation, we were curious if it indeed has the highest tax burden in the country. </p>\n<p>There are several ways to measure a tax burden, and different analyses result in different rankings. Some rankings include property and sales taxes. Some just one or the other. </p>\n<p>We started with the Tax Foundation, which completes extensive studies of tax policies in every state. The last study of state and local tax burden was from 2022, and New York was <a href=\"https://taxfoundation.org/data/all/state/tax-burden-by-state-2022/\" target=\"_blank\">at the top of the list</a>, with an effective tax rate of 15.9%. The conservative-leaning think tank defined \"tax burden\" as state and local taxes paid by residents divided by that state’s share of net national product. This study took into account tax incidence, which measures which entity pays a tax, both under the law and in the economy. </p>\n<p>Though this data is older, this analysis \"comes closest to answering the question of which state actually has the highest burdens on residents, and on that, New York is unequivocally highest,\" said Jared Walczak, senior fellow at the Tax Foundation. </p>\n<p>The think tank also measured how much state and local governments <a href=\"https://taxfoundation.org/data/all/state/state-local-tax-collections-per-capita/\" target=\"_blank\">collect per person</a> in every state, and it published its findings in 2025. The nationwide average of state and local tax burden per capita was $7,109, according to U.S. Census data from 2022. In the Tax Foundation’s study, the District of Columbia was the costliest place to live when it comes to local taxes, collecting $14,974. But New York was the costliest state, with the highest combined state and local per capita tax burden at $12,685. California came in second. </p>\n<p>Another study from the Tax Foundation found that when tax collections are calculated as a percentage of personal income, New Mexico came in at the top, and New York placed second.  </p>\n<p>When individual income taxes are taken into account, New York ranks second behind Oregon. It’s worth noting the Beaver State has no sales tax. </p>\n<p>\"There isn’t just one single way to define state tax burdens,\" Walczak said. \"But by a measure that accounts for tax incidence, New York has the highest tax burdens - and by any conceivable measure, it’s at or near the top,\" he said.  </p>\n<p>WalletHub, a personal finance company, found that <a href=\"https://wallethub.com/edu/states-with-highest-lowest-tax-burden/20494\" target=\"_blank\">New York has the second-highest tax burden </a>in the country in a study it published in April. The site looked at the proportion of total personal income that people pay in state and local taxes, including personal income, sales, excise and property taxes.   </p>\n<p>New York’s overall tax burden as a share of personal income was 13.56%, while Hawaii had the highest, at 13.92%. Considering only personal income taxes, New York is first, at 5.76%. Counting only property taxes, Vermont ranks first for that burden, with New York fourth. The total sales and excise tax burden rankings has New York at No. 22.  </p>\n<p>New York has the highest tax burden when the state and local personal income tax revenues are divided by the personal income of all the people living in that state, based on U.S. Census data from 2022, said Aravind Boddupalli, a senior research associate at the Urban-Brookings Tax Policy Center. </p>\n<p>But these rankings miss the fact that there are high-income earners in New York, and that New York has a relatively progressive income tax structure, meaning that people who earn more pay more in income taxes. The metrics don’t measure fairness, he said. </p>\n<p>\"There are a lot more people with a lot more resources in New York, and the tax burden metric measures revenue raising, not necessarily who pays how much,\" he said. </p>\n<p>After Blakeman made his claim, the Citizens Budget Commission, a centrist New York-based think tank, found that state and local governments in <a href=\"https://cbcny.org/research/top-charts-3\" target=\"_blank\">New York collect the highest taxes per person</a> and the second highest per $1,000 of personal income, based on 2023 data. </p>\n<p>In 2018, when Republican Marc Molinaro ran for governor, he claimed that New York had \"among the highest tax burdens of any state in the nation,\" and PolitiFact <a href=\"https://www.politifact.com/factchecks/2018/apr/12/marcus-molinaro/do-ny-residents-have-among-highest-tax-burdens-mol/\">rated it True</a>. </p>\n<p>We reached out to Blakeman’s spokesperson but did not hear back. The state Republican Party responded, saying that it uses the Tax Foundation <a href=\"https://taxfoundation.org/statetaxindex/\" target=\"_blank\">competitiveness index</a>, which in 2026 ranked New York the least competitive state. Individual taxes, for which New York ranks 50th, is part of that analysis. </p>\n<h2>Our ruling </h2>\n<p>Tax analysts have found that the tax burden in New York is at the top, or near the top, depending upon how you calculate tax burden. An expert said that one of the best analyses shows New York \"unequivocally highest,\" though the data is nearly four years old. A different study from nearly a year ago shows New York at second place in a contest no state wants to win. </p>\n<p>Blakeman’s statement is accurate, but needs some context, so we rate it Mostly True. </p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/17/bruce-blakeman/comparing-tax-burdens-new-york-at-or-near-the-top/",
    "publication_date": "Tue, 17 Feb 2026 03:29:09 +0000",
    "date_gathered": "2026-02-24T04:09:44.406162",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Social Media - Epstein files did not ‘expose’ Ellen DeGeneres as a cannibal; claim stems from AI-generated audio",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/tom_ruling_pof/78d86847d0cf8b94b2ec75a8046185dd.jpg\" /><p>After the Justice Department released millions of pages of documents linked to disgraced financier Jeffrey Epstein, social media users touted supposed revelations in the files and accused famous people of depraved acts.</p>\n<p>Former television host Ellen DeGeneres was one target.</p>\n<p>\"The Epstein files expose Ellen DeGeneres as Hollywood's ‘most prolific cannibal.’ She ate children's flesh,\" a <a href=\"https://x.com/Whiplash437/status/2022848111295557846\" target=\"_blank\">Feb. 14 X post</a> read. It had gained 12.5 million views as of late afternoon Feb. 16.</p>\n<p>It was the latest in a <a href=\"https://www.politifact.com/factchecks/2020/aug/07/viral-image/photo-shows-ellen-degeneres-and-her-niece-vacation/\">string</a> <a href=\"https://www.politifact.com/factchecks/2020/jun/18/facebook-posts/bogus-conspiracy-about-obama-others-wearing-house-/\">of</a> <a href=\"https://www.politifact.com/article/2020/jul/15/how-wayfair-child-sex-trafficking-conspiracy-theor/\">baseless claims</a> trying to connect DeGeneres to crimes involving children. PolitiFact found no files in the Justice Department’s <a href=\"https://www.justice.gov/epstein\" target=\"_blank\">Epstein Library</a> that show evidence DeGeneres took part in Epstein’s criminal activities or engaged in cannibalism. The library comes with caveats; text in some documents is not searchable.</p>\n<p>We traced this claim to The People’s Voice, a <a href=\"https://www.politifact.com/factchecks/2025/feb/28/facebook-posts/no-a-vaccine-campaign-did-not-cause-the-gaines-cou/\">frequent</a> <a href=\"https://www.politifact.com/factchecks/2024/dec/06/facebook-posts/claim-fox-news-commentator-kelly-powers-died-from/\">source</a> of misinformation. On Feb. 11, the People’s Voice released a <a href=\"https://x.com/tpvsean/status/2021667521590636669\" target=\"_blank\">video</a> and an <a href=\"https://thepeoplesvoice.tv/epstein-files-expose-ellen-degeneres-as-hollywoods-most-prolific-cannibal/\" target=\"_blank\">article</a> that cited an \"inside source.\" The video contained a supposed audio clip from a \"whistleblower\" who spoke about DeGeneres having a separate kitchen without cameras. The \"whistleblower\" also mentioned babies in refrigeration units.</p>\n<p>Four analysts told PolitiFact the audio was likely generated with artificial intelligence. V.S. Subrahmanian, a Northwestern University computer science professor, and Marco Postiglione, a postdoctoral researcher who works with Subrahmanian, analyzed the audio clip using 83 deepfake detection algorithms, 63 of which found that the audio clip is more likely to be fake than real. </p>\n<p>Other signs also showed the audio is likely AI-generated, including a lack of verbal stumbles — which are typical in usual conversation — and \"emotional breaks typical of genuine testimony,\" Subrahmanian and Postiglione found.</p>\n<p>The analysts also found the speech sounded like \"written prose\" and not like it was delivered spontaneously. For example, the voice described DeGeneres watching people eat her dumplings \"not hungrily, not nervously, but with that sociopathic calm.\"</p>\n<p>Hafiz Malik, University of Michigan – Dearborn electrical and computer engineering professor, also analyzed the clip and said it was AI-generated. He pointed to the flatness of the speaker’s voice, and a stationary noise throughout the audio. \"If you’re talking to somebody, noise does change, so you don’t see a fixed kind of pattern in noise in general,\" he said.</p>\n<p>The article from The People’s Voice cited no information from the Epstein files pointing to correspondences from, to or about DeGeneres.</p>\n<p>Searching \"Ellen DeGeneres\" in the Justice Department’s Epstein Library showed some news and feature story clippings mentioning her. We found no news reports detailing any connection between DeGeneres and Epstein.</p>\n<p>New York Magazine’s Intelligencer <a href=\"https://nymag.com/intelligencer/article/who-is-on-jeffrey-epstein-list-names-clients-associates-files-emails.html\" target=\"_blank\">compiled a list</a> of prominent people who have been linked to Epstein, using information from Epstein’s black book, flight logs and Justice Department files. DeGeneres is not on the list. </p>\n<p>The claim that the Epstein files prove DeGeneres was a cannibal is baseless. We rate that Pants on Fire!</p>\n<p><em>PolitiFact Researcher Caryn Baird contributed to this report.</em></p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/16/social-media/epstein-files-ellen-degeneres-cannibal/",
    "publication_date": "Mon, 16 Feb 2026 22:23:56 +0000",
    "date_gathered": "2026-02-24T04:09:44.406166",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "X posts - Savannah Guthrie’s husband, Michael Feldman, is not listed a ‘co-conspirator’ in the Epstein files",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-false/b66409be4b4b0cf7a7054c1f752359b2.jpg\" /><p>After Nancy Guthrie’s Feb.1 abduction from her Tucson, Arizona, home, her daughter \"Today\" host Savannah Guthrie <a href=\"https://www.instagram.com/reel/DUlnfdsEWAL/\" target=\"_blank\">put out a call</a> on social media for tips on her mother’s whereabouts, <a href=\"https://www.instagram.com/reels/DUzJ-_1AWWF/\" target=\"_blank\">pleading</a> for her safe return. </p>\n<p>So far, social media users have been less than helpful. With the Justice Department’s Jan. 30 <a href=\"https://www.pbs.org/newshour/show/whats-revealed-in-the-latest-epstein-files-release-and-whats-redacted\" target=\"_blank\">release</a> of more than 3 million pages of files related to Jeffrey Epstein, X users proposed bogus links between the abduction and the file release.</p>\n<p><a href=\"https://archive.is/veNOh\" target=\"_blank\">Multiple</a> <a href=\"https://archive.is/zqWHD\" target=\"_blank\">X</a> <a href=\"https://archive.is/MZxQE\" target=\"_blank\">posts</a> include a photo of Savannah Guthrie’s family and an accusation about her husband, Michael Feldman. </p>\n<p>\"Her husband’s company is listed as a co conspirator in the Epstein files… FGS Global,\" reads a Feb. 12 <a href=\"https://archive.is/zqWHD\" target=\"_blank\">X post</a> with over 1 million views. \"In case you're wondering why now of all times for Savannah Guthrie's mother to be 'kidnapped.'\"</p>\n<p>The co-anchor’s husband isn’t named in the Epstein files, and neither is his current company.</p>\n<p>Searching the <a href=\"https://www.justice.gov/epstein/search\" target=\"_blank\">digital Epstein files</a>, we found <a href=\"https://www.justice.gov/epstein/files/DataSet%2010/EFTA01942632.pdf\" target=\"_blank\">one 2013 email</a> to Epstein from a person named Michael Feldman, but it seems to be someone else, introducing himself as a \"theoretical physicist.\"</p>\n<p>Guthrie’s husband is a communications consultant who <a href=\"https://fgsglobal.com/people/michael-feldman\" target=\"_blank\">previously</a> worked in the Clinton administration as chief liaison to Congress and senior adviser for former Vice President Al Gore. Feldman currently works as North American co-chairman of FGS Global, an international public relations firm.</p>\n<p>We did not find FGS Global listed in Justice Department files, but another public affairs company that was merged to found FGS Global was listed. As a <a href=\"https://x.com/PaulGoldEagle/status/2022014410236301315\" target=\"_blank\">community note on one of the X posts</a> said, Feldman <a href=\"https://fgsglobal.com/people/michael-feldman\" target=\"_blank\">helped</a> found Glover Park Group in 2001, and its name appears twice in the Epstein files. The firm <a href=\"https://www.businesswire.com/news/home/20200707005391/en/Finsbury-The-Glover-Park-Group-and-Hering-Schuppener-to-Form-One-Global-Firm\" target=\"_blank\">merged</a> with other companies to <a href=\"https://www.telummedia.com/public/news/finsbury-glover-hering-and-sard-verbinnen-co-become-fgs-global/g5lrmj6x1p\" target=\"_blank\">form</a> FGS Global in 2021. </p>\n<p>PolitiFact reached out to FGS Global, but didn’t receive an immediate response.</p>\n<p>The first mention was in 2014. The office of Terje Rød-Larsen, a <a href=\"https://www.theguardian.com/world/2026/feb/09/two-senior-norwegian-diplomats-being-investigated-over-epstein-links\" target=\"_blank\">former diplomat and former president of the International Peace Institute</a>, shared a list of articles with Epstein, and <a href=\"https://english.ahram.org.eg/NewsContentP/4/98578/Opinion/The-Arabs-smitten-by-the-Israeli-lobby.aspx\" target=\"_blank\">one story</a> mentioned the Glover Park Group’s work lobbying for Egyptian interests. </p>\n<p>The second was in a 2015 email forwarded by Larry Summers, former U.S. Treasury secretary and former Harvard University president. Summers suggested that Epstein contact Joe Lockhart, who <a href=\"https://en.wikipedia.org/wiki/Joe_Lockhart\" target=\"_blank\">worked</a> at the Glover Park Group and served as press secretary during the Clinton administration, as well as other Democratic politicians. The initial email says Lockhart \"helped Clinton and Genera= (sic) Petraeus.\" (Former CIA director and retired U.S. Army Gen. David Petraeus <a href=\"https://www.tampabay.com/news/politics/email-to-tampa-woman-touched-off-petraeus-investigation-military-source/1261129/\" target=\"_blank\">had</a> an extramarital affair uncovered in 2012.)</p>\n<div class=\"artembed\"><img src=\"https://static.politifact.com/politifact/photos/Screenshot_2026-02-16_at_4.59.12_PM.png\" /></div>\n<p><em>(Screenshot of a Jan. 8, 2015, email exchange in the Epstein files)</em></p>\n<p>These mentions are not evidence that Feldman, FGS Global or Glover Park Group were \"co-conspirators\" with Epstein. </p>\n<p>Being mentioned in the files does not mean criminal wrongdoing. We <a href=\"https://www.politifact.com/article/2025/dec/17/fact-check-Jeffrey-Epstein-Trump-Clinton-files/\">reported</a> in 2025 that figures such as President Donald Trump and Clinton appear in the files, but that doesn’t mean they are guilty or charged with crimes. As of February 2026, Epstein and his coconspirator Ghislaine Maxwell are the only people who have <a href=\"https://www.justice.gov/usao-sdny/pr/ghislaine-maxwell-sentenced-20-years-prison-conspiring-jeffrey-epstein-sexually-abuse\" target=\"_blank\">been</a> <a href=\"https://www.politifact.com/article/2025/dec/17/fact-check-Jeffrey-Epstein-Trump-Clinton-files/\">convicted</a> in the scheme to sexually exploit and abuse multiple minor girls.</p>\n<p>Pima County Sheriff Chris Nanos <a href=\"https://x.com/PimaSheriff/status/2023500234454954354\" target=\"_blank\">said</a> Feb. 16 on X that the Guthrie family, including \"all siblings and spouses,\" had been cleared as possible suspects in the Nancy Guthrie case.</p>\n<p>We rate the X posts’ claims about Guthrie’s husband’s company False. </p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/16/tweets/epstein-files-nancy-guthrie-feldman/",
    "publication_date": "Mon, 16 Feb 2026 21:37:45 +0000",
    "date_gathered": "2026-02-24T04:09:44.406170",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Donald Trump - Trump credits immigration enforcement for Minneapolis crime drop. That’s wrong.",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-mostly-false/93a90f078e4ef95a7bfecb73c5e05997.jpg\" /><p>President Donald Trump said his immigration enforcement operation led to a crime drop in Minneapolis.</p>\n<p>In a pre-Super Bowl interview, NBC’s Tom Llamas <a href=\"https://www.nbcnews.com/politics/trump-administration/trump-interview-nbc-news-extend-transcript-tom-llamas-super-bowl-2026-rcna257410\" target=\"_blank\">asked Trump</a> about immigration enforcement weeks after agents fatally shot two Americans, Renee Good and Alex Pretti, in Minneapolis. </p>\n<p>\"The crime numbers in Minnesota, in Minneapolis in particular, are down 25, 30% because we’ve removed thousands of criminals from the area,\" Trump said. \"These are hardened criminals that came in, many of them — most of them came in through an open border.\"</p>\n<p>The Trump administration launched Operation Metro Surge in late 2025 in Minnesota with the stated goal of arresting people in the U.S. illegally.</p>\n<p>Federal immigration agents arrested more than<a href=\"https://www.whitehouse.gov/articles/2026/02/new-milestone-in-operation-metro-surge-4000-criminal-illegals-removed-from-minnesota-streets/#:~:text=New%20Milestone%20in%20Operation%20Metro,Protect%20Religious%20Liberty\" target=\"_blank\"> 4,000 immigrants</a> during the operation, the White House said Feb. 4. But it did not say how many of those arrests were in Minneapolis or how many of the people detained had criminal histories. Media reports show that some people arrested in the course of the operation, or <a href=\"https://www.mprnews.org/story/2026/01/21/ice-is-here-refugee-family-with-legal-status-unsettled-by-early-morning-arrest\" target=\"_blank\">another federal operation</a>, held legal status, were U.S. citizens or had pending asylum cases.</p>\n<p>Although some Minneapolis crime has recently declined in the short timeframe Trump highlighted, these numbers had already been coming down prior to the operation. There is no data credibly linking those declines to the federal immigration arrests. Other crime, meanwhile, has gone up in the period Trump described.</p>\n<p>White House border czar Tom Homan <a href=\"https://www.pbs.org/newshour/politics/watch-live-border-czar-tom-homan-holds-news-conference-in-minneapolis\" target=\"_blank\">said</a> the federal operation will wind down there over the next week.</p>\n<h2>White House cited Minneapolis data for about one month </h2>\n<p>Asked for data behind Trump’s claim, a White House spokesperson pointed to the <a href=\"https://www.minneapolismn.gov/government/government-data/datasource/crime-dashboard/\" target=\"_blank\">Minneapolis police crime dashboard</a> showing the number of homicides, burglaries and robberies during January and early February 2026 compared with 2025. </p>\n<p>Here’s what data from Jan. 1 through Feb. 4, the date of Trump’s interview, show:</p>\n<ul>\n<li>\n<p>134 burglaries in 2026, down from 219 in 2025, a decline of 39%</p>\n</li>\n<li>\n<p>71 robberies in 2026, down from 95, a decline of 25%. </p>\n</li>\n<li>\n<p>Two homicides in 2026, down from five, both numbers too small to be considered statistically significant. </p>\n</li>\n</ul>\n<p>However, the city homicide data the White House relied upon doesn’t capture the fatal shootings of two U.S. citizens by federal immigration agents. Homicide refers to the death of a person by another; it does not automatically mean that a crime occurred.</p>\n<p>The medical examiner ruled Good and Pretti’s killings were homicides, but the city’s dashboard reflects only deaths investigated by the police department. </p>\n<p>Although the decline in burglaries and robberies matched Trump’s percentages, some other offenses increased: assaults were up by 11% and motor vehicle theft by 26%.</p>\n<p>We asked the White House what evidence it has that the declines it cited are because of its immigration enforcement arrests. They provided no evidence.</p>\n<p>\"Removing dangerous criminals from the streets obviously means less crime is being committed,\" White House spokesperson Abigail Jackson said.</p>\n<p>Crime experts pointed to several problems with Trump’s statement:</p>\n<ul>\n<li>\n<p><strong>The short timeframe.</strong> Comparing about a month across two years is statistically meaningless, said James Densley, a criminology professor at Metropolitan State University in St. Paul. \"Crime is seasonal, lumpy, and volatile in small time frames. A single week of warm or cool weather, a gang conflict resolution, or even random variation can swing these numbers dramatically.\" </p>\n</li>\n<li>\n<p><strong>Crime was already dropping in Minneapolis.</strong> Violent crime peaked in 2021 and 2022 and has since fallen. That mirrors national trends, regardless of immigration enforcement. The <a href=\"https://www.startribune.com/minneapolis-crime-is-falling-in-2025-but-mass-shootings-and-ongoing-issues-fuel-fear/601484405\" target=\"_blank\">Minnesota Star Tribune</a> found in the fall of 2025 that robberies and burglaries were lower than in 2019, and that the tally of gunshot victims had also dropped. </p>\n</li>\n<li>\n<p><strong>No proof immigrants are the reason for the decline.</strong> For the federal arrests to drive the drops in burglary and robbery would require evidence that a substantial share of those crimes were committed by immigrants. The Trump administration has cited <a href=\"https://www.ice.gov/news/releases/ice-arrests-dozens-criminal-illegal-aliens-convicted-murder-child-rape-and-more\" target=\"_blank\">examples of people who had committed crimes</a>, but hasn’t provided details on all 4,000 people it arrested. That means we don’t know how many of those immigrants had criminal histories, and whether they were recent or had committed crimes such as robberies or burglaries. </p>\n</li>\n</ul>\n<p>There are <a href=\"https://www.mprnews.org/story/2026/01/17/ice-takes-credit-for-some-criminals-that-were-already-in-minnesota-prisons\" target=\"_blank\">reasons</a> to be <a href=\"https://www.kare11.com/article/news/local/worst-of-the-worst-website-draws-scrutiny/89-8ce64038-58ae-4944-82e4-6f99206bf9b0\" target=\"_blank\">skeptical</a> about the administration’s repeated characterization that the people they are arresting as part of the immigration crackdown represent  \"worst of the worst\" offenders. PolitiFact <a href=\"https://www.politifact.com/article/2025/dec/18/immigration-brothers-deportation-worst-of-worst/\">found in December</a> that nearly half of all immigrants in ICE detention have neither a criminal conviction nor pending criminal charges. Of the immigrants with criminal convictions, 5% have been convicted of violent crimes such as murder or rape, according to the <a href=\"https://www.cato.org/blog/5-ice-detainees-have-violent-convictions-73-no-convictions\" target=\"_blank\">Cato Institute</a>, a libertarian think tank.</p>\n<p>In Minnesota, the state Department of Corrections, which oversees the state prisons, <a href=\"https://www.politifact.com/article/2026/jan/30/Frey-Walz-Trump-ICE-Minnesota-jails-prison/\">said</a> that the federal government had spread misinformation about noncitizens. State officials didn’t find criminal history for some people named by Homeland Security while others had <a href=\"https://mn.gov/doc/about/news/news-releases/#/detail/appId/1/id/723104\" target=\"_blank\">misdemeanor convictions </a>or remained in prison. If someone was still behind bars in January, they could not have committed burglaries and robberies.</p>\n<p>Another problem with Trump’s statement is that federal immigration enforcement caused public safety threats in addition to the two U.S. citizens who were fatally shot. University of Minnesota sociologist Michelle Phelps said families of color have gone into hiding in response to the immigration enforcement, producing conditions that can create their own public safety issues. Such conditions include school absenteeism, rent insecurity and business instability.</p>\n<p>Some crime could have dropped because people stayed home to avoid federal agents. Criminologists have known for decades that visible, aggressive law enforcement suppresses crime in the short term, Densley said.</p>\n<p>\"Flood a neighborhood with federal agents and marked vehicles, and people alter their routines,\" he said. \"They stay inside. They avoid public spaces. Fewer people on the street means fewer opportunities for crime.\"</p>\n<p>The surge of enforcement likely reduced crime reporting by people in targeted communities, University of Minnesota sociology professor Chris Uggen said.</p>\n<h2>Minneapolis police continued focus on violent crime</h2>\n<p>PBS’ Margaret Hoover asked Minneapolis Police Chief Brian O’Hara if the city’s crime had decreased because of Trump.</p>\n<p>O’Hara, who criticized the federal operation, attributed the yearslong crime drop to partnerships with other law enforcement agencies, including federal, to pursue gang members committing gun crimes and carjackings, and working together with community groups.</p>\n<p>\"That’s something that was happening a few years ago. It's not something that happened or started happening a couple of weeks ago,\" O’Hara <a href=\"https://www.facebook.com/watch/?v=905204375444046\" target=\"_blank\">said</a>.</p>\n<p>The police department <a href=\"https://content.govdelivery.com/bulletins/gd/MPLS-405a366?wgt_ref=MPLS_WIDGET_714\" target=\"_blank\">said</a> Jan. 22 that during the federal immigration surge, local police made 849 arrests.</p>\n<p><em><strong>RELATED</strong></em>: <a href=\"https://www.politifact.com/factchecks/2026/feb/12/donald-trump/murder-crime-rate-lowest-125-years-FBI/\">Is Donald Trump right that the U.S. crime rate is at its lowest in 125 years?</a></p>\n<h2>Our ruling</h2>\n<p>Trump said crime in Minneapolis \"is down 25, 30% because we’ve removed thousands of criminals from the area.\"</p>\n<p>Some crimes in Minneapolis have declined, but their downward trend predated the immigration crackdown. Robberies and burglaries are down year to date in the ballpark Trump cited while assaults and motor vehicle thefts increased. The White House also said that homicides were down, omitting the fatal shootings of Pretti and Good by immigration officers.</p>\n<p>Trump is citing a very short time frame of about five weeks. And he provided no evidence that arresting immigrants is the reason for the crime drop. </p>\n<p>We rate this Mostly False.</p>\n<p><em>Staff writer Grace Abels contributed to this fact-check.</em></p>\n<p><em><strong>RELATED</strong></em>: <a href=\"https://www.politifact.com/immigration/\">All of our fact-checks about Minnesota and immigration</a></p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/13/donald-trump/Minneapolis-Minnesota-immigration-crime-drop/",
    "publication_date": "Fri, 13 Feb 2026 21:45:08 +0000",
    "date_gathered": "2026-02-24T04:09:44.406174",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Tom O&#x27;Mara - How much more do New Yorkers pay for electricity than the average US consumer?",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-mostly-true/b89e6c69bebfa0e3868d4cdccbafe965.jpg\" /><p>Amid steep national price increases for certain consumer items, New York Republican state Sen. Tom O’Mara criticized the high cost of living in his state.</p>\n<p>In a <a href=\"https://wellsvillesun.com/blog/2026/01/20/looking-at-the-nuts-and-bolts-of-where-nys-headed/\" target=\"_blank\">column</a> published in the Wellsville Sun on Jan. 20, O’Mara blamed Democrats in Albany for making New York \"an increasingly expensive state in which to live, work, raise a family, or run a business.\" </p>\n<p>Republicans in the legislature, including O’Mara, have <a href=\"https://www.news10.com/capitol/ny-gop-legislation-2026-sots/\" target=\"_blank\">launched</a> a \"Save New York\" campaign to tackle the cost of living, including electricity rates. </p>\n<p>O’Mara is backing a bill that would return $2 billion to $3 billion in unspent money to taxpayers. The money would come from the New York State Energy and Research Development Authority, which is tasked with promoting energy efficiency, renewable energy and emissions reduction.</p>\n<p>In the column, O’Mara said such efforts are important because \"New Yorkers pay 49% more than the national average for electricity.\" </p>\n<p>Federal data supports O’Mara’s statistic, though the percentage varies by the type of customer, and New York’s rates are lower than most New England states.</p>\n<h2>How much higher are electricity costs in New York state?</h2>\n<p>O’Mara — whose district includes portions of central New York state and the southern tier, including Corning and Elmira — responded to our inquiry with <a href=\"https://www.empirecenter.org/publications/empire-center-warns-of-sharp-increase-in-new-york-electricity-prices/\" target=\"_blank\">a post to an Empire Center for Public Policy article</a> warning about the rising prices of electricity in New York. </p>\n<p>According to the article, \"In October 2025, the average residential electricity price in New York hit 26.95 cents per kilowatt-hour — about 50 percent higher than the U.S. average and among the top ten highest rates nationwide.\"</p>\n<p>This aligns with slightly more recent data collected by the federal <a href=\"https://www.eia.gov/electricity/monthly/epm_table_grapher.php?t=epmt_5_6_a\" target=\"_blank\">Energy Information Administration</a>.</p>\n<p>In November 2025, the federal agency found, residential users in New York state paid average electricity prices of 26.49 cents per kilowatt hour in November 2025. The national rate that month was 17.78 cents per kilowatt hour, so New York state’s rate was exactly 49% higher than the national average.</p>\n<p>The premium paid by commercial users in New York state was similar to what residential users paid — 50% above the national average. </p>\n<p>Two other categories of users — industrial and transportation — were closer to the national average, but still above it. Industrial users, which include major plants with a dedicated electricity supply, paid 6% more than the national average, while transportation users, such as rail, paid 15% more.</p>\n<p>New York compared favorably with some of its regional neighbors. </p>\n<p>Among New England states, residential customers in Massachusetts paid 31.22 cents per kilowatt hour, Rhode Island residents paid 30.82, Maine residents paid 27.85, New Hampshire residents paid 27.37, and Connecticut residents paid 27.02 for residential.  The only New England state that was less expensive than New York was Vermont, where residential customers paid 24.17 cents per kilowatt hour.</p>\n<p>Two states in the mid-Atlantic region — New Jersey and Pennsylvania — had lower prices than New York, with 22.73 cents and 20.17 cents, respectively.</p>\n<p>Severin Borenstein, a University of California-Berkeley public policy and business administration professor, cautioned that the averages mask variations among people and locations.</p>\n<p>\"New York has many different utilities and rates, so some people pay even more than that differential and others pay less,\" Borenstein said.</p>\n<h2>Our ruling</h2>\n<p>O’Mara said, \"New Yorkers pay 49% more than the national average for electricity.\"</p>\n<p>Federal data from November 2025 shows that this is correct for residential and commercial users. Costs for industrial and transportation users were also above the national average, but not as dramatically.</p>\n<p>While O’Mara blamed New York’s Democrats for the high electricity prices, New York’s electricity costs are below those of most New England states, although they are higher than two mid-Atlantic states, New Jersey and Pennsylvania. </p>\n<p>The statement is accurate but needs additional information, so we rate it Mostly True.</p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/13/tom-omara/new-york-electricity-rates-utilities/",
    "publication_date": "Fri, 13 Feb 2026 15:31:57 +0000",
    "date_gathered": "2026-02-24T04:09:44.406178",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Claudia Tenney - Fact-checking Rep. Claudia Tenney on efforts to build Micron’s big semiconductor facility in NY",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-half-true/a70736af2900ee34890c1c7a83bfc1c8.jpg\" /><p>Republican Rep. Claudia Tenney, whose congressional district stretches across much of Central New York, recently took credit for helping push forward a major semiconductor factory in Clay, N.Y., north of Syracuse.</p>\n<p>\"It was exciting to break ground with <a href=\"https://x.com/MicronTech\" target=\"_blank\">@MicronTech</a> on its historic investment in New York State,\" Tenney <a href=\"https://x.com/RepTenney/status/2012350764925005861\" target=\"_blank\">posted on X</a> Jan. 16. \"This project will create 50,000 jobs and strengthen domestic semiconductor manufacturing across NY. I was honored to lead this effort in the House as Congress reaffirmed America’s commitment to long-term innovation &amp; competitiveness.\"</p>\n<div class=\"artembed\"><a></a><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">It was exciting to break ground with <a href=\"https://twitter.com/MicronTech?ref_src=twsrc%5Etfw\">@MicronTech</a> on its historic investment in New York State. <br /><br />This project will create 50,000 jobs and strengthen domestic semiconductor manufacturing across NY. <br /><br />I was honored to lead this effort in the House as Congress reaffirmed America’s… <a href=\"https://t.co/AbqF1VXCno\">pic.twitter.com/AbqF1VXCno</a></p>&mdash; Rep. Claudia Tenney (@RepTenney) <a href=\"https://twitter.com/RepTenney/status/2012350764925005861?ref_src=twsrc%5Etfw\">January 17, 2026</a></blockquote> </div>\n<p>Tenney touted her role in advancing the Micron plant, but her connection to the project is more complicated than her post acknowledged.</p>\n<p>Tenney’s office did not respond to inquiries for this article.</p>\n<h2>What is the Micron plant in Clay, N.Y.?</h2>\n<p>Micron, one of the United States’ largest producers of computer memory and data storage, is building a $100 billion \"megafab\" facility that will produce semiconductors, a key component of consumer and industrial electronics. </p>\n<p>Upon completion, it is poised to become the country’s largest such plant. According to Micron, the Clay facility will include 2.4 million square feet of clean room space, or the size of about 40 American football fields. The $100 billion in expenditures will be spread over at least 20 years.</p>\n<p>Micron and public officials have projected that the plant will create upwards of 50,000 jobs, potentially providing a major boost to central New York’s faltering economy. </p>\n<h2>What has Tenney’s role been?</h2>\n<p>Recently, Tenney has been a supporter of the plant. She was one of several high-ranking officials at the groundbreaking. Other attendees included Commerce Secretary Howard Lutnick, Rep. Nick Langworthy, R-N.Y., and New York Democratic Sen. Chuck Schumer and Gov. Kathy Hochul. </p>\n<p>In 2022, Tenney opposed a key piece of legislation that made the Micron plant possible: the CHIPS and Science Act, which was signed by then-President Joe Biden. The bill was designed to promote U.S. high-tech manufacturing through federal funding and incentives.</p>\n<p>On the eve of the bill’s signing, Micron <a href=\"https://www.micron.com/about/blog/company/innovations/ushering-in-a-new-era-for-semiconductor-manufacturing-in-us\" target=\"_blank\">wrote</a> in a news release that it was announcing $40 billion in manufacturing investment because the CHIPS and Science Act made it possible for the company to \"move toward this significant, long-term investment plan with confidence.\"</p>\n<p>When the CHIPS and Science Act was being debated in the House — and before Micron had chosen Clay as the location — Tenney explained her <a href=\"https://clerk.house.gov/Votes/2021239\" target=\"_blank\">opposition</a> by <a href=\"https://tenney.house.gov/media/press-releases/congresswoman-tenneys-statement-passage-chips-and-science-act\" target=\"_blank\">saying the bill</a> \"lacks critical guardrails and includes loopholes that in the long run could benefit China.\" She said that \"much of the supported research under this bill will be executed in partnership with universities, which we know are notoriously vulnerable to Chinese espionage.\"</p>\n<p>In December 2024, the U.S. Commerce Department <a href=\"https://www.reuters.com/technology/us-finalizes-more-than-61-bln-chips-subsidy-micron-technology-2024-12-10/\" target=\"_blank\">finalized</a> more than $6 billion in federal funds for Micron to assist in its New York and Idaho plants.</p>\n<p>Since the bill was signed into law and Micron announced the plant would be in New York, Tenney has become more supportive.</p>\n<p>In May 2025, Tenney and 20 bipartisan colleagues introduced the Building Advanced Semiconductor Investment Credit, or BASIC, Act, which <a href=\"https://cnycentral.com/news/local/rep-tenney-introduces-bill-that-would-increase-chips-act-tax-credit\" target=\"_blank\">builds on</a> provisions of the CHIPS and Science Act. The legislation would increase the advanced manufacturing investment credit from 25% to 35% and extend its availability through Dec. 31, 2030.</p>\n<p>This bill was enacted as part of Trump’s signature tax and spending law in 2025, the <a href=\"https://www.congress.gov/bill/119th-congress/house-bill/1/text\" target=\"_blank\">One Big Beautiful Bill Act</a>.</p>\n<p>Tenney’s shifting positions on the value of the CHIPS and Science Act led to a community note on her X post, which cited her vote against the bill.</p>\n<h2>Our ruling</h2>\n<p>Tenney said she has led the House effort to build a large Micron semiconductor facility near Syracuse.</p>\n<p>Her role has been more complicated than that. In 2022, Tenney voted against the CHIPS and Science Act, which eventually provided billions of dollars in federal support for the Micron plant. </p>\n<p>However, in 2025, she offered a bill that was enacted and signed by Trump that expanded and extended a key provision of the CHIPS and Science Act.</p>\n<p>The statement is partially accurate but leaves out important details, so we rate it Half True.</p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/13/claudia-tenney/chips-science-act-micron-semiconductor-new-york/",
    "publication_date": "Fri, 13 Feb 2026 14:04:13 +0000",
    "date_gathered": "2026-02-24T04:09:44.406182",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Donald Trump - Is Donald Trump right that the U.S. crime rate is at its lowest in 125 years?",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-half-true/a70736af2900ee34890c1c7a83bfc1c8.jpg\" /><p>President Donald Trump has been celebrating what he says is a major crime reduction achievement in the United States. </p>\n<p><a href=\"https://www.youtube.com/watch?v=rT6eucDVmFY\" target=\"_blank\">On</a> <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-interview-tom-llamas-nbc-news-february-4-2026/#44\" target=\"_blank\">at</a> <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-bill-signing-oval-office-february-3-2026/#114\" target=\"_blank\">least</a> <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-bill-signing-oval-office-february-2-2026/#129\" target=\"_blank\">10</a> <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-press-gaggle-mar-a-lago-february-1-2026/#15\" target=\"_blank\">occasions</a> <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-press-gaggle-air-force-one-january-31-2026/#45\" target=\"_blank\">from</a> <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-cabinet-meeting-january-29-2026/#5\" target=\"_blank\">Jan. 29</a> <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-executive-orders-january-30-2026/#16\" target=\"_blank\">to</a> <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-national-prayer-breakfast-capitol-february-5-2026/#37\" target=\"_blank\">Feb. 8</a>, Trump has <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-interview-dan-bongino-podcast-february-2-2026/#7\" target=\"_blank\">offered</a> a version of this statement: \"The crime rate now is the lowest it's been since 1900. That's 125 years.\" One of those occasions was during an NBC News <a href=\"https://www.youtube.com/watch?v=rT6eucDVmFY\" target=\"_blank\">interview</a> that aired Feb. 8 before the Super Bowl.</p>\n<p>Trump referred to the crime rate, an umbrella category that includes four types of violent crime (murder, rape, robbery and aggravated assault) as well as property crimes (burglary, larceny, car theft and arson). But when contacted for comment, the White House referred to a narrower measure: the murder rate.</p>\n<p>The White House pointed to a Jan. 22 <a href=\"https://www.axios.com/2026/01/22/murder-rate-century-low\" target=\"_blank\">Axios article</a> about the U.S. murder rate hitting its lowest level since 1900. The article cited a <a href=\"https://counciloncj.org/crime-trends-in-u-s-cities-year-end-2025-update/\" target=\"_blank\">study</a> by the Council on Criminal Justice, an independent criminal justice research group.</p>\n<p>In its 2025 Crime Trends report, the council wrote that the 2025 homicide rate is on pace to become \"the lowest rate ever recorded in law enforcement or public health data going back to 1900, and would mark the largest single-year percentage drop\" on record. The crimes the report cited — murder and non-negligent homicide — are what’s counted in the FBI’s murder rate.</p>\n<p>By the FBI’s definition, \"murder\"<a href=\"https://ucr.fbi.gov/crime-in-the-u.s/2019/crime-in-the-u.s.-2019/topic-pages/murder\" target=\"_blank\"> refers to</a> the willful killing of one human being by another, as determined by police investigation and not requiring conviction of a defendant or a coroner’s ruling. </p>\n<p>Experts told PolitiFact the 2025 FBI murder rate will likely end up at a 65-year low. But saying it’s the lowest in 125 years is less certain, because data prior to 1960 is not comparable to later data.</p>\n<p>Because the methodology was not consistent for all 125 years, \"We just can’t say for sure\" whether it’s an all-time low, said Jeff Asher, a crime data researcher.</p>\n<h2>Overall crime rate statistics </h2>\n<p>Beyond murders and non-negligent manslaughter, the overall <a href=\"https://usafacts.org/articles/how-does-crime-compare-by-city/\" target=\"_blank\">violent crime</a> and <a href=\"https://usafacts.org/articles/property-crime-rates/\" target=\"_blank\">property crime</a> rates are also lower today than at least any point since the mid-1970s. Both measures have been on a long-term decline, going back to the early 1990s.</p>\n<div class=\"artembed\"><a></a><div class=\"infogram-embed\"></div></div>\n<div class=\"artembed\"><a></a><div class=\"infogram-embed\"></div></div>\n<p>Ernesto Lopez, a senior research specialist with the Council on Criminal Justice, told PolitiFact the group did not examine any other type of crime rate when it cited the 125-year figure, only murder and non-negligent manslaughter. </p>\n<p>\"So we can’t say that violent crime or property crime rates are at all time lows\" going back as far as 125 years, Lopez said.</p>\n<h2>The rate for murder and non-negligent manslaughter dropped significantly in 2025</h2>\n<p>Because it takes time to fully calculate crime data, the council’s report uses trends in the currently available data to project what the 2025 murder rate will be once the FBI calculates and releases final numbers later this year. </p>\n<p>The Council on Criminal Justice said the rate for murder and non-negligent manslaughter will be about 4 per 100,000 residents. Asher offered a similar projection of about 4.2 per 100,000. </p>\n<p>Both estimates are below the previous record low of 4.4 per 100,000 people in 2014 — at least when compared with annual rates going back to 1960, when the FBI began using the same methodology it uses today.</p>\n<div class=\"artembed\"><a></a><div class=\"infogram-embed\"></div></div>\n<p>The council and Asher agreed that the 2025 drop of about 20% is likely to become the largest one-year decline ever recorded.</p>\n<h2>Issues with historic recordkeeping</h2>\n<p>Whether the homicide drop is the lowest in 125 years is less certain.</p>\n<p>Asher said FBI data on murder and non-negligent homicide is not apples-to-apples between 1930 and 1959, because the older data was based on a smaller share of the U.S. population and used definitions different from today’s. Before 1930, the FBI didn’t produce any equivalent data at all.</p>\n<p>The problem with saying it’s a 125-year record, Asher said, is that doing so means including the not-fully-comparable 1930 to 1959 FBI data and 1900 to 1929 data from public health sources. The public health data counted homicides, a category that’s broader than murders and non-negligent homicides because it also includes killings considered justifiable. </p>\n<p>Lopez said his group has a \"high degree of confidence\" that once the final numbers for 2025 are released by the FBI later this year, the 2025 homicide level could be \"the lowest ever recorded in the United States since 1900\"</p>\n<h2>Our ruling</h2>\n<p>Trump said, \"The crime rate now is the lowest it's been since 1900. That's 125 years.\"</p>\n<p>Trump referred to the overall crime rate, which includes a range of violent crimes and property crimes. But the White House pointed to evidence of a record low murder rate, not overall crime.</p>\n<p>Experts expect that when the final 2025 murder rate, as defined by the FBI, is released later this year, it likely will be the lowest in at least 65 years. </p>\n<p>Whether it is the lowest in 125 years is disputed, however, because experts say data prior to 1960 is not comparable to later data.</p>\n<p>Overall violent crime and property crime are also at decades-long lows, but it’s unclear whether they are at record lows going back 125 years.</p>\n<p>The statement is partially accurate but leaves out important details. We rate it Half True.</p>\n<p><strong><em>CORRECTION, Feb. 12, 2026</em></strong>: This version corrects the percentage drop in the murder rate from 2024 to 2025.</p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/12/donald-trump/murder-crime-rate-lowest-125-years-FBI/",
    "publication_date": "Thu, 12 Feb 2026 13:48:43 +0000",
    "date_gathered": "2026-02-24T04:09:44.406186",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Social Media - Image of Bad Bunny in a dress and burning the U.S. flag is AI-generated",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/tom_ruling_pof/78d86847d0cf8b94b2ec75a8046185dd.jpg\" /><p>Puerto Rican superstar Bad Bunny ended his historic Super Bowl LX halftime show with a message of unity.</p>\n<p>\"God Bless America,\" he said as he drew the first predominantly Spanish-language Super Bowl halftime performance to a close, trailed by flags representing the many countries of the Americas.</p>\n<p>But on social media, people claimed Bad Bunny, born Benito Antonio Martínez Ocasio, had been pictured in a more divisive moment: standing on a stage in a dress and makeup and burning a U.S. flag.</p>\n<p>\"Just a reminder: This is the man that the NFL chose to be the performer for today's halftime show at the Superbowl,\" one <a href=\"https://www.facebook.com/chad.poets/posts/pfbid0Wf7qNNsV4cYwLpSbtuMEdcNF1maccVKuYHaLi7heSktPw4kvYX3uksv6UKrQ5qtJl\" target=\"_blank\">Feb. 8 Facebook post</a> read.</p>\n<p>This image doesn’t show a real flag-burning incident; it’s AI-generated.</p>\n<div class=\"artembed\"><img src=\"https://static.politifact.com/politifact/photos/AI_image_of_Bad_Bunny_burning_US_flag_with_POF_label_02-09-2026.png\" /></div>\n<p><em>(Screenshot from Facebook)</em></p>\n<p>Gemini, Google’s AI chatbot, detected the digital watermark in the image that indicates it was made with the tool. The watermark is <a href=\"https://deepmind.google/models/synthid/\" target=\"_blank\">embedded directly into AI creations</a> and is not visible to humans, but can be detected by Google’s technology. In an AI-generated image, that watermark is embedded in its pixels. </p>\n<p>The image has irregularities. The real U.S. flag has 13 stripes, while the flag in the fake image has 11. </p>\n<p>The AI-generated image also showed audience members holding cellphones and recording the event, but the pictures on phone screens showed inconsistent silhouettes of the burning flag.</p>\n<p>PolitiFact found no news reports nor other images and videos that confirm such an incident happened. Such an event would be widely shared given Bad Bunny’s fame — he recently made history by becoming the first artist with a Spanish-language album to win the Grammy Awards Album of the Year prize.</p>\n<p>Bad Bunny has worn a <a href=\"https://www.wmagazine.com/fashion/bad-bunny-jacquemus-dress\" target=\"_blank\">dress</a> and a <a href=\"https://www.harpersbazaar.com/culture/art-books-music/a40772052/bad-bunny-icons-interview/\" target=\"_blank\">skirt</a> for photoshoots before, but there’s no proof he wore a dress like the one in the fake image.</p>\n<p>Lead Stories <a href=\"https://leadstories.com/hoax-alert/2026/02/fact-check-bad-bunny-burning-flag-super-bowl-halftime-show.html?_gl=1*1j0fuvm*_ga*ODU5NDE2MDc5LjE3NjgyMjgzNTA.*_ga_P9SL7JXEN7*czE3NzA2NTM5MTMkbzExJGcwJHQxNzcwNjUzOTEzJGo2MCRsMCRoMA..\" target=\"_blank\">reported</a> that the image <a href=\"https://www.facebook.com/theQbanguy/posts/pfbid02o3uBAM48BPSWii5JkUEtVHYToatQwDd5tURJvmq7Ejs1FYo82PWFTyZKhQMLr5oUl\" target=\"_blank\">first appeared</a> on a satirical Facebook account named \"<a href=\"https://www.facebook.com/theQbanguy/posts/pfbid02o3uBAM48BPSWii5JkUEtVHYToatQwDd5tURJvmq7Ejs1FYo82PWFTyZKhQMLr5oUl\" target=\"_blank\">Qbanguy</a>.\" The account’s bio reads: \"Ai funny Content &amp; Master Meme Maker - 100% Not Real everything is Satire.\"</p>\n<p>The account posted other fake images, including <a href=\"https://www.facebook.com/theQbanguy/posts/pfbid0NysMg6pL6o1SQ8SYujMSdnn9dtnXxVrUg3H4VKRrGbEcLXtgFPKxcbKFr2SePZ89l\" target=\"_blank\">one</a> of Bad Bunny in a multicolored dress holding a torn banner that reads \"ICE Out,\" and <a href=\"https://www.facebook.com/theQbanguy/posts/pfbid02nKkCqMNDfntTy25p48HM95dq7xF8X474dFg6EMv37CWQkJMXmH8CsxVRyxR5FrmQl\" target=\"_blank\">one</a> of Bad Bunny wearing a multicolored outfit with a vest that read \"F*ck ICE.\" The account claimed these were his halftime show outfits, but he wore all-white outfits for the duration of his Super Bowl performance.</p>\n<p>This is not a real image of Bad Bunny burning the U.S. flag. We rate that claim Pants on Fire!</p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/09/social-media/bad-bunny-burning-flag-AI/",
    "publication_date": "Mon, 09 Feb 2026 20:47:56 +0000",
    "date_gathered": "2026-02-24T04:09:44.406190",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Donald Trump - Is US factory construction at an all-time high?",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-half-true/a70736af2900ee34890c1c7a83bfc1c8.jpg\" /><p>A key reason President Donald Trump cites for his tariff policy is boosting U.S. manufacturing.</p>\n<p>On two <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-restaurant-stop-urbandale-iowa-january-27-2026/#122\" target=\"_blank\">recent</a> <a href=\"https://rollcall.com/factbase/trump/transcript/donald-trump-remarks-southern-boulevard-dedication-ceremony-january-16-2026/#59\" target=\"_blank\">occasions</a>, Trump has touted a factory-building record on his watch.</p>\n<p>\"We right now have more factories and plants being built in our country than we've ever had before,\" Trump told diners at an Iowa restaurant before a Jan. 27 speech.</p>\n<p>The data to support this point is mixed, at best. While some data suggests a growth in the biggest factories is continuing under Trump, overall spending rose significantly under Trump’s predecessor, President Joe Biden, but has eased since its Biden-era peak.</p>\n<h2>White House cites number of big projects in the works</h2>\n<p>The White House pointed PolitiFact to data collected by Engineered Vision, a company that supplies machine technology, about $1 billion-plus projects. An archived version of a chart from the company’s website from <a href=\"https://web.archive.org/web/20250311003758/https:/map.engineered-vision.com/\" target=\"_blank\">March 11, 2025</a>, shows 30 such projects, while the <a href=\"https://map.engineered-vision.com/\" target=\"_blank\">February 2026</a> chart shows 46 projects.</p>\n<p>A closer look at the newly listed projects shows that some of them had been in the planning stages prior to Trump’s second term.</p>\n<p>Federal data on the number of private U.S. manufacturing establishments also supports Trump’s statement. Preliminary 2025 figures show that the number of <a href=\"https://www.census.gov/programs-surveys/susb/technical-documentation/methodology.html\" target=\"_blank\">those facilities</a> hit a new high in the second quarter of Trump’s second term.</p>\n<div class=\"artembed\"><a></a><div class=\"infogram-embed\"></div></div>\n<p>Given the long turnaround time required for factory construction, it’s unclear whether the increases during the first six months of Trump’s second term can be attributed to his policies, or whether they reflect projects that were already in the pipeline when he took office.</p>\n<p>Beyond these two data points, evidence from federal sources casts doubt on the notion that factory building continues to reach new heights under Trump.</p>\n<h2>Construction spending has declined under Trump</h2>\n<p>Experts told PolitiFact the most reliable metric to use for judging Trump’s assertion is spending on manufacturing construction, because it’s produced by the federal government, has a long track record and covers expenditures on all sizes of facilities, not just the biggest. </p>\n<p>Federal statistics for <a href=\"https://fred.stlouisfed.org/graph/?g=1QNIp\" target=\"_blank\">construction spending</a> on manufacturing show a rapid rise under Biden, followed by a dip after Trump entered office in 2025.</p>\n<div class=\"artembed\"><a></a><div class=\"infogram-embed\"></div></div>\n<p>Paul Donovan, the global chief economist at UBS Wealth Management, <a href=\"https://www.nytimes.com/2025/10/29/business/mixed-picture-united-states-manufacturing-in-four-charts.html\" target=\"_blank\">told</a> The New York Times that spending on factory construction rose from about 3.5% of the manufacturing economy in 2021 to 8% in 2024, a 40-year high. </p>\n<p>But this trajectory has sagged under Trump, experts say.</p>\n<p>\"The past four years have been the most significant peacetime period for manufacturing construction since the data was first gathered,\" said Scott Paul, president of the Alliance for American Manufacturing, an advocacy group. While the level remains elevated under Trump, he said, \"the peak was around 14 months ago.\"</p>\n<p>Tara Sinclair, a George Washington University economist who coauthored a <a href=\"https://home.treasury.gov/news/featured-stories/unpacking-the-boom-in-us-construction-of-manufacturing-facilities\" target=\"_blank\">paper</a> on manufacturing construction while serving as deputy assistant treasury secretary for macroeconomics under Biden, said spending on factory construction \"is still quite a bit higher than pre-2021, but it does look like the boom is over and has somewhat reversed.\"</p>\n<p>Sinclair and other experts said a major reason for the rise under Biden was a pair of bipartisan bills he signed — the Infrastructure Investment and Jobs Act and the CHIPS and Science Act — plus one he signed that was backed only by Democrats, the Inflation Reduction Act. Provisions in each of these bills directed federal spending and other incentives toward manufacturing, especially for items such as semiconductors.</p>\n<h2>Trump’s policies have cut both ways on manufacturing construction</h2>\n<p>Scott Lincicome, vice president at the libertarian Cato Institute, said he’s <a href=\"https://www.cato.org/testimony/made-america-boom-us-manufacturing-investment#conclusion\" target=\"_blank\">not a fan</a> of some aspects of the Biden legislation but they were effective in boosting manufacturing construction. Trump’s policies, he said, have sometimes worked at cross purposes.</p>\n<p>Lincicome said Trump’s changes to the way companies expense construction costs have bolstered construction spending, as have the administration’s efforts to streamline permitting processes.</p>\n<p>However, Lincicome said Trump’s on-again, off-again tariffs have fostered uncertainty among business decisionmakers. The tariffs also have raised costs for foreign-sourced materials needed to build factories, hurting the cost-benefit balance.</p>\n<p>Trump said today’s factory boom exceeds anything else in U.S. history. But Lincicome said in addition to the boom under Biden, today’s level was likely exceeded by the 20-year period from World War II to the early 1960s when the U.S. was \"the only game in town, because half the rest of the world was bombed out from the war and the other half was communist.\" </p>\n<h2>Our ruling</h2>\n<p>Trump said, \"We right now have more factories and plants being built in our country than we've ever had before.\"</p>\n<p>Factory construction remains at a high level compared with recent history, but most of the increase came under Biden, and there are signs that that boom has faded under Trump, particularly when measured by overall spending on construction of manufacturing facilities, which experts say is a key metric. </p>\n<p>Analysts said some of Trump’s policies have aided companies seeking to build factories, but other policies — including his tariffs that have increased both uncertainty and prices for foreign materials needed for construction — have offset some of those gains.</p>\n<p>We rate the statement Half True.</p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/09/donald-trump/factory-manufacturing-construction-record-high/",
    "publication_date": "Mon, 09 Feb 2026 16:34:09 +0000",
    "date_gathered": "2026-02-24T04:09:44.406194",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Social Media - Liam Conejo Ramos, the 5-year-old detained by ICE, wasn’t in Bad Bunny’s Super Bowl halftime show",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-false/b66409be4b4b0cf7a7054c1f752359b2.jpg\" /><p>More than 135 million people watched Bad Bunny’s Super Bowl halftime show, and because of false social media posts, some went to bed believing the performance featured Liam Conejo Ramos, the 5-year-old boy <a href=\"https://www.cnn.com/2026/01/23/us/liam-conejo-ramos-ice-wwk\" target=\"_blank\">detained by ICE</a> in Minneapolis. </p>\n<p>During Bad Bunny’s Feb. 8 set at Levi's Stadium in Santa Clara, California, the Puerto Rican singer stopped to hand a child what appeared to be a replica of his <a href=\"https://www.youtube.com/watch?v=hhvdOTvdpjs\" target=\"_blank\">Album of the Year Grammy award</a>. As he knelt down, Bad Bunny, whose legal name is <a href=\"https://www.google.com/search?q=Benito+Antonio+Mart%C3%ADnez+Ocasio&amp;rlz=1C5GCCM_en&amp;oq=bad+bunny+real+name&amp;gs_lcrp=EgZjaHJvbWUqDQgAEAAYgwEYsQMYgAQyDQgAEAAYgwEYsQMYgAQyBggBEAAYAzINCAIQABiDARixAxiABDINCAMQABiDARixAxiABDIGCAQQABgDMggIBRAAGBYYHjIKCAYQABgKGBYYHjINCAcQABiGAxiABBiKBTINCAgQABiGAxiABBiKBTINCAkQABiGAxiABBiKBdIBCDI0MDNqMGo3qAIAsAIA&amp;sourceid=chrome&amp;ie=UTF-8&amp;ved=2ahUKEwjKxdqPxsySAxXLSjABHXnSPD4QgK4QegYIAQgAEAY\" target=\"_blank\">Benito Antonio Martínez Ocasio</a>, rubbed the boy's head and said, \"Cree siempre en ti,\" which means \"always believe in yourself.\"</p>\n<p>Journalists and <a href=\"https://x.com/edkrassen/status/2020678662232617411?s=46\" target=\"_blank\">X accounts with blue checkmarks</a> shared that the boy was Conejo Ramos. </p>\n<p>\"One of the most meaningful moments of the Super Bowl halftime show happened quietly,\" journalist Mariana Atencio <a href=\"https://archive.is/LkpZU\" target=\"_blank\">posted</a> Feb. 8 on X from her verified account. \"Bad Bunny brought Liam Conejo Ramos onto the stage — the Ecuadorian boy who was forcefully detained by ICE in Minnesota — and handed him his Grammy.\"</p>\n<p>A <a href=\"https://web.archive.org/web/20260209134712/https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fprinforma%2Fposts%2Fpfbid035ETCRJtNRd5Ly1iC5XrMRF4E2vpZQEocrvjDqsbZBj51uW7bWkuqatMc777Xp4Mzl%3Frdid%3D2j0BQQGTidI6y9u2\" target=\"_blank\">Facebook post</a> read, \"This kid that Bad Bunny handed the Grammy to is allegedly Liam Conejo Ramos — the boy who had been deported with his father by ICE in Minneapolis.\" </p>\n<div class=\"artembed\"><img src=\"https://static.politifact.com/politifact/photos/liam_ramos_.png\" /></div>\n<p>The child featured in the first-ever Spanish-language halftime show was not Conejo Ramos — it was 5-year-old child actor Lincoln Fox, whose Instagram account <a href=\"https://www.instagram.com/p/DUhUaQpEdFh/?hl=en\" target=\"_blank\">shared a post</a> about it shortly after the show ended: \"I’ll remember this day forever! @badbunnypr — it was my truest honor.\"</p>\n<p>In <a href=\"https://www.instagram.com/p/DUin1nxEYwh/?hl=en&amp;img_index=1\" target=\"_blank\">a Feb. 9 followup post,</a> Fox’s Instagram account elaborated about his role and addressed the Conejo Ramos rumors.</p>\n<p>\"An emotional, unforgettable day being cast as the young Benito — a symbolic moment where the future hands the past a Grammy,\" the post said in part. \"Sending love to Liam Ramos. We all deserve peace and love in America, a country built by and home to so many hard-working immigrants.\"</p>\n<p>A law firm representing the Conejo Ramos family told PolitiFact the child onstage was not Liam. PolitiFact did not immediately hear back from representatives for Bad Bunny. A Bad Bunny publicist <a href=\"https://www.npr.org/2026/02/08/g-s1-109264/liam-conejo-ramos-bad-bunny-super-bowl\" target=\"_blank\">confirmed to NPR</a> that the boy on stage was not Liam Conejo Ramos.</p>\n<p>Federal immigration agents detained Conejo Ramos and his father, Adrian Conejo, on Jan. 20 as they returned home from the boy’s preschool. They were sent to a Texas detention center before <a href=\"https://www.cbsnews.com/news/judge-orders-liam-ramos-dad-released-from-texas-detention/\" target=\"_blank\">a judge ordered their release</a> Feb. 1. </p>\n<p>The family is from Ecuador and is in the process of claiming asylum as the Trump administration has sought to <a href=\"https://www.mprnews.org/story/2026/02/05/liam-conejo-ramos-dhs-requests-expedited-deportation-proceedings-for-family\" target=\"_blank\">end their asylum claims and deport them.</a></p>\n<p>We rate claims that Conejo Ramos was the boy in Bad Bunny’s Super Bowl halftime show False.</p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/09/social-media/Bad-Bunny-Liam-Conejo-Ramos-Super-Bowl-halftime/",
    "publication_date": "Mon, 09 Feb 2026 16:21:26 +0000",
    "date_gathered": "2026-02-24T04:09:44.406197",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Social Media - Was Jeffrey Epstein recently spotted in Tel Aviv? No, this image is AI-generated",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/tom_ruling_pof/78d86847d0cf8b94b2ec75a8046185dd.jpg\" /><p>Thousands of social media accounts shared an image of a man with long gray hair and a beard, wearing sunglasses and flanked by two men.</p>\n<p>Their guess about who it is? Disgraced financier Jeffrey Epstein, who died in 2019.</p>\n<p>\"Israel faked his death,\" read <a href=\"https://archive.ph/JyQeK\" target=\"_blank\">one Feb. 5 X post</a> with 5 million views. \"Epstein is still alive and walking the streets of Tel Aviv.\"</p>\n<p>\"Someone who looks like Jeffrey Epstein was JUST SPOTTED walking in Tel Aviv, Israel,\" read another <a href=\"https://archive.ph/bvPg0\" target=\"_blank\">Feb. 5 X post</a> with 5.5 million views. \"Could this really be him? It’s literally him.\"</p>\n<p>This image also circulated on <a href=\"https://www.facebook.com/permalink.php?story_fbid=pfbid0e8gTN2cMLE7Wn3WdYFdftKGjYukfQiJ6zCA6dkmwDTMay2EqZFANAzZG2jUBSGRMl&amp;id=61553097803794\" target=\"_blank\">Facebook</a>, <a href=\"https://www.tiktok.com/@billionviraltv/video/7603727668667878678\" target=\"_blank\">TikTok</a>, <a href=\"https://www.instagram.com/reel/DUZTHY0iPdi/\" target=\"_blank\">Instagram</a> and <a href=\"https://www.threads.com/@haseebfud/post/DUZREU1kl6M\" target=\"_blank\">Threads</a>.</p>\n<p>This doesn’t prove Epstein is alive. The image was generated with artificial intelligence.</p>\n<div class=\"artembed\"><img src=\"https://static.politifact.com/politifact/photos/Screenshot_of_Epstein_in_Tel_Aviv_AI_image_02-06-2026.png\" /></div>\n<p><em>(Screenshot from X)</em></p>\n<p>Many of the posts shared a cropped version of the image, but the original shows the logo of Gemini, Google’s AI chatbot. A reverse image search showed the image was <a href=\"https://www.reddit.com/r/hardaiimages/comments/1qteqd9/dude_looks_oddly_familiar/?tl=hi\" target=\"_blank\">posted Feb. 1</a> to a Reddit forum titled \"hardaiimages.\" The forum’s <a href=\"https://www.reddit.com/r/hardaiimages/about/\" target=\"_blank\">\"About\" page</a> invites users to \"post your funny, hard AI images here.\" </p>\n<p>The Reddit user who posted it confirmed in a comment it was made with Gemini. \"You can see the Gemini logo at the bottom right of each picture. I didn't think it would become so viral,\" the Feb. 6 <a href=\"https://www.reddit.com/r/hardaiimages/comments/1qteqd9/comment/o3y8w8o/\" target=\"_blank\">comment</a> read.</p>\n<p>Other details in the image show it’s fake. The road signs in the background show Hebrew text and its English translation, but the translation is inaccurate. The signs also don’t match a real place in Tel Aviv; a street named \"Haangus Ev.\" does not show up in Google Maps.</p>\n<div class=\"artembed\"><img src=\"https://static.politifact.com/politifact/photos/Screenshot_of_fake_image_of_Epstein_in_Tel_Aviv_with_AI_label_02-06-2026.png\" /></div>\n<p><em>(Image from Reddit; red rectangle shows nonsensical road signs, red circle shows Gemini logo)</em></p>\n<p>This image doesn’t show Epstein, alive, in Tel Aviv. We rate this claim Pants on Fire!</p>\n<p><em>PolitiFact Researcher Caryn Baird contributed to this report.</em></p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/06/social-media/jeffrey-epstein-tel-aviv-fake-image-AI/",
    "publication_date": "Fri, 06 Feb 2026 21:19:04 +0000",
    "date_gathered": "2026-02-24T04:09:44.406201",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Gretchen Whitmer - Michigan Gov. Gretchen Whitmer said fewer families are living in poverty. Is that true?",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-half-true/a70736af2900ee34890c1c7a83bfc1c8.jpg\" /><p>Michigan Gov. Gretchen Whitmer, a potential Democratic presidential candidate, recently wrote about her accomplishments as she enters her final year leading the state.</p>\n<p>\"Our approach has led to some pretty remarkable results,\" <a href=\"https://archive.ph/g4jbV\" target=\"_blank\">Whitmer wrote</a> in a Feb. 2 Substack entry. \"Free pre-K, community college, and school meals for all. Fewer families living in poverty.\"</p>\n<p>Her statement taps into Americans’ concerns about affordability, which could be a key issue for voters in the midterm elections, including a competitive U.S. Senate contest in Michigan. President Donald Trump’s pledge to reduce prices for groceries, cars and other items is <a href=\"https://www.politifact.com/truth-o-meter/promises/maga-meter-tracking-donald-trumps-2024-promises/promise/1693/reduce-prices-for-groceries-cars-and-other-consume/article/3223/\">Stalled</a> on our MAGA-Meter, which tracks his campaign promises.</p>\n<p>Michigan’s poverty rate declined during Whitmer’s tenure. The drop mirrored national trends, and most of the decline began under her predecessor. Whitmer’s spokesperson pointed to anti-poverty measures during her tenure as the reason for the decline. Experts said poverty rates are affected by numerous factors, not only one governor’s policies.</p>\n<h2>Poverty rate declined in Michigan since 2011</h2>\n<p>Whitmer was referring to a decline in the state’s poverty rate compared with what she inherited from her predecessor, Republican Gov. Rick Snyder, Whitmer’s political strategist told PolitiFact. </p>\n<p>In 2011, when Snyder took office, about 17% of Michigan residents lived in poverty. It peaked at 17.5% in 2012, then fell to 14% during Snyder’s final year in office in 2018, according to U.S. Census Bureau data analyzed by <a href=\"https://www.kff.org/state-health-policy-data/state-indicator/distribution-by-fpl/?currentTimeframe=4&amp;sortModel=%7B%22colId%22:%22Location%22,%22sort%22:%22asc%22%7D\" target=\"_blank\">KFF</a>, a nonpartisan health policy think tank. </p>\n<p>During Whitmer’s tenure, which began in 2019, the rate hovered between 13.1% and 13.5% in 2024, the most recent year available. (There is no 2020 data because of the coronavirus pandemic’s significant data collection disruptions.)</p>\n<div class=\"artembed\"><a></a><div class=\"infogram-embed\"></div></div>\n<p>The official U.S. Census Bureau poverty measure totals a household's income and compares it with a <a href=\"https://www.census.gov/data/tables/time-series/demo/income-poverty/historical-poverty-thresholds.html\" target=\"_blank\">threshold</a> for the household's size and age composition, Kristin S. Seefeldt, a University of Michigan social work associate professor, said. If the household’s income is below that threshold the household is considered to be living in poverty. Many experts say the threshold is outdated, but it’s still widely used.</p>\n<p>The U.S. Census Bureau's nationwide poverty threshold for a family of two adults and one child was $25,249 in 2024.</p>\n<p>Rates are often the most useful measure of changes because they take into account population changes. However, in sheer numbers, there were more people living in poverty in Michigan (and the nation) in 2024 than 2019. In Michigan, there were about 1.28 million in poverty in 2019 and 1.34 million in 2024.</p>\n<p>However, a comparison of poverty rates under two governors doesn’t provide a full picture. </p>\n<p>Michigan’s declining poverty rate under both Whitmer and Snyder matches a national trend. The national poverty rate was 15.9% in 2011 and declined most years, ending at 12.1% in 2024.</p>\n<div class=\"artembed\"><a></a><div class=\"infogram-embed\"></div></div>\n<p>During economic downturns, Michigan tends to get hit harder and experience longer recessions than even neighboring states, mainly because of its transition from a manufacturing-based economy to a service-based economy, said Nicholas Hess and Patrick Schaefer at the Michigan League for Public Policy, a nonprofit policy institute. That typically puts the state’s poverty rate higher than the national average.</p>\n<p>There is usually a lag between the end of a recession and a drop in the poverty rate.</p>\n<p>\"One could argue that due to the Great Recession (of 2008 and 2009) the Snyder administration was at a much different starting point,\" Seefeldt said. \"Or, one might say that Snyder didn't do enough to bring down poverty rates as the economy recovered. But the trend data alone don't let us say either definitively.\"</p>\n<p>Charles L. Ballard, a Michigan State University economics professor emeritus, said poverty measures should be taken with several grains of salt.</p>\n<p>\"The really big story of the Michigan economy is the longer-term story of Michigan’s economy losing ground relative to the national average,\" Ballard said. \"This is strongly associated with the decline of manufacturing in general, and the auto sector in particular.\"</p>\n<p>Whitmer hasn’t reversed that decline, Ballard said, but neither did her predecessors, Republican or Democrat. </p>\n<h2>Whitmer cited anti-poverty measures</h2>\n<p>Whitmer’s spokesperson pointed to the governor’s actions during her administration to help low-income people, including quintupling the <a href=\"https://www.michigan.gov/whitmer/news/press-releases/2023/01/12/gov-whitmer-announces-support-for-bills-to-roll-back-retirement\" target=\"_blank\">earned income tax credit</a>; expanding <a href=\"https://www.michigan.gov/whitmer/news/press-releases/2024/08/23/gov-whitmer-mileap-encourage-families\" target=\"_blank\">pre-K for all</a>; expanding <a href=\"https://www.michigan.gov/whitmer/-/media/Project/Websites/Whitmer/Documents/01202026-Onepager/2026_Childcare.pdf?rev=7ed46f304f3b4005a541f5fcacc39e2d\" target=\"_blank\">affordable childcare</a>; investing in <a href=\"https://rxkids.org/\" target=\"_blank\">Rx Kids</a>, a children’s prescription program, in the latest state budget; securing free <a href=\"https://www.michigan.gov/whitmer/news/press-releases/2025/10/13/whitmers-education-budget-continues-free-school-meals-saving-families-average-of-1000-year\" target=\"_blank\">school breakfast and lunch</a>; and ending state <a href=\"https://www.michigan.gov/whitmer/news/press-releases/2025/10/07/whitmer-signs-balanced-bipartisan-fy26-budget-to-fix-roads-cut-taxes-lower-costs\" target=\"_blank\">taxes on tips and overtime</a>.  </p>\n<p>Many of the actions Whitmer cited stem from bills that passed the legislature from 2023 to 2025.</p>\n<p>\"I'd argue it's really too soon to see the effect of most of these changes in any dataset,\" Seefeldt said. \"We know that the types of changes she's put in place matter for the well-being of families with low income. But the official poverty numbers by themselves aren't ‘proof’ that the changes have resulted in lower poverty rates during her administration.\"</p>\n<p>The official poverty measure looks only at pre-tax income, which means that impact from some of these measures — such as expanding the earned income tax credit or rolling back the retirement tax — aren’t reflected in the statistic, Seefeldt said. Official measures also don’t consider expenses such as child care.</p>\n<p>Another way the Census Bureau seeks to quantify poverty is by using a \"supplemental poverty measure,\" which takes into account additional factors not included in the basic poverty measure,  including government benefits such as food assistance, tax credits and accounts for expenses such as housing and medical costs. </p>\n<p>Michigan’s supplemental poverty measure decreased between 2023 and 2024. That aligns with the expansion of the state’s earned income tax credit, the experts at the Michigan League for Public Policy said.</p>\n<h2>Our ruling</h2>\n<p>Whitmer said her tenure as governor has led to \"fewer families living in poverty\" in Michigan. </p>\n<p>The poverty rate under Whitmer is lower than it was under her predecessor. In 2011, when Snyder took office, about 17% of residents lived in poverty; that fell to 14% in 2018. During Whitmer’s tenure, the rate has ranged from 13.1% to 13.5%.</p>\n<p>Whitmer’s statement omits that the drop mirrored national trends; that Michigan’s rate is higher than the national average; and that the sheer number of people living in poverty increased from 2019 to 2024. Poverty rates are influenced by multiple factors, not a governor’s policies alone.</p>\n<p>The statement is partially accurate but leaves out important information. We rate it Half True.</p>\n<p><em>Chief Correspondent Louis Jacobson contributed to this fact-check.</em></p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/06/gretchen-whitmer/Michigan-poverty-decline-affordability/",
    "publication_date": "Fri, 06 Feb 2026 15:59:52 +0000",
    "date_gathered": "2026-02-24T04:09:44.406205",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Donald Trump - Donald Trump wrong that 92% of Minnesota Somalis don’t work",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/tom_ruling_pof/78d86847d0cf8b94b2ec75a8046185dd.jpg\" /><p>It was a reunion of sorts as former FBI Deputy Director Dan Bongino relaunched his podcast and brought in the man who tapped him for the federal job — President Donald Trump — for an interview.</p>\n<p>Bongino and Trump talked about a variety of issues, including Minnesota, where Trump’s administration has sent some 3,000 immigration enforcement officers, prompting a backlash, especially after the deadly shootings of two U.S. citizens, Renee Good and Alex Pretti.</p>\n<p>Minneapolis, the focus of the enforcement effort, is home to many Somalis, most of whom are U.S. citizens, either by birth or naturalization. </p>\n<p>During the interview with Bongino, Trump referred to Somali immigrants in Minnesota.</p>\n<p>\"These are people that don’t work,\" <a href=\"https://rumble.com/v756t38-im-back-ep.-2443-02022026.html?e9s=src_v1_ucp_f\" target=\"_blank\">Trump said</a>. \"These are people that are just not an asset to our society, to put it mildly. And we’ve got to get them out. … Ninety-two percent don’t work. They have an unbelievable corrupt system of welfare. You know, many of them drive Mercedes Benzes. They had nothing when they came over.\"</p>\n<p>Federal data shows that Somalis are poorer, on average, than other Minnesotans. But the notion that 92% of them don’t work is unfounded; official government data shows far lower percentages.</p>\n<p>White House spokesperson Abigail Jackson did not provide support for the 92% figure. \"Aliens who come to our country, complain about how much they hate America, fail to contribute to our economy, rip off Americans, and refuse to assimilate into our society should not be here,\" she said.</p>\n<h2>Statistics for Somalis in Minnesota</h2>\n<p>The immigration enforcement buildup came after Trump criticized a spate of fraud cases involving Somalis in Minnesota, which have been prosecuted under former President Joe Biden and Trump. Since 2022, federal prosecutors have charged about <a href=\"https://www.politifact.com/factchecks/2026/jan/08/pam-bondi/DOJ-Minnesota-fraud-Trump-Biden-Somalis/\">98 people</a> with defrauding the federal government. The majority have been convicted; many cases are pending.</p>\n<p>There are about 108,000 Somalis in Minnesota, representing roughly 2% of the state’s population. Most Somalis <a href=\"https://www.mnhs.org/mnopedia/search/index/somali-and-somali-american-experiences-minnesota\" target=\"_blank\">came to the state</a> in the 1990s, fleeing civil war in their home country. Some came as <a href=\"https://www.uscis.gov/humanitarian/refugees-and-asylum/refugees\" target=\"_blank\">refugees</a> — an immigration category for those fleeing persecution — while others were sponsored by family members or moved from other states. </p>\n<p><a href=\"https://data.census.gov/table?t=1325&amp;g=040XX00US27\" target=\"_blank\">Census Bureau data from 2024</a> estimates that for Somalis in Minnesota, the labor force participation rate — that is, the share of the population 16 and older that is either working or looking for work — is about 72%. That means that about 28% of the Minnesota Somali population is not employed and not looking for work — less than one-third of the 92% share Trump cited.</p>\n<p>The rate of labor force participation is higher for Somalis than it is for Minnesotans overall. In December 2025, <a href=\"https://fred.stlouisfed.org/series/LBSSA27\" target=\"_blank\">Minnesota’s overall labor force participation rate</a> was 68%; that would make the non-working rate about 32%, or four percentage points higher than for Somalis.</p>\n<p>The Center for Immigration Studies, a think tank that favors low immigration levels, produced a December <a href=\"https://cis.org/Report/Somali-Immigrants-Minnesota\" target=\"_blank\">report</a> that details demographics of the Somali community in Minnesota using Census data. </p>\n<p>The report found significant economic and social challenges, including that 52% of children in Somali immigrant homes in Minnesota live in poverty, compared with 8% of children in homes headed by U.S.-born people. It also found that about 39% of working-age Somalis have no high school diploma, compared with 5% of U.S. natives, and that half of working-age Somalis who have lived in the U.S. for at least 10 years cannot speak English \"very well.\"</p>\n<p>But the report found that when it comes to employment, Somalis in Minnesota measure up relatively well.</p>\n<p>\"Somali joblessness is not as common as one would predict based on their population’s low education level,\" the report said. \"Employment is therefore a bright spot in the data for Somalis, relatively speaking.\"</p>\n<p>The report’s author, resident scholar Jason Richwine, told PolitiFact he suspects Trump’s 92% figure results from \"a common misunderstanding about welfare and work.\"</p>\n<p>Richwine said his research found that about 9 of every 10 Somali immigrant households with children receive means-tested, anti-poverty benefits — but that doesn't mean that 90%, or 92%, don't work. That’s because most welfare programs are available to workers, including food stamps and Medicaid.</p>\n<p>Richwine said the economic challenge associated with Somali immigration \"isn't so much that they don't work. Rather, it's that their marketable skills are in many cases insufficient to raise their families out of poverty. As a consequence, they use a lot of welfare.\"</p>\n<h2>Our ruling</h2>\n<p>Trump said that among Somalis in Minnesota, \"92% of them don’t work.\"</p>\n<p>The most recent data shows that about 28% of Somalis in Minnesota aren’t working — a far lower number than Trump’s 92%, and a smaller rate than for Minnesotans overall.</p>\n<p>About 9 in 10 Somalis receive some form of public assistance, but these programs typically allow low-wage workers to participate; receiving public benefits does not mean someone isn’t working.</p>\n<p>We rate the statement Pants on Fire!</p>\n<p><em><strong>RELATED</strong></em>: <a href=\"https://www.politifact.com/article/2026/jan/30/Frey-Walz-Trump-ICE-Minnesota-jails-prison/\">Trump leaders say Minnesota officials withhold detained immigrants from ICE. Is that true?</a></p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/02/donald-trump/Bongino-minnesota-somali-employment-poverty-benefi/",
    "publication_date": "Mon, 02 Feb 2026 22:27:52 +0000",
    "date_gathered": "2026-02-24T04:09:44.406209",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "X posts - No, these aren’t real photos of Zohran Mamdani with his mother and Jeffrey Epstein",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/tom_ruling_pof/78d86847d0cf8b94b2ec75a8046185dd.jpg\" /><p>Social media posts claim to show photos of New York City Mayor Zohran Mamdani as a child, along with his mother Mira Nair, attending multiple events with convicted sex offender Jeffrey Epstein. But the images aren’t real. </p>\n<p>American actor Michael Rapaport <a href=\"https://archive.ph/TZaRJ\" target=\"_blank\">posted</a> a picture on X showing Nair, a filmmaker, holding a baby and standing next to former President Bill Clinton and Epstein in what looks like a tropical setting. </p>\n<p>\"Mira Nair holding her baby Zohran Mamdani with Bill and Epstein,\" Rapaport wrote Jan. 31. \"Yeah….read that again….\"</p>\n<p>Conspiracy theorist Alex Jones <a href=\"https://archive.ph/bmPoR\" target=\"_blank\">shared</a> another image Feb. 1 on X of what appeared to be Mamdani as a child posing with Nair, Epstein accomplice Ghislaine Maxwell, Epstein, Clinton, Bill Gates and Jeff Bezos.</p>\n<p>Other <a href=\"https://archive.ph/h0mrw\" target=\"_blank\">X users also</a> <a href=\"https://archive.ph/BNVON\" target=\"_blank\">shared</a> <a href=\"https://archive.ph/VZdxF\" target=\"_blank\">multiple</a> images of Mamdani as a child supposedly attending Epstein’s events.</p>\n<div class=\"artembed\"><img src=\"https://static.politifact.com/politifact/photos/AI_images_of_Mamdani.001.jpeg\" /></div>\n<p><em>(Screenshot of X post)</em></p>\n<p>The images went viral online after the Department of Justice <a href=\"https://www.justice.gov/opa/video/department-justice-publishes-35-million-responsive-pages-compliance-epstein-files\" target=\"_blank\">released</a> millions of more documents related to the Epstein files. The files include a 2009 <a href=\"https://www.justice.gov/epstein/files/DataSet%2011/EFTA02438537.pdf\" target=\"_blank\">email</a> that says Nair attended an after-party for the film <a href=\"https://www.rottentomatoes.com/m/amelia_2009#cast-and-crew\" target=\"_blank\">Amelia</a>, which she directed. The party was held at Maxwell’s Manhattan townhouse.</p>\n<p>Mamdani was <a href=\"https://en.wikipedia.org/wiki/Zohran_Mamdani\" target=\"_blank\">born</a> in 1991 and the email is from 2009, so if Mamdani had attended the party with his mother, he would have been about 18 years old at the time, not a child as the images claim to show.</p>\n<p>PolitiFact found that the images of Nair with Mamdani as a child and Epstein were generated with artificial intelligence. </p>\n<p>The photos originated on a <a href=\"https://x.com/DumbFckFinder\" target=\"_blank\">parody account</a> known as \"DFF,\" which describes itself on X as sharing \"high quality AI videos and memes.\"</p>\n<p>The <a href=\"https://x.com/DumbFckFinder/status/2017682934732623918\" target=\"_blank\">account</a> <a href=\"https://x.com/DumbFckFinder/status/2017584657513255313\" target=\"_blank\">shared</a> <a href=\"https://x.com/DumbFckFinder/status/2017626573164442018\" target=\"_blank\">the</a> fake photos Jan. 31 and all of them had a \"DFF\" watermark. It also admitted one of the images was fake, <a href=\"https://x.com/DumbFckFinder/status/2017708417763447259\" target=\"_blank\">saying</a>, \"Damn you guys failed. I purposely made him a baby which would technically make this pic 34 years old. Yikes.\"</p>\n<div class=\"artembed\"><img src=\"https://static.politifact.com/politifact/photos/Graphic_showing_22DFF22_watermark.001.jpeg\" /></div>\n<p><em>(Screenshot of AI-images with DFF watermarks)</em></p>\n<p>PolitiFact uploaded the three images shared by DFF to Gemini, Google’s AI tool. It found the images contain the SynthID watermark for images created or edited by the tool. It's not visible looking at the images, but Google's technology can detect it.</p>\n<p>We rate the claim that images shared on X are real photos of Mamdani as a child with his mother and Epstein Pants on Fire! </p>",
    "url": "http://www.politifact.com/factchecks/2026/feb/02/tweets/AI-photos-Mamdani-Epstein-Nair/",
    "publication_date": "Mon, 02 Feb 2026 22:12:41 +0000",
    "date_gathered": "2026-02-24T04:09:44.406213",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Donald Trump - Trump says the U.S. leads China ‘by a lot’ in AI. Experts say that lead is measured by a few months",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-half-true/a70736af2900ee34890c1c7a83bfc1c8.jpg\" /><p>President Donald Trump has lauded the United States’ position in its artificial intelligence race against rival China.</p>\n<p>\"We're leading China by a tremendous amount,\" he <a href=\"https://www.youtube.com/watch?v=HsXaqi-uqPI\" target=\"_blank\">said</a> Jan. 13 in an interview with CBS Evening News anchor Tony Dokoupil. </p>\n<p>\"The AI is unbelievable, what's happening there. We're leading China by a lot,\" he <a href=\"https://www.youtube.com/watch?v=e-OgmgLv_IQ\" target=\"_blank\">said</a> Jan. 16 in Mar-a-Lago. And during his <a href=\"https://www.youtube.com/watch?v=qo2-q4AFh_g\" target=\"_blank\">Jan. 21 speech</a> at the World Economic Forum in Davos, Switzerland, he said it again: \"We’re leading the world in AI by a lot. We’re leading China by a lot.\"</p>\n<p>The U.S. has a lead, but it isn’t cozy.</p>\n<p>The United States leads China in AI chip production and market control. AI chips are essential — they are <a href=\"https://www.nytimes.com/2023/08/21/technology/nvidia-ai-chips-gpu.html\" target=\"_blank\">tailored to do tasks such as image and speech recognition</a>. </p>\n<p>China is a formidable competitor in other areas, including the quality of its workforce and electricity generation that powers data centers. </p>\n<p>By some measures, the two countries are neck-and-neck, and recent changes in U.S. export policy may benefit China. But Trump has also whittled down industry regulation, empowering U.S. AI companies to expand with fewer restrictions.</p>\n<p>Experts told PolitiFact that China is just months behind the U.S. on AI. White House AI and crypto czar David Sacks said in <a href=\"https://www.businessinsider.com/david-sacks-chip-export-rules-weaken-us-tech-dominance-china-2025-6\" target=\"_blank\">June</a> that Chinese AI models are \"three to six months behind\" the U.S.</p>\n<p>On Jan. 21 <a href=\"https://www.youtube.com/watch?v=Xb6smlRvQBk\" target=\"_blank\">at the World Economic Forum</a>, when asked how he views the AI race now, Sacks said, \"I still think that the U.S. is in the lead. I think that our models are better, our chips are better. But they do have other advantages,\" including its power generation.</p>\n<p>Matt Sheehan, senior fellow at the Carnegie Endowment for International Peace’s Asia program, estimates after a U.S. company releases the \"best new model,\" a Chinese company will match it in roughly six to 18 months.</p>\n<p>Key AI industry leaders have offered similar assessments. In <a href=\"https://youtu.be/pE6sw_E9Gh0?t=4287\" target=\"_blank\">September</a>, Jensen Huang, CEO of U.S. chipmaker Nvidia, said China is \"nanoseconds\" behind the U.S. Google DeepMind CEO Demis Hassabis said <a href=\"https://www.youtube.com/watch?v=BbIaYFHxW3Y\" target=\"_blank\">Jan. 20</a> that Chinese models are six months behind.</p>\n<h2>How the U.S. leads China on AI chips</h2>\n<div class=\"artembed\"><img src=\"https://static.politifact.com/politifact/photos/Donald_Trump_and_Nvidia_CEO_Jensen_Huang_4-30-2025.jpg\" /></div>\n<p><em>President Donald Trump listens as Nvidia CEO Jensen Huang speaks during an event about investing in America in the Cross Hall of the White House, April 30, 2025, in Washington. (AP)</em></p>\n<p>California-based Nvidia dominates AI chip manufacturing, becoming the world’s first company to <a href=\"https://www.nbcnews.com/business/markets/nvidia-record-five-trillion-ai-bubble-rcna240447\" target=\"_blank\">reach a $5 trillion market value</a>. Under Trump, the U.S. has loosened regulations to allow China access to more advanced Nvidia chips, which could narrow the gap between U.S. and China.</p>\n<p>\"There's a really big difference, both in terms of the quality of the chips (the U.S.) can make and the quantity of the chips we can make,\" said Chris McGuire, Council on Foreign Relations senior fellow for China and emerging technologies.</p>\n<p>U.S. law has regulated exports of certain advanced chips, including banning Nvidia from selling Blackwell, its most powerful chip, to China. In July, the Commerce Department altered its rules, allowing Nvidia to sell China a less advanced chip. U.S. <a href=\"https://www.justice.gov/opa/pr/us-authorities-shut-down-major-china-linked-ai-tech-smuggling-network\" target=\"_blank\">authorities</a> have nonetheless found people smuggling the company’s more advanced chips into China.</p>\n<p>On Jan. 13, the Trump administration <a href=\"https://www.reuters.com/world/asia-pacific/us-eases-regulations-nvidia-h200-chip-exports-china-2026-01-13/\" target=\"_blank\">allowed</a> Nvidia to sell China its second most powerful AI chips, H200s, with restrictions. Nvidia cannot ship more than 50% of the overall chips it sells to American customers. Trump also imposed a <a href=\"https://www.whitehouse.gov/fact-sheets/2026/01/fact-sheet-president-donald-j-trump-takes-action-on-certain-advanced-computing-chips-to-protect-americas-economic-and-national-security/\" target=\"_blank\">25% tariff</a> on the H200s.</p>\n<p>Experts believe the policy change will negatively affect the United States’ lead. Selling H200 chips \"erodes some of the U.S. advantage in terms of AI chips,\" Sheehan said. \"The overall trend toward training larger and more compute-intensive models tends to favor the U.S. because of its remaining advantage in terms of access to chips.\"</p>\n<p>The Institute for Progress, a think tank, <a href=\"https://ifp.org/should-the-us-sell-hopper-chips-to-china/#h200-or-h100-exports-would-substantially-add-to-china-s-supply-of-advanced-ai-compute\" target=\"_blank\">estimated</a> that if more advanced chips like the H200s are exported without restrictions, the U.S. advantage in computational resources would plummet. \"I think export controls are the only lever that the U.S. government has to slow China down,\" McGuire said. </p>\n<h2>China has kept pace and may benefit from new U.S. policies</h2>\n<div class=\"artembed\"><img src=\"https://static.politifact.com/politifact/photos/DeepSeek_screen_01-28-2025.jpg\" /></div>\n<p><em>The page for the smartphone app DeepSeek is seen on a smartphone screen in Beijing, Jan. 28, 2025. (AP)</em></p>\n<p>Chinese companies have built competitive large language models — AI models trained to mimic language and perform tasks such as <a href=\"https://www.politifact.com/article/2023/jun/19/what-is-generative-ai-and-why-is-it-suddenly-every/\">summarization, translation and chat</a>.</p>\n<p>U.S. models include OpenAI’s ChatGPT, Google’s Gemini, xAI’s Grok and Anthropic’s Claude. Chinese companies including DeepSeek, Alibaba and Moonshot have released competitive models of their own.</p>\n<p>One research institute <a href=\"https://epoch.ai/data-insights/us-vs-china-eci\" target=\"_blank\">analysis</a> found that since 2023, Chinese models have trailed U.S. models by seven months on average.</p>\n<p>Sheehan pointed to leaderboards such as LMArena, developed by University of California, Berkeley researchers, that rank large language models on how well they respond to text, image and coding prompts. U.S. models dominate the <a href=\"https://lmarena.ai/leaderboard\" target=\"_blank\">LMArena leaderboard</a>, but Chinese models are not far behind. Ernie 5.0, developed by the Chinese company Baidu, ranked ninth overall, as of Jan. 29.</p>\n<p>In terms of adoption, experts said it’s hard to tell which models are most favored by companies seeking to incorporate AI, as the available metrics are generally unreliable.</p>\n<h2>China has advantages on talent and electricity generation</h2>\n<p>The U.S. may have a \"slight edge\" on research talent, Sheehan said, but \"China has a large base of domestic talent.\" Researchers <a href=\"https://archivemacropolo.org/interactive/digital-projects/the-global-ai-talent-tracker/\" target=\"_blank\">found</a> that as of 2022, 57% of the most elite AI researchers worked in the U.S. But China is the top country of origin among top-tier AI researchers in the U.S. </p>\n<p>\"The U.S.’ traditional ability to attract the world’s top talent gives it powerful advantages to train and apply AI models,\" said Joseph Webster, senior fellow at the Atlantic Council’s Global Energy Center and Indo-Pacific Security Initiative.</p>\n<p>In his second term, Trump <a href=\"https://www.theguardian.com/us-news/2025/aug/14/trump-cuts-science-research-ai\" target=\"_blank\">cut research funding</a> and implemented a sweeping immigration crackdown that has negatively <a href=\"https://www.insidehighered.com/news/quick-takes/2026/01/13/trump-admin-says-it-revoked-8000-student-visas\" target=\"_blank\">affected</a> international students.</p>\n<p>China also holds the advantage in electricity generation that powers data centers.</p>\n<p>\"The U.S. power grid poses major and growing challenges to U.S. AI efforts,\" Webster said. Insufficient electricity can impede AI training and inference, which refers to <a href=\"https://www.ibm.com/think/topics/ai-inference\" target=\"_blank\">running AI models to make predictions based on new data</a>.</p>\n<p>China has more open-source AI models, making it easier for companies to adopt models for free, Sheehan said. U.S. AI companies typically charge for access to their premium models.</p>\n<p>When it comes to scaling AI, the United States’ relations with other major technology players, such as Taiwan, Japan, South Korea and the Netherlands, give it a boost, Webster said.</p>\n<p>But the U.S.’ lead could be eroded. \"If the U.S. sells advanced chips to (China), damages its ties with other democracies, prevents top AI talent from entering the U.S., or damages its research universities, it could surrender key technology advantages it has traditionally enjoyed,\" Webster said.</p>\n<h2>Our ruling</h2>\n<p>Trump said that in AI, the U.S. is \"leading China by a lot.\"</p>\n<p>The U.S. has a lead over China in model capability, but key AI industry leaders and experts say China is only a few months behind. </p>\n<p>The U.S.’ lead is sustained by the quality and quantity of its AI chips, which are restricted for sale in China. Recently, the Trump administration loosened those controls.</p>\n<p>China has advantages when it comes to talent and electricity for data centers.</p>\n<p>The statement is partially accurate but leaves out important details. We rate it Half True. ​</p>",
    "url": "http://www.politifact.com/factchecks/2026/jan/29/donald-trump/trump-says-the-us-leads-china-by-a-lot-in-ai-exper/",
    "publication_date": "Thu, 29 Jan 2026 19:23:42 +0000",
    "date_gathered": "2026-02-24T04:09:44.406217",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "Jared Moskowitz - Under Trump, more FEMA disaster assistance applications are in limbo for longer",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-mostly-true/b89e6c69bebfa0e3868d4cdccbafe965.jpg\" /><p>A few days before <a href=\"https://www.reuters.com/business/environment/americans-hunker-down-help-each-other-under-blizzard-brutal-cold-2026-01-26/\" target=\"_blank\">a massive winter storm</a> dumped snow and ice on a large swath of the country, disrupted travel and killed more than 30 people, a Florida congressman warned that the Federal Emergency Management Agency is letting disaster assistance requests pile up. </p>\n<p>\"As the only former Emergency Management Director in Congress, it is my responsibility to sound the alarm that FEMA is being dismantled by (Homeland Security) Secretary Kristi Noem,\" U.S. Rep. Jared Moskowitz, D-Fla., wrote <a href=\"https://x.com/RepMoskowitz/status/2014342825651953809\" target=\"_blank\">Jan. 22 on X. </a>\"<a href=\"https://x.com/RepMoskowitz/status/2014342825651953809\" target=\"_blank\">FEMA’s backlog of unanswered disaster assistance applications has exploded to the largest in its history</a>.\" Moskowitz was Florida’s Division of Emergency Management director from 2019 to 2021. </p>\n<p>President Donald Trump has floated abolishing FEMA, citing the agency’s <a href=\"https://www.taxpayer.net/disaster/rebuilding-fema-without-repeating-the-past/\" target=\"_blank\">struggle to deliver timely disaster assistance</a>, and in his second term he’s used executive actions <a href=\"https://www.govexec.com/management/2025/06/cuts-fema-and-other-agencies-will-lead-slow-disaster-response-former-administrator-says/406362/#:~:text=FEMA%20has%20shed%20around%202%2C000,responders%20and%20full%2Dtime%20personnel.\" target=\"_blank\">to cut staff</a> and <a href=\"https://www.npr.org/2025/04/02/nx-s1-5345777/trump-states-fema-funds\" target=\"_blank\">freeze</a> <a href=\"https://www.eenews.net/articles/trump-quietly-halts-money-for-preventing-disaster-damage/\" target=\"_blank\">funds</a>. A directive from Noem requiring her sign off for any expenditure over $100,000 has also <a href=\"https://thehill.com/policy/energy-environment/5656887-fema-backlog-grants-noem-review/\" target=\"_blank\">delayed</a> <a href=\"https://www.nytimes.com/2026/01/27/climate/fema-aid-kristi-noem.html\" target=\"_blank\">billions</a> in grants and loans.</p>\n<p>But is Moskowitz correct that the agency has the largest backlog of pending d<a href=\"https://x.com/RepMoskowitz/status/2014342825651953809\" target=\"_blank\">isaster assistance applications</a> in its 47-year history?  </p>\n<p>Taken together, the current list of pending disaster applications, independent analyses and information from disaster management experts show that the backlog is larger than is typical, with applications awaiting approval for longer periods of time compared with the last several decades. </p>\n<p>FEMA declined to answer our questions. Moskowitz’ office also did not respond to our request for evidence supporting his statement.</p>\n<h2>Disaster declaration applications face longer limbo under second Trump administration</h2>\n<p>FEMA’s <a href=\"https://disastercenter.com/FEMA%20Daily%20Operation%20Brief.pdf\" target=\"_blank\">daily operations briefing</a> provides an overview of potential weather threats and ongoing disasters. </p>\n<p>Its <a href=\"https://disastercenter.com/FEMA%20Daily%20Operation%20Brief.pdf\" target=\"_blank\">Jan. 28 report</a> shows 18 pending disaster declaration requests. Eleven are more than a month old. The requests are typically submitted through FEMA regional offices before being sent to the president for final approval.</p>\n<p>A <a href=\"https://apnews.com/article/fema-natural-disaster-declaration-trump-7506ce6a68543f4515eabe7992d9a5a0\" target=\"_blank\">September analysis</a> by The Associated Press examined how the current backlog compares with the last 37 years — covering the majority of FEMA’s 47-year history. During the agency’s first decade, the disaster declaration approval process wasn’t fully implemented and large disasters were relatively few and far between.<br />\n<br />\nThe AP’s analysis found that, on average, it took less than two weeks for a major disaster declaration to be granted by presidents throughout the 1990s and early 2000s. During the last decade, under presidents from both political parties, that rose to about three weeks. In Trump’s second term so far, approvals are taking more than a month, on average.</p>\n<p>White House spokesperson Abigail Jackson <a href=\"https://apnews.com/article/fema-natural-disaster-declaration-trump-7506ce6a68543f4515eabe7992d9a5a0\" target=\"_blank\">told the AP</a> Trump was making sure federal dollars were \"spent wisely to supplement state actions, not replace them,\" during disasters. </p>\n<p>\"President Trump provides a more thorough review of disaster declaration requests than any Administration has before him. Gone are the days of rubber stamping FEMA recommendations — that’s not a bug, that’s a feature,\" Jackson said. </p>\n<p>Former FEMA officials, including people who helped process these types of declarations, told PolitiFact the backlog of pending applications is substantial, and was longer than average <a href=\"https://www.eenews.net/articles/trump-who-called-fema-very-slow-has-failed-to-act-on-17-disaster-requests/\" target=\"_blank\">at different points</a> in 2025.  </p>\n<p>The processing time is most important, said Elizabeth Zimmerman, a former FEMA administrator under President Barack Obama. \"A reasonable amount of time for approval should really be no more than two weeks.\" </p>\n<p>Zimmerman said that could change with the type of request and how much money applicants are seeking, but even considering those factors, the current process is slower than normal.</p>\n<p>There may be contributing factors that are out of Trump’s control. The process for assessing natural disasters has become more complex over time and<a href=\"https://www.politifact.com/article/2024/oct/17/ron-desantis-dismisses-climate-change-link-to-stro/\"> disasters have become</a> <a href=\"https://www.nytimes.com/2024/10/31/climate/climate-disasters-cop29-election.html\" target=\"_blank\">more frequent and intense</a> because of climate change.</p>\n<p>Still, these delays mean people have to wait to receive federal aid for temporary housing and home repairs. It can also impede recovery efforts as local governments don’t know when or whether they will receive federal reimbursements.</p>\n<h2>Significant delays in disaster payouts </h2>\n<p>News reports throughout 2025 documented a <a href=\"https://www.wral.com/news/state/fema-delays-nc-counties-brink-helene-recovery-nov-2025/\" target=\"_blank\">slew of</a> <a href=\"https://missouriindependent.com/2025/07/21/federal-disaster-aid-is-uncertain-for-states-even-as-texas-floods-underscore-need/\" target=\"_blank\">delays</a>, <a href=\"https://governor.wa.gov/news/2025/governor-bob-ferguson-statement-denial-federal-disaster-funds\" target=\"_blank\">denials</a> <a href=\"https://www.govtech.com/em/disaster/fema-cuts-300m-for-florida-hurricane-flooding-relief\" target=\"_blank\">and</a> <a href=\"https://marylandmatters.org/2025/05/27/fema-cancels-1-billion-for-flood-prevention-projects-in-chesapeake-bay-region/\" target=\"_blank\">cancellations</a> of federal disaster funds as states waited for information on new policy proposals from FEMA.</p>\n<p>\"There's a lot of anecdotal information that things are being held up, and it’s adversely affecting these communities,\" said Michael Coen, a former FEMA chief of staff in the Obama and Biden administrations. \"I have heard from multiple FEMA employees who are frustrated over a lot of projects that are being held up by the secretary’s office.\" </p>\n<p><a href=\"https://www.wsj.com/politics/policy/fema-delay-disaster-response-st-louis-1152f03c?st=9aXtmj&amp;reflink=desktopwebshare_permalink\" target=\"_blank\">The Wall Street Journal,</a> citing internal government documents and conversations with FEMA employees, <a href=\"https://www.wsj.com/politics/policy/fema-delay-disaster-response-st-louis-1152f03c?st=9aXtmj&amp;reflink=desktopwebshare_permalink\" target=\"_blank\">reported</a> in September that many of FEMA’s core functions have ground to a halt under the Trump administration, and contracts and grants haven’t been approved because of new bureaucratic hurdles.</p>\n<p>\"A wave of senior staff departed the agency when Elon Musk’s Department of Government Efficiency offered buyouts, taking decades of experience with them,\" <a href=\"https://www.wsj.com/politics/policy/fema-delay-disaster-response-st-louis-1152f03c?st=9aXtmj&amp;reflink=desktopwebshare_permalink\" target=\"_blank\">the Journal reported.</a> Another 400 FEMA employees were routed to work at Immigration and Customs Enforcement as the administration started dismantling FEMA’s disaster-response infrastructure.</p>\n<p>In a <a href=\"https://www.fema.gov/sites/default/files/documents/fema_ocfo_disaster-relief-fund-report_092025.pdf\" target=\"_blank\">Sept. 15 report</a>, FEMA said it withheld $10.9 billion in disaster payments to 45 states in the final months of fiscal year 2025, which ended Sept. 30. <a href=\"https://www.eenews.net/articles/fema-canceled-11b-in-disaster-payments-to-states/#:~:text=The%20$11%20billion%20delay%20was,asking%20Congress%20for%20additional%20money\" target=\"_blank\">News outlets</a> and <a href=\"https://www.naco.org/news/fema-delays-11-billion-state-disaster-reimbursements\" target=\"_blank\">local government groups</a> said the money was to reimburse states for emergency costs related to the COVID-19 pandemic. </p>\n<p>FEMA said it \"shifted\" the reimbursements to fiscal year 2026 but did not say when the money would be paid. In response to <a href=\"https://www.nytimes.com/2025/10/16/climate/fema-disaster-recovery-trump.html\" target=\"_blank\">news stories</a> about the funds, FEMA said <a href=\"https://www.fema.gov/press-release/20251018/fema-refutes-misrepresentation-disaster-relief-funding-recent-media-coverage\" target=\"_blank\">in an Oct. 18 press release</a> that disaster relief funds \"do not expire\" and that the outstanding payments \"are actively being processed and are not canceled.\" </p>\n<p><a href=\"https://thehill.com/policy/energy-environment/5656887-fema-backlog-grants-noem-review/\" target=\"_blank\">The Hill</a> reported in December that more than $900 million in FEMA grants and loans awaited Noem’s approval under her <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.rid.59597/gov.uscourts.rid.59597.59.8.pdf\" target=\"_blank\">new policy</a> to personally review certain expenditures. The New York Times recently <a href=\"https://www.nytimes.com/2026/01/27/climate/fema-aid-kristi-noem.html\" target=\"_blank\">reported an even larger number</a> — $17 billion — in funds that have faced unusually long delays because of the requirement.</p>\n<p>The bottleneck, <a href=\"https://www.nytimes.com/2026/01/27/climate/fema-aid-kristi-noem.html\" target=\"_blank\">The New York Times found</a>, \"includes money that had already been approved by regional FEMA offices for things like debris removal, and repairs to roads, bridges and water and sewer systems.\"</p>\n<h2>Our ruling</h2>\n<p>Moskowitz said FEMA’s backlog of unanswered disaster assistance applications \"has exploded to the largest in its history.\"</p>\n<p>We were unable to quantify whether the current backlog is the largest in agency history; publicly available data is limited, and no public database provides historical comparisons.</p>\n<p>But the available evidence shows Moskowitz is largely on target.</p>\n<p>As of Jan. 28, FEMA listed 18 pending disaster declarations awaiting Trump’s approval. Eleven are more than a month old and some date back to October. Disaster management experts said the backlog is particularly large compared with what’s typical and that requests are sitting longer than normal. </p>\n<p>A September 2025 AP analysis found that over the last 37 years — which covers most of FEMA’s existence and the timeframe when it implemented its current assistance system — disaster declarations were typically approved in three weeks or less. Approvals are taking more than a month, on average, so far during Trump’s second term.  </p>\n<p>Moskowitz's statement is accurate but needs additional information. We rate it Mostly True. </p>",
    "url": "http://www.politifact.com/factchecks/2026/jan/28/jared-moskowitz/FEMA-disaster-declaration-backlog-Trump/",
    "publication_date": "Wed, 28 Jan 2026 22:05:30 +0000",
    "date_gathered": "2026-02-24T04:09:44.406221",
    "country": "US",
    "organization": "PolitiFact"
  },
  {
    "title": "JD Vance - JD Vance wrong that Minneapolis ranks No. 1 in unauthorized immigrants",
    "content": "<img src=\"https://static.politifact.com/CACHE/images/politifact/rulings/meter-false/b66409be4b4b0cf7a7054c1f752359b2.jpg\" /><p>The U.S. Department of Homeland Security surged 3,000 federal immigration agents to Minnesota — a state more than a thousand miles from the southern border that’s not known for having a sizable population of immigrants in the U.S. illegally — calling it the largest such operation ever. Many people have wondered: Why Minnesota?</p>\n<p>Vice President JD Vance, who visited Minneapolis on Jan. 22 to defend federal immigration enforcement, gave a misleading answer.</p>\n<p>\"Right now, we’re focused on Minneapolis because that’s where we have the highest concentration of people who have violated our immigration laws, and that’s also, frankly, where we see the most assault of our law enforcement officers,\" <a href=\"https://www.whitehouse.gov/videos/vice-president-jd-vance-delivers-remarks-in-minneapolis-minnesota-jan-22-2026/\" target=\"_blank\">Vance said</a> during a press conference.</p>\n<p>The vice president’s visit to Minneapolis came after an Immigration and Customs Enforcement agent fatally shot Renee Good on Jan. 7 but before a Border Patrol agent fatally shot <a href=\"https://www.politifact.com/article/2026/jan/26/fact-check-Trump-official-Noem-Alex-Pretti-death/\">Alex Pretti </a>on Jan. 24. Both were U.S. citizens.</p>\n<p>PolitiFact asked spokespersons for the White House and Homeland Security for Vance’s evidence about Minneapolis having the \"highest concentration of people who have violated our immigration laws\" and received no response. (We did not examine data on assault of officers by jurisdiction.)</p>\n<p>Dozens of other U.S. metro areas have a higher concentration of immigrants in the U.S. illegally compared with the Minneapolis metro area. </p>\n<h2>Immigrant populations by metro area </h2>\n<p>There are about 130,000 immigrants who are in the U.S. illegally in Minnesota, according to 2023 Pew Research Center data, the most recent year available.</p>\n<p>They represent about 2% of the state’s population and about <a href=\"https://www.pewresearch.org/race-and-ethnicity/2025/08/21/u-s-unauthorized-immigrant-population-reached-a-record-14-million-in-2023/\" target=\"_blank\">1% of the unauthorized population nationwide</a>. </p>\n<p>The Migration Policy Institute, a nonpartisan group, estimated a slightly smaller number for Minnesota of about <a href=\"https://www.migrationpolicy.org/data/unauthorized-immigrant-population/state/MN\" target=\"_blank\">100,000 </a>immigrants in the U.S. illegally.</p>\n<p>Government officials and nonpartisan groups that track immigration data do not have data showing the number of immigrants the U.S. illegally exclusively in the city of Minneapolis. Instead, they use metro area data; Pew Research Center uses a 15-county area that includes Minneapolis and St. Paul.</p>\n<p>Jeffrey Passel, a Pew Research Center demographer, said the overall U.S. population of immigrants in the country illegally was probably slightly larger in 2025 than the 2023 data reflects, but there was not a large influx in the Minneapolis metro area.</p>\n<p>Pew estimated about 90,000 unauthorized immigrants in the Minneapolis metro area. Dozens of other metro areas have larger numbers, Passel said.</p>\n<p>Immigrants in the country illegally represent about 2.4% of the Minneapolis metro area’s population. That’s smaller than the 4.1% nationally, Passel said. In major metro areas such as Miami and Houston, the share of immigrants in the U.S. illegally was at least four times as big as the share in Minneapolis. Metro areas such as Provo, Utah; Baton Rouge, Louisiana; Hartford, Connecticut; and Tulsa, Oklahoma, had higher percentages than the Minneapolis metro area.</p>\n<div class=\"artembed\"><a></a><div class=\"infogram-embed\"></div></div>\n<h2>Somalis are a small percentage of the Minnesota population</h2>\n<p>President Donald Trump has said the Minnesota focus is because of a fraud scandal involving dozens of Somalis. Somalis represent about 2% of Minnesota’s population. Somalis <a href=\"https://www.mnhs.org/mnopedia/search/index/somali-and-somali-american-experiences-minnesota\" target=\"_blank\">came to Minnesota </a>starting in the 1990s fleeing a civil war, some as refugees while others were sponsored by family members or moved from other states. Most are U.S. citizens, either through naturalization or birth.</p>\n<p>Since 2022, federal prosecutors have charged about <a href=\"https://www.politifact.com/factchecks/2026/jan/08/pam-bondi/DOJ-Minnesota-fraud-Trump-Biden-Somalis/\">98 people</a> with defrauding the federal government. The majority have been convicted while many cases remain pending.</p>\n<h2>Our ruling</h2>\n<p>Vance said, \"Right now we're focused on Minneapolis because that's where we have the highest concentration of people who have violated our immigration laws.\" </p>\n<p>Vance provided no evidence to back up his statement.</p>\n<p>Immigrants in the country illegally represent about 2.4% of the Minneapolis metro area’s population. Dozens of metro areas have larger numbers of immigrants in the U.S. illegally than the Minneapolis metro area, including smaller metro areas across the country. </p>\n<p>We rate this statement False. </p>\n<p><em>Chief Correspondent Louis Jacobson contributed to this fact-check.</em></p>\n<p><em><strong>RELATED</strong></em>: <a href=\"https://www.politifact.com/article/2026/jan/16/Frey-ICE-police-Minneapolis-context/\">In Context: What did Minneapolis Mayor Jacob Frey say about police fighting ICE?</a></p>\n<p><em><strong>RELATED</strong></em>: <a href=\"https://www.politifact.com/article/2026/jan/26/fact-check-Trump-official-Noem-Alex-Pretti-death/\">Fact-check: Trump officials’ statements about Alex Pretti’s fatal shooting by Border Patrol agent</a></p>",
    "url": "http://www.politifact.com/factchecks/2026/jan/28/jd-vance/why-ice-in-Minneapolis-immigration-population/",
    "publication_date": "Wed, 28 Jan 2026 16:50:59 +0000",
    "date_gathered": "2026-02-24T04:09:44.406224",
    "country": "US",
    "organization": "PolitiFact"
  }
]