[
  {
    "title": "Cash-starved and censored, America’s student newspapers are fighting to survive",
    "content": "Business & Work Educators & Students Saj Sundaram, a student journalist for the University of Oregon's Daily Emerald, covers protests in downtown Eugene in January 2026. (Courtesy: Robert Scherle) By: Barbara Allen February 23, 2026 An unabridged version of this article was originally published in the Student Press Report , a national news desk covering student media and journalism education in higher ed. Andrew Frazier expected to spend his senior year as the sports editor of The Vista, the student newspaper at the University of Central Oklahoma. Instead, he became editor-in-chief of a new student-run publication, The Independent View , after his university said printing The Vista wasn’t worth the $12,000 annual cost. (UCO’s operating budget in 2024-25 was about $177 million.) When donors offered to cover the expense and the university still said no, free press advocates shouted censorship. They said the UCO students were being punished for factual reporting that didn’t frame the university in a positive light. “(This) raised serious press freedom questions for us,” he said. “Without a clear digital transition plan, the move felt less like modernization and more like retaliation, which is why we chose to build something independent.” The cover of a recent Independent View issue. Across the country, student newsrooms are facing a similar squeeze: shrinking budgets and increasing pressure from the universities that fund them. Student press advocates say those forces — financial strain and institutional control — are reshaping campus journalism and, in some cases, threatening to destroy independent student media. Silence is the point The Student Press Law Center, a 51-year-old nonprofit that defends and advances student journalists’ free press rights, said it’s seen an alarming uptick in calls over the past few years. (The Student Press Law Center is a funder of the Student Press Report.) “Censorship has always been our No. 1 reason why people reach out to our legal hotline,” said Gary Green, executive director of SPLC. Calls rose 42% from the 2022-23 school year to 2024-25, he said. One of several instigators of that surge was the March 2025 detention of Rümeysa Öztürk, an international student at Tufts University, after she wrote a pro-Palestinian op-ed in The Tufts Daily. That and other immigration enforcement actions in spring 2025 sparked panic — and self-censorship — among sources and staff members. In April 2025, SPLC issued a first-of-its-kind student media alert , urging students to “revisit their policies on takedown requests and anonymous sources, particularly for those whose immigration status may make them targets for their lawful speech.” Student Press Law Center executive director Gary Green speaks at the SPLC 50th anniversary celebration at The New York Times in October 2024. (Photo by Ryan Murphy) Across the country, conflicts between universities and student newsrooms have followed familiar patterns: Students started their own independent publication at the University of Texas at Dallas after the school removed newspaper racks, demoted their adviser and fired the editor-in-chief . Students at the University of Central Oklahoma created their own independent news publication after their print budget was killed and editors were stripped of decision-making power. The University of Alabama shuttered two magazines that officials felt might conflict with federal DEI rollbacks. Morgan State in Baltimore made an official policy requiring students, faculty and staff to run all interview and filming requests through the university’s public relations office. Staffers at The Exponent newspaper at Purdue got a surprise email from the university stating that after a 50-year relationship, the university would no longer partner with distribution efforts on campus . But the biggest student media news of 2025 came from one of the most awarded, respected student newspapers in the country. In October, Jim Rodenbush was fired as director of student media at Indiana University after he refused to enforce an administrative mandate: no news content in the printed homecoming edition. IU Media School dean David Tolchinsky wrote in Rodenbush’s termination letter, “Your lack of leadership and ability to work in alignment with the university’s direction for the Student Media Plan is unacceptable.” Rodenbush said he believed enforcing the directive would amount to censorship and refused to do so. “Because it was the right thing to do,” he said. “I feel like there’s a responsibility to maintain standards and ethics, particularly in student journalism, because this is the future of the profession.” Indiana Daily Student co-editors in chief Mia Hilkowitz and Andrew Miller address their newsroom staff after the university fired student media director Jim Rodenbush and canceled the print production of the IDS. (Courtesy: Indiana Daily Student) University officials disputed that characterization. Chancellor David Reingold said the decision was unrelated to editorial content and stemmed from personnel and budget considerations. Rodenbush has filed suit alleging violations of due process and free speech. Advisers say the case illustrates how fragile student newsrooms can be when universities control the funding. “A lot of student media are in the red, and really at an existential crisis,” Green said. “They’re relying more and more on university subsidies, and universities, in many cases, are pulling their subsidies.” Universities may eliminate funding entirely or reduce it gradually over time, he said. If cuts are tied to coverage, that raises constitutional concerns, but proving it can be difficult. Running on empty “Gutted,” “eviscerated” and “absent” are some of the words student media leaders use to describe their operating budgets since the 2008 recession. “We’ve lost entire categories of advertisers, we receive less revenue from our digital products than our print newspapers could bring in, and it’s much harder to compete with Google and social media platforms for new dollars,” said Chrissy Murray, CEO at Duke Student Publishing Company/The Chronicle. Student journalists working inside the offices of The Duke Chronicle. (Courtesy: Chrissy Murray) Some outlets have tried to replace lost revenue with fundraising, memberships and side projects such as creative services. But many remain financially fragile. A 2024 study by the University of Florida’s Brechner Center for the Advancement of the First Amendment found that more than half of student news outlets receive direct funding from their universities, and nearly 60% are advised by university employees. That dependence can create tension. “Financial ties to the institution can be problematic for student journalists for several reasons,” the study noted. “Students who challenge the wrong person in administration are vulnerable to lose funding for their student press if there aren’t several safety guards in place.” Lead author Jessica Sparks, now a professor at Auburn, said the concerns she wrote about two years ago seem even more pressing now. “One of the biggest things that clicked for me… was the idea that there’s no such thing as a truly independent institution in this realm,” she said. “Instead, what we’re looking at is, how vulnerable are you as a publication to the pressure or censorship? And what can you do to mitigate that vulnerability?” Other data underscores how sharply the business model has eroded. An analysis of nonprofit student newsrooms found advertising revenue — once the dominant income source — fell from 91% of revenue in 2006–07 to 52% in 2022–23. Student media now faces structural disadvantages, said Bob Buday, one of the researchers: high student turnover, university administrators cutting their funding, and a lack of best-practice research that keeps U.S. companies humming along. “College media has not had the same thing,” he said. What successful student media often does have, however, is strong professional leadership, he said. How to stay alive At The Duke Chronicle, a housing site and robust fundraising have helped the paper stay afloat. “(Student media) has lost a ton of revenue in the last 15 years because of print,” Murray said. “So few of us have refilled those buckets with other things, or we did it at a lower level. Now we’re at a point where we’re not sure if those buckets are going to hold in the economic downturn and what comes next. Then layer onto that the reader habits of undergraduates. … Finding our audiences is going to be really complicated. And I don’t know how many (college) news organizations are up for that challenge.” Murray said newsletter and fundraising efforts have become increasingly important. Duke’s fundraising now makes up 30-35% of its student media’s annual operating budget. Some outlets are also rethinking how they operate. At the University of Illinois, Illini Media reorganized its systems and business model, cutting outdated processes and focusing on sustainable products and partnerships. “When your newspaper or news outlet is 150-some years old, there’s a lot of stuff that you do because you’ve always done it,” said Illini CEO Jake Williams. “And we really spent the last two years breaking as much of that down as possible and making sure that everyone had a clean path to just do what they were here to do.” Partnerships have been key for some organizations. Gerald Johnson said Texas Student Media, once losing about $250,000 a year, has been profitable for more than a decade after investing in events, partnerships and new ventures. “If you’re not making money and you’re a strain on your campus, there certainly is the opportunity for more conversations about, ‘Why are you still here? Maybe you should go away,’” he said. “I think our stability has created some protection from those conversations.” Others emphasize diversifying revenue wherever possible. “Student fees can vanish in a second, grants can be fickle, donors don’t always come through,” said said Piper Jackson-Sevy, co-founder of Flytedesk, a campus advertising network. “The long-term financial health for student media means a healthy balance of several income sources.” (Flytedesk is a funder of the Student Press Report.) Student journalists Nina Kudlacz, Emma DeShon and Izzy Lewis on the field at Memorial Stadium at the University of Nebraska before a Huskers football game in 2025. (Courtesy: The Daily Nebraskan) At the Daily Nebraskan, advertising partnerships with other campus departments have become a major source of revenue, said general manager Allen Vaughan. “The newsroom is the essence of everything that we’re doing,” he said. “We’re just trying to figure out how to fund it.” Why student newsrooms matter College newsrooms are a unique American institution, places for students to experiment, explore careers, find friends and mentors, and test their leadership skills. “From day one, you’re bonding with people from literally all walks of life, in a really cool space doing great work,” said Murray of Duke. “So it’s this mission-driven kind of environment, but it’s also just fun. I’m showing my bias here, but I don’t think that there are leadership positions that have quite this much power in any other place on campus.” For some advisers, the fight to protect student media is personal. Community college — particularly the student media experience — was transformative for Sarah Bennett, a former student journalist who is now a professor of journalism and media studies at Santa Ana College in Southern California. “I didn’t have stable housing, I didn’t have parents really around. Guidance was not there in my upbringing, in my life, and Bud (Little, former Santa Ana adviser) was really the first adult and male figure in my life that was positive and healthy,” said Bennett, who has advised student media for the last 10 years. “I wouldn’t be where I am if it wasn’t for him, and I see so much of myself in my students.” El Don adviser Sarah Bennett (center) works with students at Santa Ana College. (Courtesy: El Don) Steven Chappell, a newspaper adviser at Northwest Missouri State with more than 30 years of experience, said he wants his students to understand their role in fighting back when democracy is under attack. “The foundation of democracy is a strong media. And a strong media starts with strong student journalists who are excited about going into the field of media,” he said. Some students are feeling empowered to fight back. Lindsie Rank, director of campus rights advocacy at the Foundation for Individual Rights and Expression, said that seeing the headlines about protesters, journalists and others standing up for their rights can be inspiring for students. “But, honestly, I’m afraid more students are scared into silence rather than empowered by the current climate,” she said. Student journalists often worry about retaliation even when advocates are ready to help. A rounding error worth fighting for Universities subsidize athletic programs, transportation, housing, the arts and lecture series, the SPLC’s Green said. Student media should not be an exception. “The amount of university funds supporting student media in many cases accounts for no more than a rounding error in the overall budget,” he said. And it’s a critical institution. “Student media plays an integral role in our media ecosystem,” he said. “It’s the pipeline for the future of journalism. People need to have a better understanding of the challenges of student media, and the more we get that news and information out to a broader audience, the more support we can cultivate for the great work the student journalists, their advisers and their faculty do.” The Daily Illini editorial board at a recruitment event in 2026. (Photo by Sarah Slattery) Williams, at The Daily Illini, said that while censorship and money are two huge issues facing student media, he thinks student media practitioners — both students and professionals — need to think bigger and holistically about the role they play in society. “Yes, let’s focus on the tactical. How do we stay in business? That’s very important,” he said. “But also we need to be able to come together and say, ‘This is what we’re doing, and we’re here for this purpose,’ because the threats are only getting bigger.” Correction, Monday, Feb 23 (4 p.m. Eastern): An earlier version of this story misspelled the name of a former University of Texas student media director. His name is Gerald Johnson, not Johnston. Poynter is a nonprofit dedicated to keeping journalism strong, relevant, and grounded in sound values. Join our donor community, the First Amendment Society, to help us continue this critical work. DONATE Tags: campus censorship , campus press freedom , censorship , college media business models , College Newspapers , First Amendment , Future of journalism , higher education , local news pipeline , media industry , media sustainability , press freedom , Student journalism , Student media , Student Press Law Center , university funding Barbara Allen Barbara Allen, the former director of college programming for Poynter, is the founder and director of collegejournalism.org, which provides news coverage, training and consulting for… Barbara Allen Saj Sundaram, a student journalist for the University of Oregon's Daily Emerald, covers protests in downtown Eugene in January 2026. (Courtesy: Robert Scherle) Cash-starved and censored, America’s student newspapers are fighting to survive Shrinking budgets and university pressure are squeezing the next generation of journalists February 23, 2026 Barbara Allen Opinion | Did President Trump call into C-SPAN under a fake name? A caller who sounded remarkably like Trump complained in his favor. C-SPAN says it wasn’t him. But it’s easy to believe he’d do something like that. February 23, 2026 Tom Jones Why Canada still doesn’t have a full-time fact-checking beat Canadian Daniel Dale became a star fact-checking Trump. Back home, the work remains ad hoc. That says a lot about Canadian politics and media. February 23, 2026 Louis Jacobson Why Donald Trump and Barack Obama are suddenly talking about aliens A viral Obama podcast answer about aliens prompted Trump to accuse him of revealing secrets and promise to release UFO files February 23, 2026 Maria Briceño Opinion | Stephen Colbert’s interview with James Talarico finds massive audience online The full clip has garnered “more than twice the daily average” on Colbert’s YouTube channel, according to data. February 20, 2026 Tom Jones Back to News Comments Cancel reply You must be logged in to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed. Start your day informed and inspired. Subscribe Get the Poynter newsletter that's right for you. Media Jobs Sales and Marketing Specialist - SAN ANTONIO, TX (78229) Sinclair Inc WOAI/KABB-TV Spring 2027 T. Anthony Pollner Distinguished Professorship - Missoula, MT (59812) University of Montana Journalism Editorial Page Editor - Charleston, SC (29403) Evening Post Publishing Newspaper Group Program Director, Grants - Remote Tarbell Center for AI Journalism Program Director, Fellowship - Remote Tarbell Center for AI Journalism Membership Coordinator/WUFT-TV/FM and WJUF-FM - Gainesville, FL (32611) University of Florida Assistant Chief Engineer - Chapel Hill, NC (27517) WUNC - FM Director of Marketing & Communication - Needham, MA (02492) Camp Kingswood Assistant Camp Director - Marketing & Communications - Needham, MA (02492) Camp Kingswood Lecturer & Teacher-Special Programs - Graduate School of Journalism - Berkeley, CA (94720) University of California Berkeley Search Media Jobs Advertise a job",
    "url": "https://www.poynter.org/educators-students/2026/student-newspaper-challenges-business-censorship/",
    "publication_date": "Mon, 23 Feb 2026 15:14:10 +0000",
    "date_gathered": "2026-02-24T03:36:13.708430",
    "country": "US",
    "organization": "Poynter"
  },
  {
    "title": "Did President Trump call into C-SPAN under a fake name?",
    "content": "Commentary Newsletters President Donald Trump speaks at the National Governors Association dinner at the White House on Saturday. (AP Photo/Allison Robbert) By: Tom Jones February 23, 2026 This is The Poynter Report, your daily guide to the news about news. Subscribe to get it in your inbox every weekday. There was a bizarre moment on C-SPAN on Friday when the network, during the time when viewers can call in and voice their opinions, took a call from a Republican named “John Barron.” The man was calling in to complain about the Supreme Court’s ruling that President Donald Trump violated federal law by imposing sweeping tariffs across the world. The voice sounded awfully familiar. “John Barron” was either Trump himself or someone doing a spot-on Trump imitation, right down to the sophomoric insults that the president is so fond of. The call lasted 32 seconds before the caller was cut off. During that half-minute, Barron called House Minority Leader Hakeem Jeffries a “dope” and said that Senate Minority Leader Chuck Schumer “can’t cook a cheeseburger.” Not only did the voice sound like Trump, but the name “John Barron” was one Trump commonly used years ago to feed information to reporters. Here’s the clip. The speculation that it was Trump was rampant enough that C-SPAN put out a statement on Sunday that said: “Because so many of you are talking about Friday’s C-SPAN caller who identified himself as ‘John Barron,’ we want to put this to rest: it was not the president. The call came from a central Virginia phone number and came while the president was in a widely covered, in-person White-House meeting with the governors. Tune into C-SPAN for the actual president at the State of the Union Address on Tuesday night.” Was it the president? No, probably not. It might have been a great imitator. It might have even been AI-generated. But part of the issue is that, besides sounding like Trump, it’s not hard to believe that Trump would actually do something like that. State of the Union Trump will give his State of the Union address on Tuesday night. In a column, USA Today Washington bureau chief Susan Page asks, “Trump v. Trump. Which president shows up at the State of the Union?” Page writes, “Will Trump use the opportunity to deliver a forward-looking agenda designed to boost fellow Republicans, some unnerved by Democratic victories in a series of special elections over the past year? Or one that exalts the achievements he claims to have already scored?” Then again, we could see an angry Trump following his Supreme Court loss, among other negative news. Politico’s Megan Messerly and Daniel Desrochers wrote , “Economic growth is flagging . U.S. military assets are massing in the waters around Iran in anticipation of a potential strike that many in the president’s base find odious. A major government agency is shut down over an immigration standoff with Democrats sparked after federal agents killed two U.S. citizens. ‘Make America Healthy Again’ activists are furious over Trump’s order boosting domestic production of the herbicide glyphosate. The scandal surrounding Jeffrey Epstein, the late convicted sex offender, continues to swirl.” The latest Washington Post-ABC News-Ipsos poll released over the weekend shows Trump’s approval rating at 39% and his disapproval rate at 60%, including 47% who strongly disapprove of the job he is doing. The Post notes that the “last time Trump’s disapproval touched 60 percent was shortly after the Jan. 6, 2021, attack on the U.S. Capitol.” Warner Bros. Discovery drama The drama about who is going to end up purchasing Warner Bros. Discovery could come to a head this week. Or at least get a bit clearer. For the past several weeks, it appeared that Netflix had the upper hand in acquiring WBD, which seemed committed to accepting the streaming service’s offer. But Paramount Skydance, run by the Ellison family, refused to give up even after WBD accepted the offer from Netflix. Paramount has mounted a hostile takeover bid, and last week, was given another chance to make its best and final offer — with the window for that expiring today. Any deal would require approval from the Trump administration’s regulators, and much has been made about the cozy relationship Trump has with Paramount CEO David Ellison and his father, Larry. Then, on Friday, Variety’s Todd Spangler wrote , “Paramount Skydance said its potential deal to snap up Warner Bros. Discovery in its entirety has cleared antitrust review at the U.S. Justice Department — despite the fact that David Ellison’s Paramount has repeatedly failed to secure an agreement to acquire Warner Bros. Discovery. WBD for now remains committed to its deal with Netflix.” Meanwhile, Netflix continues to push back against Paramount, with Netflix chief legal officer David Hyman saying in a statement, “The facts are that routine HRS (antitrust) milestones do not signal DOJ approval nor that any decision has been made. They have not secured approvals needed to close and they are a long way from doing so.” It should be noted that Paramount has said it doesn’t have an agreement in place to buy WBD. In a Securities and Exchange Commission filing, it wrote, “The completion of the Transaction remains subject to certain other conditions, including entry into a definitive merger agreement with WBD, shareholder approval and regulatory clearance in other relevant jurisdictions.” O’Brien’s first comments For the first time, Conan O’Brien spoke publicly about the deaths of director Rob Reiner and Reiner’s wife, Michele. The Reiners attended a holiday party at O’Brien’s Brentwood, California, home on Dec. 13. The day after the party, the Reiners were found murdered in their home. Their 32-year-old son, Nick, who was also at that party, has been charged with murdering his parents. There have been reports that Nick acted strangely at the party and he had a loud exchange with his parents. O’Brien told “The New Yorker Radio Hour” podcast and host David Remnick, “To have that experience of saying good night to somebody and having them leave and then find out the next day that they’re gone … I think I was in shock for quite a while afterward. I mean, there’s no other word for it. It’s just very — it’s so awful. It’s just so awful.” O’Brien not only praised Rob Reiner’s immense talent, but also talked about how Rob and Michele were such “lovely people.” O’Brien added, “I think about how Rob felt about things that are happening in the country, how involved he was, how much he put himself out there — and to have that voice go quiet in an instant is still hard for me to comprehend.” NBC’s Olympic hockey coverage scores big The Milan Cortina Winter Olympic Games ended with a bang on Sunday as the United States defeated Canada, 2-1 in overtime, to win the much-anticipated gold medal game in men’s hockey. (Earlier in the Games, the U.S. women’s hockey team defeated Canada by the exact 2-1 overtime score.) It was the U.S. men’s first hockey gold medal since the “Miracle on Ice” team in 1980. The winning goal was scored by center Jack Hughes, who had at least three of his teeth knocked out by a high stick earlier in the game. Hockey players, right? The thrilling hockey game, followed by the closing ceremony, capped a marvelous two-and-a-half weeks for NBC Sports, which is collecting mostly high praise for its coverage. Hockey announcer Kenny Albert has further established himself as the best voice in hockey, firmly replacing the great Mike Emrick, who retired in 2020. Albert’s calls on both the U.S. women’s and men’s overtime winners were universally praised. Not only did Albert make great calls, he (and Sunday’s broadcast partners Eddie Olczyk and Brian Boucher) also knew when to be quiet, letting the player and crowd reactions tell the story for more than a minute without saying a word. Podcaster Bill Simmons was just one of many who took to social media to compliment NBC’s hockey coverage, tweeting , “Thought NBC did an elite job with the hockey broadcasts.” NBC Olympic host Mike Tirico then gave a stirring tribute in his final commentary following the game. Among Tirico’s comments: “So, for all the young people out there, not just the hockey, but all the Olympics you’ve watched, those dreams are formed now. Go chase them and go get them, because our country loves sports, and it brings us together unlike anything else.” Meanwhile, columnist Barry Svrluga offered up his final dispatch for The Washington Post: “Joy and pain for the U.S. and Canada, and a hockey game that had all the feels.” Svrluga, one of the finest sports columnists in the country, was among the recent layoffs at the Post. Despite being laid off, he continued to cover the Olympics and finished with one superb column. Golden messages Yes, social media has its flaws, but one of the great things about it is that you get to hear and read the thoughts of well-known people and celebrities in real time. For example, it was cool to see the reaction of Jim Craig, one of the stars of the 1980 U.S. “Miracle on Ice” team. The goalie of that team tweeted , “Forty-six years ago, we had our shot. They called it a miracle. It wasn’t – it was trust, preparation, and belief. Today, the men and women of @usahockey proved it again. Proud of what USA Hockey was – and what it continues to be.” And Mike Eruzione, the captain of the ’80 team who scored the game-winning goal in the “Miracle on Ice” victory against the then-USSR, tweeted , “What a great Olympic games are men’s and women’s hockey teams congratulations to the men and our women on achieving the ultimate dream and winning a gold medal. How sweet and how nice it was to be here and to watch both your teams accomplish that.” Best moment of the day United States’ hockey player Zach Werenski (8) poses with Noa, the daughter of late player Johnny Gaudreau, after a men’s ice hockey gold medal game between Canada and the United States on Sunday. (AP Photo/Petr David Josek) Perhaps the most poignant and memorable moment of the Olympics was what happened after the U.S. men defeated Canada in the gold-medal hockey game. As the American players gathered on the ice for a team photo, they held up the hockey jersey with the name “Gaudreau” on it — for Johnny Gaudreau, an American hockey player killed in 2024 when he and his brother were hit by a car while bicycling. Gaudreau almost certainly would have been a member of the 2026 American Olympic team. So on Sunday, as the team was getting ready for their photo, American hockey star Matthew Tkachuk held a jersey with Gaudreau’s name, while two other players went into the stands to collect Gaudreau’s small children to be in the team photo. Here’s the touching clip. Sports Illustrated’s Pat Forde wrote about Gaudreau in “Team USA Honored Johnny Gaudreau’s Memory by Making Him an Olympic Champion.” Dissecting what happened at the Post Be sure to check out the latest episode of “The Poynter Report Podcast.” My guest is media reporter Paul Farhi. We did a deep dive into The Washington Post, from the time Jeff Bezos bought the paper to the recent massive layoffs to what the future might look like. Farhi has special insight into the Post, having worked there for more than three decades before accepting a buyout at the end of 2023. Aside from watching on YouTube , you can also find the show on Apple , Spotify , and most places where you find podcasts. Media tidbits More Olympics. Here’s The Athletic’s Rebecca Tauber with “Our 26 favorite gold-medal moments from the 2026 Milan Cortina games.” Mediaite’s Colby Hall with “ Fox News Attacks CNN’s ‘Hit Piece’ On Christian Nationalism With Misleading Edit.” For “CBS News Sunday Morning,” “60 Minutes” correspondent Lesley Stahl talked with the Pulitzer Prize-winning journalist in “Seymour Hersh, a reporter’s reporter.” Joey Knight, a longtime Tampa Bay sports journalist for the Tampa Tribune and Tampa Bay Times, died last week after a two-year battle with cancer. He was 57. I worked with Joey at both the Tribune and Times, and while things like this are said all the time, it’s absolutely true in Joey’s case: You couldn’t find a nicer and sweeter soul. I can’t recall anyone ever saying an unkind word about him, and he never said an unkind word about anyone else. Tampa Bay Times sports columnist John Romano wrote a wonderful tribute in “For 30 years, he told the hidden stories of Tampa Bay. Now, here’s his.” Hot type The Ringer’s Jordan Ritter Conn with “Inside the Hidden Network of Resistance in Minneapolis.” More resources for journalists Great Lakes journalists: Work on coverage strategies, gain reporting tools and spark regional connections in our free election coverage workshops. Apply now . New editors: Get guidance from industry veterans and build the skills you need to become indispensable to your newsroom. Apply now . Get the skills, policies, and editorial support to cover crime with depth, accuracy, and public service in mind. Apply now . Have feedback or a tip? Email Poynter senior media writer Tom Jones at tjones@poynter.org . The Poynter Report is your daily dive into the world of media, packed with the latest news and insights. Get it delivered to your inbox Monday through Friday by signing up here . And don’t forget to tune into our biweekly podcast for even more. Poynter is a nonprofit dedicated to keeping journalism strong, relevant, and grounded in sound values. Join our donor community, the First Amendment Society, to help us continue this critical work. DONATE Tags: C-SPAN , Commentary , President Donald Trump , The Poynter Report Tom Jones Tom Jones is Poynter’s senior media writer for Poynter.org. He was previously part of the Tampa Bay Times family during three stints over some 30… Tom Jones Cash-starved and censored, America’s student newspapers are fighting to survive Shrinking budgets and university pressure are squeezing the next generation of journalists February 23, 2026 Barbara Allen President Donald Trump speaks at the National Governors Association dinner at the White House on Saturday. (AP Photo/Allison Robbert) Opinion | Did President Trump call into C-SPAN under a fake name? A caller who sounded remarkably like Trump complained in his favor. C-SPAN says it wasn’t him. But it’s easy to believe he’d do something like that. February 23, 2026 Tom Jones Why Canada still doesn’t have a full-time fact-checking beat Canadian Daniel Dale became a star fact-checking Trump. Back home, the work remains ad hoc. That says a lot about Canadian politics and media. February 23, 2026 Louis Jacobson Why Donald Trump and Barack Obama are suddenly talking about aliens A viral Obama podcast answer about aliens prompted Trump to accuse him of revealing secrets and promise to release UFO files February 23, 2026 Maria Briceño Opinion | Stephen Colbert’s interview with James Talarico finds massive audience online The full clip has garnered “more than twice the daily average” on Colbert’s YouTube channel, according to data. February 20, 2026 Tom Jones Back to News Comments Cancel reply You must be logged in to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed. Start your day informed and inspired. Subscribe Get the Poynter newsletter that's right for you. Media Jobs Sales and Marketing Specialist - SAN ANTONIO, TX (78229) Sinclair Inc WOAI/KABB-TV Spring 2027 T. Anthony Pollner Distinguished Professorship - Missoula, MT (59812) University of Montana Journalism Editorial Page Editor - Charleston, SC (29403) Evening Post Publishing Newspaper Group Program Director, Grants - Remote Tarbell Center for AI Journalism Program Director, Fellowship - Remote Tarbell Center for AI Journalism Membership Coordinator/WUFT-TV/FM and WJUF-FM - Gainesville, FL (32611) University of Florida Assistant Chief Engineer - Chapel Hill, NC (27517) WUNC - FM Director of Marketing & Communication - Needham, MA (02492) Camp Kingswood Assistant Camp Director - Marketing & Communications - Needham, MA (02492) Camp Kingswood Lecturer & Teacher-Special Programs - Graduate School of Journalism - Berkeley, CA (94720) University of California Berkeley Search Media Jobs Advertise a job",
    "url": "https://www.poynter.org/commentary/2026/cspan-caller-who-is-john-barron/",
    "publication_date": "Mon, 23 Feb 2026 12:30:10 +0000",
    "date_gathered": "2026-02-24T03:36:14.007204",
    "country": "US",
    "organization": "Poynter"
  },
  {
    "title": "Why Canada still doesn’t have a full-time fact-checking beat",
    "content": "Business & Work Fact-Checking Toronto street scene. (Louis Jacobson/Poynter) By: Louis Jacobson February 23, 2026 TORONTO — Daniel Dale is Canada’s most famous fact-checking journalist. He’s also one of Canada’s only fact-checking journalists. And therein lies a tale of politics, media, and some key differences between the United States and Canada. Dale was born in Toronto, graduated with a business degree from York University, and made his way into journalism. He was hired by the Toronto Star in 2008, where, among other things, he would cover the late, troubled, larger-than-life Toronto mayor, Rob Ford. Eventually Dale was dispatched to be the Star’s correspondent in Washington, D.C. After Donald Trump began his first presidential run in 2015, Dale found himself intrigued by Trump’s numerous, less-than-accurate claims in his public appearances. In addition to his regular articles as a foreign correspondent, Dale began tweeting lists of false things Trump had said during his campaign rallies. Dale’s posts quickly caught on, especially among Americans during the 2016 election. CNN’s Daniel Dale in Toronto. (Louis Jacobson/Poynter) Dale’s editor at the Star, Ed Tubb, worked with him to regularize his Trump fact-checking on the newspaper’s website and weave it into his overall coverage. Dale and Tubb focused on Trump’s clearest, most obvious falsehoods as a way of highlighting how different he was as a politician, Tubb recalled. The pair created a running database of Trump’s questionable claims that eventually numbered in the thousands. “It was never his sole day job, but it did become more of one for him,” Tubb said. In metrics like pageviews and time spent on the site, Dale’s work “was always at the top of the charts,” Tubb said. And when it came to selling the project to the Star’s higher-ups, Tubb said, “I never had any trouble.” Then, in 2019, CNN came calling, and like countless Canadian professionals before him , Dale headed to the vastly larger U.S. market. For the rest of Trump’s first term, and now in Trump’s second term, Dale has become a familiar on-air presence, holding Trump accountable for his statements for a U.S. audience. Back in Canada, the Star has periodically revived fact-checking journalism, including during Canada’s 2021 federal elections and other political coverage . But as a Canadian fact-checking journalist, Dale has been a unicorn. As I was reporting this article in Toronto and elsewhere, one observation came up repeatedly: Fact-checking in Canada is ad hoc. Here, there is no equivalent of PolitiFact, the dedicated fact-checking website where I am chief correspondent, or FactCheck.org. Nor is there a dedicated political fact-checking position at a major media outlet, like the one Glenn Kessler held at The Washington Post until recently or that Linda Qiu holds at The New York Times. One recent example from when I was in the country: On Feb. 9, Trump used a social media post to assail an almost-ready-to-open bridge between Detroit and Windsor, Ontario. The controversy attracted wide coverage in the Canadian media, but mostly as a news story or as fodder for opinion pieces. I found just one article by a Canadian-owned outlet labeled as a fact check — by CTV, a for-profit broadcaster — and it was written by a regular anchor and reporter for the network based in Windsor, not a fact-checking specialist. The French news service Agence France-Presse, well regarded in international fact-checking circles, also published a fact check . Naturally, Dale filed a fact check for CNN and its U.S. audience. Dale’s rise benefited from an unusual set of circumstances. Not only did he have a special knack for fact-checking and social media, but in Trump he found a subject who made more questionable claims than anyone — certainly anyone in Canada. Some Canadian politicians — such as Ford or his brother Doug, Ontario’s provincial premier — have superficial stylistic similarities with Trump, notably their rough outspokenness. But analysts here say the range and degree of falsehoods in the Ford brothers’ rhetoric have hardly compared to Trump’s. “It’s impossible to think of a precedent” for Trump among Canadian politicians, Tubb said. Ed Tubb, an editor at the Toronto Star, at its newsroom in Toronto. (Louis Jacobson/Poynter) So Dale’s departure to a U.S. media outlet was likely preordained. “Being next to the U.S., so much of the information environment is influenced by the U.S.,” Tubb said. “To have the only full-time English-language fact-checker being someone covering Trump — it feels very ‘Canadian media.’” Other fact-checking efforts in Canada Canada may lack specialized fact-checking journalists, but it does have a lively sector adjacent to it. At McMaster University in Hamilton, Ontario, the Digital Society Lab is exploring a variety of emerging technologies, such as using machine learning to model the flows of misinformation on social media platforms, said Clifton van der Linden, a political scientist and academic director of the lab. This follows previous work on health misinformation during the coronavirus pandemic. “There are not enough supercomputers to run every post through them,” said John McAndrews, the lab’s managing director. “So one approach is to say we need to have data reduction earlier in the pipeline, to make the rest of the pipeline more efficient.” The lab has also spearheaded a promise tracker , covering not only Canada’s prime minister but also its provincial premiers. Clifton van der Linden and John McAndrews of the Digital Society Lab at McMaster University in Hamilton, Ontario. (Louis Jacobson/Poynter) The Canadian Press, a wire service, is a member of Poynter’s International Fact-Checking Network; recent fact checks include a mix of debunked social media claims and a fact check of Trump . A key node of the misinformation-tracking community in Toronto is Craig Silverman, who previously worked for BuzzFeed Canada and ProPublica and who for a while published his column “Regret the Error” for Poynter . Today, Silverman runs Indicator , an outfit in which he collaborates with Alexios Mantzarlis, the onetime head of Poynter’s International Fact Checking Network and a veteran of Google. Indicator provides tools, workshops and training to help professionals navigate and investigate the digital information landscape Craig Silverman, co-founder of Indicator, in Toronto. (Louis Jacobson/Poynter) Toronto also serves as a welcoming home for Farhad Souzanchi, the editor of Factnameh , a fact-checking service focusing on claims from and about Iran. The site’s articles are accessible by virtual private networks in Iran and widely read despite government opposition. “We don’t have any red lines” for covering and debunking claims, Souzanchi said in an interview here. “We have fact-checked the supreme leader, which would be absolutely off limits inside Iran.” In one case, the supreme leader, Ali Khamenei, had to backtrack on a claim he made after Factnameh debunked his assertion. One of the newest entries in the misinformation sphere is the Canadian Broadcasting Corporation, Canada’s public broadcaster. A year and a half ago, the CBC launched a visual investigations team that uses a combination of open-source investigation, digital forensics and traditional journalism techniques to both support CBC’s regular news coverage and publish articles and projects of its own. Litsa Sourtzis and Eric Szeto of the CBC News visual investigations unit at CBC headquarters in Toronto. (Louis Jacobson/Poynter) The unit has debunked an image of accused drug kingpin Ryan Wedding shared by Mexican President Claudia Sheinbaum as generated by artificial intelligence; calculated that two of Canada’s biggest political parties had exaggerated the size of crowds at their rallies; determined that viral videos a white man complaining about the difficulty of getting a job in Canada were made by AI; and investigated claims about fake “FIFA visas” to Canada for the World Cup. The team’s video breaking down the fatal shooting of Renee Good in Minneapolis received 8 million views. In a collaboration with the international investigative outlet Bellingcat and the Danish news outlets TjekDet and Politiken, the CBC team published an expose of a deepfake pornography site called MrDeepFakes. And in collaboration with local journalists, the team has launched a series about white nationalist fighting clubs . Why classic fact-checking is ad hoc in Canada With all this ferment for pursuing misinformation — and with Canada’s educated, affluent, information-seeking population — the Canadian media’s ad hoc approach to traditional political fact checking might seem like a mystery, especially when so many American news outlets have adopted the approach. But if you look closer, a few reasons may explain it: Political campaigns are shorter in Canada. Unlike in the U.S., where campaigning is constant and unending, Canadian campaigns last for a few weeks. So for a Canadian fact-checker, there would be a quick sprint, followed by a need to write about something else … for the next few years. (Observers here say Canadian politicians really do abide by the no-campaigning norm between election periods, to the relief of the public.) Canadian legacy media outlets are under strain. Having a full-time fact checker (or something close) would be an unimaginable luxury in today’s media climate, observers here said. Headlines about massive layoffs at The Washington Post resurrected unhappy memories in Canada, said van der Linden of McMaster’s Digital Society Lab, but “we’ve seen a lot of headlines like that in Canada.” Canadians are less tolerant of culture-war division. While Canada certainly has ideological divides, its political rhetoric tends to be more measured. Politics here is mostly practiced within narrower parameters, in part because the electorate includes a sizable share of persuadable swing voters. That makes politicians less likely to appeal to the extremes with questionable claims. Canadian politicians are more restrained by shame than U.S. politicians are. “One thing I see among Canadian politicians on most levels is a willingness to concede mistakes,” van der Linden said. When a falsehood emerges here, it’s often because of a simple mess-up, and the truth tends to be pretty boring. “We don’t have many Pants on Fire claims here,” Tubb said. Tubb said his paper is likely to dip back into fact-checking when necessary. But in all likelihood, he added, the pursuit of fact-checking “will continue to be ad hoc.” Poynter is a nonprofit dedicated to keeping journalism strong, relevant, and grounded in sound values. Join our donor community, the First Amendment Society, to help us continue this critical work. DONATE Tags: Canada , CNN , Daniel Dale , Donald Trump , political journalism Louis Jacobson Louis Jacobson has been with PolitiFact since 2009, currently as chief correspondent. Previously, he served as senior correspondent and deputy editor. Before joining PolitiFact, he… Louis Jacobson Cash-starved and censored, America’s student newspapers are fighting to survive Shrinking budgets and university pressure are squeezing the next generation of journalists February 23, 2026 Barbara Allen Opinion | Did President Trump call into C-SPAN under a fake name? A caller who sounded remarkably like Trump complained in his favor. C-SPAN says it wasn’t him. But it’s easy to believe he’d do something like that. February 23, 2026 Tom Jones Toronto street scene. (Louis Jacobson/Poynter) Why Canada still doesn’t have a full-time fact-checking beat Canadian Daniel Dale became a star fact-checking Trump. Back home, the work remains ad hoc. That says a lot about Canadian politics and media. February 23, 2026 Louis Jacobson Why Donald Trump and Barack Obama are suddenly talking about aliens A viral Obama podcast answer about aliens prompted Trump to accuse him of revealing secrets and promise to release UFO files February 23, 2026 Maria Briceño Opinion | Stephen Colbert’s interview with James Talarico finds massive audience online The full clip has garnered “more than twice the daily average” on Colbert’s YouTube channel, according to data. February 20, 2026 Tom Jones Back to News Comments Cancel reply You must be logged in to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed. Start your day informed and inspired. Subscribe Get the Poynter newsletter that's right for you. Media Jobs Sales and Marketing Specialist - SAN ANTONIO, TX (78229) Sinclair Inc WOAI/KABB-TV Spring 2027 T. Anthony Pollner Distinguished Professorship - Missoula, MT (59812) University of Montana Journalism Editorial Page Editor - Charleston, SC (29403) Evening Post Publishing Newspaper Group Program Director, Grants - Remote Tarbell Center for AI Journalism Program Director, Fellowship - Remote Tarbell Center for AI Journalism Membership Coordinator/WUFT-TV/FM and WJUF-FM - Gainesville, FL (32611) University of Florida Assistant Chief Engineer - Chapel Hill, NC (27517) WUNC - FM Director of Marketing & Communication - Needham, MA (02492) Camp Kingswood Assistant Camp Director - Marketing & Communications - Needham, MA (02492) Camp Kingswood Lecturer & Teacher-Special Programs - Graduate School of Journalism - Berkeley, CA (94720) University of California Berkeley Search Media Jobs Advertise a job",
    "url": "https://www.poynter.org/business-work/2026/canada-fact-checking-daniel-dale-trump-misinformation/",
    "publication_date": "Mon, 23 Feb 2026 12:00:35 +0000",
    "date_gathered": "2026-02-24T03:36:14.203271",
    "country": "US",
    "organization": "Poynter"
  },
  {
    "title": "Why Donald Trump and Barack Obama are suddenly talking about aliens",
    "content": "Fact-Checking This image released by NASA on Sept. 6, 2022, shows the Tarantula Nebula star-forming region, captured by the James Webb Space Telescope. (NASA, ESA, CSA, STScl, and Webb ERO Production Team via AP) By: Maria Briceño February 23, 2026 President Donald Trump said Thursday he will direct multiple U.S. government agencies to declassify files related to aliens and UFOs. The move came five days after former President Barack Obama sparked interest in the topic by saying aliens are real. Obama made the comments in a Feb. 14 interview with political commentator and podcaster Brian Tyler Cohen , who asked Obama a lightning round of questions, including whether aliens are real. Obama’s answer in the affirmative quickly went viral on social media. Aboard  Air Force One Feb. 19, Fox News senior White House correspondent Peter Doocy asked Trump: “So aliens are real?” “Well, I don’t know if they’re real or not,” Trump said. “I can tell you (Obama) gave classified information. He’s not supposed to be doing that. He made a big mistake. He took it out of classified information.” Doocy then said Trump, as president, can declassify anything he wants to. “I may get him out of trouble by declassifying it,” Trump responded, referring to Obama. Hours later, Trump said on Truth Social he would do just that. “Based on the tremendous interest shown, I will be directing the Secretary of War, and other relevant Departments and Agencies, to begin the process of identifying and releasing Government files related to alien and extraterrestrial life, unidentified aerial phenomena (UAP), and unidentified flying objects (UFOs),” Trump’s Feb. 19 post read. Here are Obama’s comments during Cohen’s speed-round interview , when the former president answered several questions in a short period of time. Cohen: “So I want to do a little bit of a lightning round here, because it’s not often I’ll get access to the president of the United States. So a couple questions here. Are aliens real?” Obama: “They’re real, but I haven’t seen them, and they’re not being kept in, what is it?” Cohen: “Area 51?” Obama: “Area 51. There’s no underground facility, unless there’s this enormous conspiracy, and they hid it from the president of the United States.” Declassified documents released in 2013 during Obama’s presidency acknowledged the existence of Area 51, saying that the secret government space was used as an aerial testing ground for U.S. government projects. Obama clarified his podcast remarks on social media , saying, “I was trying to stick with the spirit of the speed round, but since it’s gotten attention let me clarify. Statistically, the universe is so vast that the odds are good there’s life out there. But the distances between solar systems are so great that the chances we’ve been visited by aliens is low, and I saw no evidence during my presidency that extraterrestrials have made contact with us. Really!” While not discovered, there’s a possibility that there could be life on other planets; NASA researchers said in August 2025 that they found a long-lasting source of chemical energy in the ancient past of planet Ceres that could have made it possible for microorganisms to survive. NASA noted that this doesn’t mean that Ceres had life, but that there was likely “food” available should life have ever arisen on Ceres. In 2024 the Pentagon’s UFO office, called the All-domain Anomaly Resolution Office, said it found “no evidence of extraterrestrial beings, activity, or technologies.” This fact check was originally published by PolitiFact , which is part of the Poynter Institute. See the sources for this fact check here . Poynter is a nonprofit dedicated to keeping journalism strong, relevant, and grounded in sound values. Join our donor community, the First Amendment Society, to help us continue this critical work. DONATE Tags: aliens , extraterrestrials , PolitiFact , President Barack Obama , President Donald Trump , UFO Maria Briceño Maria Briceño is a PolitiFact reporting fellow who fact-checks misinformation in Spanish at PolitiFact. She previously interned as a space reporter with WMFE 90.7 in… Maria Briceño Cash-starved and censored, America’s student newspapers are fighting to survive Shrinking budgets and university pressure are squeezing the next generation of journalists February 23, 2026 Barbara Allen Opinion | Did President Trump call into C-SPAN under a fake name? A caller who sounded remarkably like Trump complained in his favor. C-SPAN says it wasn’t him. But it’s easy to believe he’d do something like that. February 23, 2026 Tom Jones Why Canada still doesn’t have a full-time fact-checking beat Canadian Daniel Dale became a star fact-checking Trump. Back home, the work remains ad hoc. That says a lot about Canadian politics and media. February 23, 2026 Louis Jacobson This image released by NASA on Sept. 6, 2022, shows the Tarantula Nebula star-forming region, captured by the James Webb Space Telescope. (NASA, ESA, CSA, STScl, and Webb ERO Production Team via AP) Why Donald Trump and Barack Obama are suddenly talking about aliens A viral Obama podcast answer about aliens prompted Trump to accuse him of revealing secrets and promise to release UFO files February 23, 2026 Maria Briceño Opinion | Stephen Colbert’s interview with James Talarico finds massive audience online The full clip has garnered “more than twice the daily average” on Colbert’s YouTube channel, according to data. February 20, 2026 Tom Jones Back to News Comments Cancel reply You must be logged in to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed. Start your day informed and inspired. Subscribe Get the Poynter newsletter that's right for you. Media Jobs Sales and Marketing Specialist - SAN ANTONIO, TX (78229) Sinclair Inc WOAI/KABB-TV Spring 2027 T. Anthony Pollner Distinguished Professorship - Missoula, MT (59812) University of Montana Journalism Editorial Page Editor - Charleston, SC (29403) Evening Post Publishing Newspaper Group Program Director, Grants - Remote Tarbell Center for AI Journalism Program Director, Fellowship - Remote Tarbell Center for AI Journalism Membership Coordinator/WUFT-TV/FM and WJUF-FM - Gainesville, FL (32611) University of Florida Assistant Chief Engineer - Chapel Hill, NC (27517) WUNC - FM Director of Marketing & Communication - Needham, MA (02492) Camp Kingswood Assistant Camp Director - Marketing & Communications - Needham, MA (02492) Camp Kingswood Lecturer & Teacher-Special Programs - Graduate School of Journalism - Berkeley, CA (94720) University of California Berkeley Search Media Jobs Advertise a job",
    "url": "https://www.poynter.org/fact-checking/2026/barack-obama-aliens-trump-files/",
    "publication_date": "Mon, 23 Feb 2026 11:30:44 +0000",
    "date_gathered": "2026-02-24T03:36:14.413070",
    "country": "US",
    "organization": "Poynter"
  },
  {
    "title": "Stephen Colbert’s interview with James Talarico finds massive audience online",
    "content": "Commentary Newsletters Texas state Rep. James Talarico, D-Austin, a Democratic candidate for the U.S. Senate speaks to the media earlier this week. (AP Photo/Eric Gay) By: Tom Jones February 20, 2026 Yeah, that interview that CBS late-night host Stephen Colbert did on Monday with Texas U.S. Senate candidate James Talarico that some people didn’t want you to see? Well, apparently, a lot of people are seeing it. A lot. As you know by now, Colbert said CBS insisted the show did not air the interview with Talarico on his late-night show, claiming the network was worried about the FCC coming after it for the equal-time rule regarding political candidates. So the interview was shipped to the show’s YouTube page while Colbert, the network and the FCC all pointed fingers publicly about what happened. But as far as the interview itself, it is being viewed by way more folks than would have seen it had no one made a fuss and it simply aired on Colbert’s show as originally planned. According to Deadline’s Dade Hayes , the interview “has now drawn 85 million views across YouTube and social media.” And that was as of Thursday morning. Hayes reported that the measuring firm Tubular Labs said over a 72-hour stretch, there were 1,320 video uploads featuring Colbert and Talarico across YouTube, TikTok, Instagram and Facebook. The videos have generated more than 8 million engagements, with the 85 million figure stemming from any viewing session lasting at least two seconds. Hayes wrote, “The most-watched individual clip, notably, is the full 15-minute interview. It has collected more than 7.5 million views, more than twice the daily average viewing level of Colbert’s YouTube channel.” Since Colbert revealed on Monday night what had happened with the Talarico interview, there have been statements and comments from all sides. Typically, the equal-time rule does not apply to late-night shows, but the FCC recently began looking into whether ABC’s “The View” violated the equal-time rule by also interviewing Talarico. That raised concerns that late-night shows could be next. CBS, according to Colbert, felt spooked enough to keep Colbert’s interview with Talarico off TV So who’s to blame? CBS or the FCC? The debate rages on. The FCC’s sole Democratic commissioner, Anna Gomez, blamed both. She tweeted on Thursday, “The FCC is engaged in a campaign of censorship and control. They may not have ordered The Late Show interview pulled. But when government interferes in editorial decisions, broadcasters are forced to self-censor or push back. CBS chose not to push back.” Speaking of CBS Puck’s Dylan Byers reported that Anderson Cooper’s decision to leave “60 Minutes” “blindsided” CBS News editor-in-chief Bari Weiss and the rest of leadership. They believed they were close to signing Cooper to a new contract. One source told Byers, “These negotiations were on the one-yard line.” Another source told Byers, “It was total chaos. Everyone was caught off guard.” Cooper, who remains on at CNN, said in a statement that he wanted to spend more time with his family. But there have been reports that he was wary of a rightward direction at CBS News. Byers wrote that, while he didn’t know what was inside Cooper’s head, his decision was likely less out of protest against the network “than a personal rejection of the entire Trump II–era CBS psychodrama, which, frankly, isn’t worth his time.” Journalism controversy of the week A week ago, The Atlantic published a story from Elizabeth Bruenig: “This Is How a Child Dies of Measles.” As Laura Hazard Owen explained in her piece for Nieman Lab , “It’s written in the second person, from the point of view of a woman whose two unvaccinated children get measles — with ultimately horrific long-term consequences for her son.” The essay’s many details about the children and second-person storytelling led readers to believe that the story was a first-hand account. Owen herself wrote, “When I initially read Bruenig’s story, I was stunned: An Atlantic staff writer’s unvaccinated child had died of measles in the 2020s, and now she was writing about it?” That’s how many readers took it. But then there was this unusual editor’s note at the end of The Atlantic story: “This story is based on extensive reporting and interviews with physicians, including those who have cared directly for patients with measles.” So, wait, this was not the author’s personal experience? Owen reached out to Bruenig, who said, “It is a hypothetical account of a very real phenomenon based on careful reporting. I would place it somewhere on the creative nonfiction spectrum.” Owen went on to ask Bruening many more detailed questions about her writing choice, as well as about the topic, which was measles. Then Owen updated her story on Thursday to write, “After this piece was published, I heard from two different people who received The Atlantic’s original press push email for the piece around 4:30 p.m. on Thursday afternoon. At that time, when they clicked through, there was not an editor’s note/disclaimer on the piece at all. Both of those readers, who are professional journalists, responded to the press email with confusion and asked if the story was real. An Atlantic publicist emailed one of these readers back and said, ‘This is based on a mother’s real account. Thanks for checking.’ Sometime after that, the disclaimer was added and it was there when I read the story around 7 p.m. on Thursday night. A spokesperson for The Atlantic told me yesterday, ‘The note was added almost immediately after publication.’ This information is significant to me because it suggests that within The Atlantic there was confusion about whether the piece was fictional.” No doubt that Bruenig’s story is powerful. But many readers got lost in the confusion. Bruening told Owen, “I collaborated closely with my editors on this piece, and we were attracted to the idea of providing a play-by-play of the progression of measles in granular detail. It seemed like the best way to lay it all out was to spin a narrative that touches on every important aspect of a measles infection, from the biological processes inside the body, to the governmental response, to an outbreak. Writing in the second person made sense to me because it’s a hypothetical addressed to parents weighing these decisions or facing outbreaks in their communities. I write nonfiction either in the first person or third, so this felt like a way to signal that this is a different kind of story. On the other hand, writing in the second person always feels a little bit goofy. We included an editor’s note to remove any possibility of confusion. And yes, it does make sense to me to describe it as a story about ideas.” Listeners upset Recently, authorities investigating the disappearance of Nancy Guthrie, the 84-year-old mother of “Today” show co-host Savannah Guthrie, released door camera footage of a man in a mask outside of the elder Guthrie’s home around the time she disappeared. In discussing the story on NPR, “Morning Edition” host Steve Inskeep interviewed a former FBI profiler. During the interview, Inskeep said the man’s mask made him look “a little like a federal immigration agent.” That comment was the focus of the latest NPR public editor’s column by my colleague, Kelly McBride . According to McBride, “Listeners flooded our inbox with concerns about this correlation.” McBride reports the comment was not in the script. Inskeep’s full question was, “So let me think about this. We have this man. He walks up to the porch. His — he’s armed and his face is covered, a little like a federal immigration agent, although it’s more covered even than that. He’s wearing gloves. His head’s down. Other times, head up. Something in the mouth. Looks like a flashlight in the mouth. Walks up to the security camera. That’s what I see. What do you see, and what do you read from that?” McBride writes, “Comparing the intruder on Guthrie’s porch to a federal immigration agent was both irrelevant and inflammatory. The short phrase was interpreted by listeners to be a commentary on the controversial tactics of federal law enforcement. Some news consumers who care deeply about the dramatic story of Guthrie’s kidnapping felt like the comment was a sign of disrespect.” McBride added, “An NPR news executive who would only talk on background told me that Inskeep did not intend for the statement to be political commentary. Instead, the off-the-cuff description was meant to help the audience understand what was in the video. It was not meant to connect the scrutiny of federal officers to the intruder on Guthrie’s porch, the news executive said.” Check out the column for more of McBride’s thoughts on this matter. Worth watching “The Whole Story with Anderson Cooper” returns Sunday night at 8 p.m. Eastern on CNN with a piece by CNN’s Pamela Brown: “The Rise of Christian Nationalism.” As CNN explains it, Brown will look at the “ideology rooted in the belief that the United States was founded as a Christian nation and that its laws and institutions should reflect Christian values.” In a statement, Brown said, “My reporting for this hour began early last year when I visited Moscow, Idaho to interview Pastor Douglas Wilson. The response to that report was overwhelming and highlighted the need to better understand this movement working to redefine America as a Christian nation in the home, in a marriage, in schools and in government. We embedded with a community under Pastor Wilson’s umbrella and spoke to women who have left the church and are now sounding the alarm. No matter where you live or what you believe, what we learned is especially consequential at this moment.” Speaking of Wilson, The Washington Post’s Amy B Wang wrote, “Hegseth invited Christian nationalist Doug Wilson to preach at Pentagon.” Media news, tidbits, and interesting links for your weekend review Deadline’s Ted Johnson with “Senate Democrats Ask David Ellison To “Preserve Records” As They Threaten Investigation Of Paramount Contacts With Trump Over WB Bid.” Good column from Mediaite’s Tommy Christopher: “Trump and Karoline Leavitt Tried To Laugh Off ‘False Accusations’ Of Racism — Too Many In Media Played Along.” The Los Angeles Times’ Cerys Davies with “CBS’ Bari Weiss pulls out of UCLA lecture.” My Poynter colleague, Amaris Castillo with “When newspapers cut book coverage, communities lose more than reviews.” For Esquire, John Hendrickson profiles the legendary magazine writer in “Tom Junod Finally Reckons with What It Means to Be a Man.” Fun design and story here from The New York Times Magazine about a famous photo: “‘I Had No Idea How to Handle That’: The Drama Behind a Tense Ice Skating Moment.” Correction: In Thursday’s newsletter, I wrote about CBS News’ Norah O’Donnell sitting in next week on the network’s morning show. In doing so, I called the show by the wrong name. The name of the show is “CBS Mornings.” It used to be called “CBS This Morning” when O’Donnell last appeared on the show from 2012 to 2019. More resources for journalists Great Lakes journalists: Work on coverage strategies, gain reporting tools and spark regional connections in our free election coverage workshops. Apply now . New editors: Get guidance from industry veterans and build the skills you need to become indispensable to your newsroom. Apply now . Get the skills, policies, and editorial support to cover crime with depth, accuracy, and public service in mind. Apply now . Reporters and editors with ambition to do investigative journalism: Get guidance from ProPublica’s Alexandra Zayas in this five-week, hands-on seminar. Enroll today . Have feedback or a tip? Email Poynter senior media writer Tom Jones at tjones@poynter.org . The Poynter Report is your daily dive into the world of media, packed with the latest news and insights. Get it delivered to your inbox Monday through Friday by signing up here . And don’t forget to tune into our biweekly podcast for even more. Poynter is a nonprofit dedicated to keeping journalism strong, relevant, and grounded in sound values. Join our donor community, the First Amendment Society, to help us continue this critical work. DONATE Tags: Anderson Cooper , bari weiss , CBS , Commentary , James Talarico , late night TV , Stephen Colbert , The Atlantic , The Poynter Report Tom Jones Tom Jones is Poynter’s senior media writer for Poynter.org. He was previously part of the Tampa Bay Times family during three stints over some 30… Tom Jones Cash-starved and censored, America’s student newspapers are fighting to survive Shrinking budgets and university pressure are squeezing the next generation of journalists February 23, 2026 Barbara Allen Opinion | Did President Trump call into C-SPAN under a fake name? A caller who sounded remarkably like Trump complained in his favor. C-SPAN says it wasn’t him. But it’s easy to believe he’d do something like that. February 23, 2026 Tom Jones Why Canada still doesn’t have a full-time fact-checking beat Canadian Daniel Dale became a star fact-checking Trump. Back home, the work remains ad hoc. That says a lot about Canadian politics and media. February 23, 2026 Louis Jacobson Why Donald Trump and Barack Obama are suddenly talking about aliens A viral Obama podcast answer about aliens prompted Trump to accuse him of revealing secrets and promise to release UFO files February 23, 2026 Maria Briceño Texas state Rep. James Talarico, D-Austin, a Democratic candidate for the U.S. Senate speaks to the media earlier this week. (AP Photo/Eric Gay) Opinion | Stephen Colbert’s interview with James Talarico finds massive audience online The full clip has garnered “more than twice the daily average” on Colbert’s YouTube channel, according to data. February 20, 2026 Tom Jones Back to News Comments Cancel reply You must be logged in to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed. Start your day informed and inspired. Subscribe Get the Poynter newsletter that's right for you. Media Jobs Sales and Marketing Specialist - SAN ANTONIO, TX (78229) Sinclair Inc WOAI/KABB-TV Spring 2027 T. Anthony Pollner Distinguished Professorship - Missoula, MT (59812) University of Montana Journalism Editorial Page Editor - Charleston, SC (29403) Evening Post Publishing Newspaper Group Program Director, Grants - Remote Tarbell Center for AI Journalism Program Director, Fellowship - Remote Tarbell Center for AI Journalism Membership Coordinator/WUFT-TV/FM and WJUF-FM - Gainesville, FL (32611) University of Florida Assistant Chief Engineer - Chapel Hill, NC (27517) WUNC - FM Director of Marketing & Communication - Needham, MA (02492) Camp Kingswood Assistant Camp Director - Marketing & Communications - Needham, MA (02492) Camp Kingswood Lecturer & Teacher-Special Programs - Graduate School of Journalism - Berkeley, CA (94720) University of California Berkeley Search Media Jobs Advertise a job",
    "url": "https://www.poynter.org/commentary/2026/stephen-colbert-james-talarico-youtube-interview-explodes/",
    "publication_date": "Fri, 20 Feb 2026 12:30:53 +0000",
    "date_gathered": "2026-02-24T03:36:14.669015",
    "country": "US",
    "organization": "Poynter"
  },
  {
    "title": "Trump is reshaping how the federal government presents Black history",
    "content": "Fact-Checking A National Parks Service worker puts his hand on a panel that was part of an exhibit on slavery at the President's House Site in Philadelphia to be put back Thursday, Feb. 19, 2026. (AP Photo/Joe Lamberti) By: Louis Jacobson February 20, 2026 It’s Black History Month — and President Donald Trump has put his stamp on the decades-old commemoration. The White House’s 2026 Black History Month proclamation said Black history “is not distinct from American history.” Black History Month, the proclamation said, has been twisted by “the progressive movement and far-left politicians” who have “sought to needlessly divide our citizens on the basis of race, painting a toxic and distorted and disfigured vision of our history, heritage, and heroes.” At a Feb. 18 White House event , Trump lauded Black celebrities and closed his remarks with, “Happy Black History Month! Happy Black History Year! And happy Black History Century!” Since starting his second term, Trump has sought to reshape the government’s portrayal of Black history. Trump has issued executive orders curtailing the government’s use of diversity, equity and inclusion, or DEI. Since then, federal agencies have taken a number of high-profile steps to remove historical information portrayed through the lens of race. Some have subsequently been reversed, modified or blocked in court. It remains unclear whether Trump’s executive orders and the removals could have a chilling effect on museums, historical sites and federal agencies going forward. “No other presidential administration has interfered with these (historical) sites in this way before,” said Leslie M. Harris, a Northwestern University historian and author of five books on slavery in the U.S. “A short-term outcome could be a distrust, even an avoidance, of government sites.” In response to our request for comment, White House spokesperson Olivia Wales outlined what she said are Trump’s accomplishments for Black Americans spanning both his presidencies, including criminal justice reform, prison reform, opportunity zones, long-term funding of historically black colleges, school choice funding, Trump Accounts and “the largest middle-class tax cuts in history.” What did Trump’s executive orders say? Within hours of his Jan. 20, 2025, inauguration, Trump issued an executive order mandating the termination of what it called “all discriminatory programs” including DEI “mandates, policies, programs, preferences, and activities” in the federal government. A second March 27, 2025, executive order , titled “Restoring Truth and Sanity to American History,” sought to counter what it characterized as “a concerted and widespread effort to rewrite our Nation’s history, replacing objective facts with a distorted narrative driven by ideology rather than truth.” The executive order specifically addressed the Smithsonian Institution and said people visiting museums should not “be subjected to ideological indoctrination or divisive narratives that distort our shared history.” (In August 2025, PolitiFact visited several Smithsonian museums and rated Trump’s statement that the Smithsonian includes “nothing about success, nothing about brightness, nothing about the future” Pants on Fire . ) The order also directed the interior secretary — whose department includes the National Park Service that operates hundreds of historical sites and interpretive exhibits — to reinstate materials that had been “removed or changed to perpetuate a false reconstruction of American history, inappropriately minimize the value of certain historical events or figures, or include any other improper partisan ideology.” How have these orders been implemented? Here are some examples of ways the executive orders have been implemented that are still in place: The “scarred back” photograph . An 1863 image of a man who escaped slavery and bore deep scars on his back from being whipped was removed from display at the Fort Pulaski National Monument near Savannah, Georgia, Greenwire reported in September 2025. The 1863 photo is well known because of its use by abolitionists and inclusion in modern textbooks. Statue of Confederate general Albert Pike . Protesters tore down and burned the Washington, D.C., statue during Black Lives Matter protests in 2020, but the National Park Service renovated and reinstalled it in October 2025. National Park Service gift shops . The Interior Department issued a November 2025 memo ordering its gift shops to remove any items promoting DEI or gender expression, The New York Times reported . Louisiana landmark designation . Following a multi-year National Park Service review, the Great River Road, an 11-mile corridor in Louisiana with a deep history of slavery, was pulled from consideration for National Historic Landmark designation. Black Lives Matter plaza . Washington, D.C., Mayor Muriel Bowser removed a mural of the words “Black Lives Matter” near the White House, painted on the street after the 2020 murder of George Floyd by Minneapolis police. The removal followed the introduction of legislation by Rep. Andrew Clyde, R-Ga., to withhold federal funds from the city didn’t remove it. Other actions were modified or reversed after public backlash, including: Harriet Tubman web page . The National Park Service initially removed a large photo and quotations from Tubman, an anti-slavery advocate, from a web page about the Underground Railroad, but it was later restored . Pentagon web pages . Weeks after Trump returned to office, the Pentagon marked tens of thousands of web pages for deletion based on the DEI executive order’s standards. But after an outcry about the removal of a page about Jackie Robinson, the first Black major league baseball player, Robinson’s page was restored . It’s unclear whether other pages were restored and how many that were marked for deletion were formally deleted. Plantation grants . Two federal grants to the Whitney Plantation in Louisiana, which offers tours and exhibits about the realities of life under slavery, were initially rescinded, but later restored , The New York Times reported. In at least one case, the courts have blocked an administration action — the removal of biographical panels about nine people enslaved by the nation’s first president, George Washington, when Philadelphia was the nation’s capital. On Feb. 16, a federal judge ruled that the panels had to be returned; the federal government is appealing. In a statement to PolitiFact, White House spokesperson Taylor Rogers said the Interior Department “is engaged in an ongoing review of our nation’s American history exhibits in accordance with the president’s executive order to eliminate corrosive ideology, restore sanity, and reinstate the truth.” Rogers said the department’s actions are not finalized and she called the lawsuits “premature.” On Feb. 17, advocacy groups announced another lawsuit against the Trump administration, targeting the removal of civil rights information, as well as climate change and other subjects, at national parks. What is the impact? Historians said the administration’s moves are misguided. “The removal of this complex history from National Park Service sites is concerning, as these places are an important source of historical information for the general public,” said Harris, the Northwestern University historian. For example, the removal of the historical panels about people enslaved by George Washington “erases heroic and inspirational American stories of courage and patriotism” by enslaved people, said James Madison University historian Steven A. Reich. The removal of exhibits or historical information also endangers freedom of thought, a cornerstone of democracy, Reich said. “How to tell the story of the country’s past, in a democratic society, is as open and fluid as the debate over any matter of public policy,” he said. For Trump, who has touted his improved performance among Black voters in the 2024 election, the executive orders he’s signed make it “hard to argue that he wants to help Black people,” said Andra Gillespie, an Emory University political scientist. Staff researcher Caryn Baird contributed to this report. This fact check was originally published by PolitiFact , which is part of the Poynter Institute. See the sources for this fact check here . Poynter is a nonprofit dedicated to keeping journalism strong, relevant, and grounded in sound values. Join our donor community, the First Amendment Society, to help us continue this critical work. DONATE Tags: Black History Month , PolitiFact , President Donald Trump Louis Jacobson Louis Jacobson has been with PolitiFact since 2009, currently as chief correspondent. Previously, he served as senior correspondent and deputy editor. Before joining PolitiFact, he… Louis Jacobson Cash-starved and censored, America’s student newspapers are fighting to survive Shrinking budgets and university pressure are squeezing the next generation of journalists February 23, 2026 Barbara Allen Opinion | Did President Trump call into C-SPAN under a fake name? A caller who sounded remarkably like Trump complained in his favor. C-SPAN says it wasn’t him. But it’s easy to believe he’d do something like that. February 23, 2026 Tom Jones Why Canada still doesn’t have a full-time fact-checking beat Canadian Daniel Dale became a star fact-checking Trump. Back home, the work remains ad hoc. That says a lot about Canadian politics and media. February 23, 2026 Louis Jacobson Why Donald Trump and Barack Obama are suddenly talking about aliens A viral Obama podcast answer about aliens prompted Trump to accuse him of revealing secrets and promise to release UFO files February 23, 2026 Maria Briceño Opinion | Stephen Colbert’s interview with James Talarico finds massive audience online The full clip has garnered “more than twice the daily average” on Colbert’s YouTube channel, according to data. February 20, 2026 Tom Jones Back to News Comments Cancel reply You must be logged in to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed. Start your day informed and inspired. Subscribe Get the Poynter newsletter that's right for you. Media Jobs Sales and Marketing Specialist - SAN ANTONIO, TX (78229) Sinclair Inc WOAI/KABB-TV Spring 2027 T. Anthony Pollner Distinguished Professorship - Missoula, MT (59812) University of Montana Journalism Editorial Page Editor - Charleston, SC (29403) Evening Post Publishing Newspaper Group Program Director, Grants - Remote Tarbell Center for AI Journalism Program Director, Fellowship - Remote Tarbell Center for AI Journalism Membership Coordinator/WUFT-TV/FM and WJUF-FM - Gainesville, FL (32611) University of Florida Assistant Chief Engineer - Chapel Hill, NC (27517) WUNC - FM Director of Marketing & Communication - Needham, MA (02492) Camp Kingswood Assistant Camp Director - Marketing & Communications - Needham, MA (02492) Camp Kingswood Lecturer & Teacher-Special Programs - Graduate School of Journalism - Berkeley, CA (94720) University of California Berkeley Search Media Jobs Advertise a job",
    "url": "https://www.poynter.org/fact-checking/2026/trump-administration-altering-black-history/",
    "publication_date": "Fri, 20 Feb 2026 11:30:09 +0000",
    "date_gathered": "2026-02-24T03:36:15.062917",
    "country": "US",
    "organization": "Poynter"
  },
  {
    "title": "CBS keeps finding new ways to have a bad week",
    "content": "Commentary Newsletters CBS late-night host Stephen Colbert, shown here at the Emmy Awards last September. (Jordan Strauss/Invision for the Television Academy/AP Content Services) By: Tom Jones February 19, 2026 This is The Poynter Report, your daily guide to the news about news. Subscribe to get it in your inbox every weekday. It has been another awkward and miserable week at CBS. The network has been in the news a lot. And not in a positive way. First, CBS News lost one of the most respected journalists in the business when Anderson Cooper announced he was stepping away from the venerable “60 Minutes” after nearly two decades. It’s true that Cooper has a ton of other jobs to keep him busy, most notably hosting a weeknight show on CNN. And, in his statement about leaving the news magazine show, Cooper said he wanted to spend more time with his family. (Don’t people always say that?) But Status’ Oliver Darcy also reported that “Cooper had grown increasingly uneasy with the rightward direction the network has charted under” CBS News editor-in-chief Bari Weiss and David Ellison’s ownership of CBS’ parent company, Paramount. Whatever the reason, Cooper’s departure — and the rumored unrest among others on the “60 Minutes” staff — has the program itself and the news division as a whole in a state of uncertainty. Then came the whole Stephen Colbert drama. By now, you know the late-night host wanted to have Texas Democratic Senate candidate James Talarico on the show, but claims he was told “in no uncertain terms by our network’s lawyers, who called us directly, that we could not have him on the broadcast.” The network, according to Colbert, was worried about the Federal Communications Commission rule about equal time, which means if a station gives airtime to one candidate, then that station must offer an equal amount of time to other candidates in that contest, should they ask for it. Late-night shows typically don’t fall under the “equal-time” rules. However, FCC commissioner Brendan Carr has questioned the talk-show exemption and even launched an investigation into ABC’s “The View” regarding the equal time rule after Talarico appeared on that show. All of that, apparently, was enough to spook CBS into, according to Colbert, telling him he couldn’t have Talarico on his show. ( The interview ended up on the show’s YouTube channel, where it has way more views — more than 6.3 million as of Wednesday — than it would have gotten on the actual CBS show.) The network and Colbert have gone back and forth over the details of what happened. It sort of came to a close Tuesday night when Colbert, on his show, said he wasn’t “mad” at CBS and doesn’t want an “adversarial relationship with the network.” He then said he had no idea what to do with the CBS statement, which he held on a piece of paper in his hand. Then he jokingly picked it up with a bag and wrapped it up, as if it were dog poop. In the end, it was another messy situation in which CBS came out looking much worse than anyone else in this melodrama. As Salon’s Sophia Tesfaye wrote , “In the span of months, one of America’s most storied broadcast institutions has managed to alienate its most recognizable late-night host and lose one of its most respected journalists, all while inviting scrutiny over whether it is voluntarily bending the knee to political pressure from the Trump administration. The optics are catastrophic.” Tesfaye added, “What we are watching is the systematic dismantling of institutional independence in real time at one of the most historically significant news and entertainment corporations in America. Stephen Colbert is leaving in May. Anderson Cooper is already gone. What CBS should be asking itself is not how to manage the departure of the people who made it matter, but whether anyone left in the building still believes the mission is worth defending.” Smart point In talking about this whole FCC equal-time-late-night business, CNN media reporter and analyst Brian Stelter reminded viewers of a very smart point recently made by Don Lemon, the independent journalist recently arrested on charges that he violated federal law during a recent protest at a church in Minnesota. Lemon will likely win his case, and the late shows probably don’t need to worry about the FCC’s regulations on equal time, at least for now. But the point isn’t how it will all end. Stelter, quoting Lemon, said , “The process is the punishment.” In other words, all this hassle that Lemon has to go through — being charged, appearing in court, mounting a defense, and so on — is the part that drains someone and makes their life difficult. Same with, say, Colbert having to spend time dealing with all the fallout from having a guest interview nixed and living under a constant threat from the Trump administration, while also wondering if the network that canceled him is going to have his back. As Lemon said, and as Stelter reiterated: The process is the punishment. Which is why you see some places and people just give in to Trump and, for instance, settle lawsuits they would’ve likely won instead of fighting. Or, in the case of CBS and Colbert, the network, according to Colbert, didn’t air the interview to avoid a potential fight with the FCC. For many, the fight just isn’t worth it, and Trump seems to know that. What was that? There was an interesting moment during White House press secretary Karoline Leavitt’s briefing with the media on Wednesday. Leavitt was asked a question about something President Donald Trump posted on Truth Social. Trump essentially said British Prime Minister Keir Starmer was making a “big mistake” by entering into a lease of the U.S.-UK air base on Diego Garcia. (In a 2025 deal, Britain agreed to transfer the Chagos Islands to Mauritius but lease Diego Garcia back for 99 years so the base can continue operating.) A reporter asked specifically about Trump’s Truth Social post and what it meant in terms of America’s policy. Leavitt said, “The post should be taken as the policy of the Trump administration. It’s coming straight from the horse’s mouth. When you see it on Truth Social, you know it’s directly from President Trump. That’s the beauty of this president, and his transparency in relaying this administration’s policies to all of you and to the rest of the world.” To repeat, Leavitt said, “When you see it on Truth Social, you know it’s directly from President Trump.” Yet, wasn’t it just a week ago when Trump denied knowing anything about a Truth Social post under his name that depicted former President Barack Obama and his wife, Michelle, as apes? At the time, White House officials blamed the video on a staffer, and Trump said he “didn’t see the whole thing.” He also refused to apologize, saying, “I didn’t make a mistake.” But now Leavitt is claiming that if you see it on Truth Social, it came from Trump. O’Donnell back to mornings? CBS News’ Norah O’Donnell, shown here in 2019. (Jason Mendez/Invision/AP) The New York Post’s Alexandra Steigrad reports that Norah O’Donnell will fill in as co-host on “CBS Mornings” for a few days next week. It will be something of a homecoming for O’Donnell, who was a co-host on the morning program — then called “CBS This Morning” — from 2012 to 2019. She left to become anchor of the “CBS Evening News,” a post she held until stepping away in 2025. O’Donnell’s return next week is sparking rumors about coming back to the morning show full-time. Tony Dokoupil recently left as co-host of “CBS Mornings” to become anchor of the “CBS Evening News.” Dokoupil was co-hosting with Gayle King and Nate Burleson. Steigrad wrote, “It is unclear if the move is a test to see if there’s any chemistry between King, O’Donnell, and co-host Nate Burleson, as top brass is looking to overhaul the struggling, last-place program.” However, Steigrad added, “A source close to CBS threw cold water on that idea, saying that O’Donnell is not being considered for the role and is instead part of a rotating cast of people to help fill in the gaps until a third co-host is named.” O’Donnell will be in New York as part of a book tour. She continues to work at CBS News as a senior correspondent. Thinking of their colleague Speaking of morning shows, the NBC “Today” show set was decorated with yellow ribbons and flowers in support of co-host Savannah Guthrie, who continues to be away from the program to attend to matters involving the disappearance of her 84-year-old mother, Nancy. The ribbons and flowers on the “Today” set were similar to the ones outside of Nancy Guthrie’s home in Arizona. She has been missing since Feb. 1. Pima County Sheriff Chris Nanos said this week that his department is chasing thousands of tips and leads. He told NBC News , “As long as we have the ability to chase a lead, it’s not cold. We’re not going to give up. We’re going to find Nancy, and we’re going to find out who did this.” One more In this newsletter on Tuesday, I wrote about the passing of actor Robert Duvall and how he was in two movies that centered around journalism: 1976’s “Network” and 1994’s “The Paper.” Then in Wednesday’s newsletter, I wrote about how I forgot that he played a journalist in another movie — the 1984 classic, “The Natural,” where he played a sportswriter. Well, a Poynter Report reader emailed to say I missed yet another movie where he was a journalist. Duvall played Joseph Pulitzer in the 1992 movie, “Newsies,” the musical drama loosely based on the New York City newsboys’ strike of 1899. It also starred a young Christian Bale. Let’s see how many more days we can keep this going. Media tidbits Mike Abrams, the deputy editor for trust at The New York Times, with “How The Times Handles the Congressional Hearing Circus.” The Hollywood Reporter’s Caitlin Huston with “MS NOW Inks Deal With Crooked Media to Air ‘Pod Save America’ and More on TV.” The Wall Street Journal’s Krystal Hur with “Berkshire Pares Stakes in Apple and BofA, Adds New York Times Position.” The George Polk Awards in Journalism were announced this week. Here is the list. The awards are presented by Long Island University and focus “on the intrepid, bold, and influential work of the reporters themselves, placing a premium on investigative work that is original, resourceful, and thought-provoking.” Hot type The Athletic’s Brendan Quinn with “What’s it like to have two grandchildren in the Winter Olympics? Let John Irving tell you.” (And, yes, it’s John Irving, the noted author whose works include “The World According to Garp,” “The Hotel New Hampshire” and “The Cider House Rules.” More resources for journalists Deadline day: Join a foundational career and leadership development 101 course — fully virtual for ambitious media professionals without direct reports. Apply now . Great Lakes journalists: Work on coverage strategies, gain reporting tools and spark regional connections in our free election coverage workshops. Apply now . Get the skills, policies, and editorial support to cover crime with depth, accuracy, and public service in mind. Apply now . Have feedback or a tip? Email Poynter senior media writer Tom Jones at tjones@poynter.org . Correction: The story has been updated to say the name of CBS’s morning show is “CBS Mornings.” A previous version called it by the wrong name. The Poynter Report is your daily dive into the world of media, packed with the latest news and insights. Get it delivered to your inbox Monday through Friday by signing up here . And don’t forget to tune into our biweekly podcast for even more. Poynter is a nonprofit dedicated to keeping journalism strong, relevant, and grounded in sound values. Join our donor community, the First Amendment Society, to help us continue this critical work. DONATE Tags: 60 Minutes , Anderson Cooper , bari weiss , CBS News , Commentary , David Ellison , Paramount , Stephen Colbert , The Poynter Report Tom Jones Tom Jones is Poynter’s senior media writer for Poynter.org. He was previously part of the Tampa Bay Times family during three stints over some 30… Tom Jones Cash-starved and censored, America’s student newspapers are fighting to survive Shrinking budgets and university pressure are squeezing the next generation of journalists February 23, 2026 Barbara Allen Opinion | Did President Trump call into C-SPAN under a fake name? A caller who sounded remarkably like Trump complained in his favor. C-SPAN says it wasn’t him. But it’s easy to believe he’d do something like that. February 23, 2026 Tom Jones Why Canada still doesn’t have a full-time fact-checking beat Canadian Daniel Dale became a star fact-checking Trump. Back home, the work remains ad hoc. That says a lot about Canadian politics and media. February 23, 2026 Louis Jacobson Why Donald Trump and Barack Obama are suddenly talking about aliens A viral Obama podcast answer about aliens prompted Trump to accuse him of revealing secrets and promise to release UFO files February 23, 2026 Maria Briceño Opinion | Stephen Colbert’s interview with James Talarico finds massive audience online The full clip has garnered “more than twice the daily average” on Colbert’s YouTube channel, according to data. February 20, 2026 Tom Jones Back to News Comments Cancel reply You must be logged in to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed. Start your day informed and inspired. Subscribe Get the Poynter newsletter that's right for you. Media Jobs Sales and Marketing Specialist - SAN ANTONIO, TX (78229) Sinclair Inc WOAI/KABB-TV Spring 2027 T. Anthony Pollner Distinguished Professorship - Missoula, MT (59812) University of Montana Journalism Editorial Page Editor - Charleston, SC (29403) Evening Post Publishing Newspaper Group Program Director, Grants - Remote Tarbell Center for AI Journalism Program Director, Fellowship - Remote Tarbell Center for AI Journalism Membership Coordinator/WUFT-TV/FM and WJUF-FM - Gainesville, FL (32611) University of Florida Assistant Chief Engineer - Chapel Hill, NC (27517) WUNC - FM Director of Marketing & Communication - Needham, MA (02492) Camp Kingswood Assistant Camp Director - Marketing & Communications - Needham, MA (02492) Camp Kingswood Lecturer & Teacher-Special Programs - Graduate School of Journalism - Berkeley, CA (94720) University of California Berkeley Search Media Jobs Advertise a job",
    "url": "https://www.poynter.org/commentary/2026/cbs-news-anderson-cooper-stephen-colbert/",
    "publication_date": "Thu, 19 Feb 2026 12:30:59 +0000",
    "date_gathered": "2026-02-24T03:36:15.313669",
    "country": "US",
    "organization": "Poynter"
  },
  {
    "title": "When newspapers cut book coverage, communities lose more than reviews",
    "content": "Business & Work Ethics & Trust (Simple Line/Shutterstock) By: Amaris Castillo February 19, 2026 Laurie Hertzel remembers the old building on Portland Avenue in downtown Minneapolis and the space it had carved out just for books. At the time, she was the Minneapolis Star Tribune’s books editor, a fitting role for the daughter of a librarian and an English professor. The book room was in the basement, deep in the bowels of the building. Hertzel wheeled an old grocery shopping cart onto the elevator and down to where the printing presses once stood. Nobody, she remembers, went down there. Except maybe the mice. But there was the book room. “It had a locked door and you’d walk in and turn the light on, and it was just this wonderful space because it had shelves all the way around and it had this long table for sorting books,” Hertzel said. “It had no windows, but you could shut the door and you could just be down there, and it was like a clean, well-lighted space.” Each month, Hertzel received about 1,000 books in the mail from publishers and authors eager for coverage. Piles of advance reader copies and books filled the room. At the time, the Star Tribune devoted two open Sunday pages for book reviews and literary news. Hertzel later expanded coverage by penning and commissioning reviews on Tuesdays, the industry’s standard release day for new books. She would load the cart with books and head back up to the third-floor newsroom. The U.S. publishing industry is massive, generating about $30 billion of annual revenue, according to the Association of American Publishers . But despite all that money, newspaper book coverage is disappearing. The Associated Press ceased its weekly book reviews last year, and The Washington Post ended its book section earlier this month amid mass layoffs. “I don’t know why newspapers have done it, and they’ve done it across the board almost,” said Colette Bancroft, former books editor for the Tampa Bay Times, who has witnessed this hollowing out for more than a decade. “I’m not sure why. I have never understood it.” There are a number of culprits: Staff reductions, shrinking newspaper budgets, reader habits that are rapidly shifting towards the digital realm. When a community loses book coverage, it creates a ripple effect. Writers lose visibility, stunting their reach. Readers lose out on books and ideas they may not come across if they’re not already plugged into Bookstagram or BookTok. Local arts lose support. Freelancers and critics lose income. “What we’ve seen in the last decade is diminishing coverage for books across the entire country, and it is really devastating for writers,” said award-winning author Cleyvis Natera. “Because for many of us, we’ve been working on our books for years, and it is still very difficult to have a direct path to connect with readers outside of our local environment and outside of our own personal networks.” Both of Natera’s books — “Neruda on the Park” and “The Grand Paloma Resort” — received reviews in The New York Times, which she described as very meaningful. Her debut also received some coverage from local outlets in New Jersey, where she lives, but it was minimal. Her latest book received even less local attention. “I had my publicist reach out and, unfortunately, a lot of the newspapers are no longer running book reviews or (have) limited resources.” Before Kali Fajardo-Anstine ’s widely acclaimed short story collection “Sabrina & Corina” was published in 2019, she spent years as an independent bookseller in Colorado. The National Book Award finalist recalls how someone would always bring in The New York Times Book Review, the weekly Sunday supplement dedicated to books. “And we would look, what should we be ordering, what books are getting coverage,” she said. Fajardo-Anstine has since published “Woman of Light,” an award-winning novel about a tea leaf reader and laundress who fights to save her family’s stories in 1930s Denver. But neither of her books received a standalone review in major U.S. newspapers like The New York Times. The Boston Globe did review “Woman of Light.” So did The Guardian . Locally, The Denver Post did a feature on the author. For the award-winning Fajardo-Anstine, navigating the lack of traditional newspaper coverage has been confusing. Smaller papers in Denver and word-of-mouth have helped her work gain traction. She remains hopeful about future books. Allison K Hill, chief executive officer of the American Booksellers Association , said independent bookstores can relate to the challenges newspapers face. But, she noted, cutting book coverage is a missed opportunity to reimagine it rather than retreat from it. “On a Venn diagram, the circles of book readers and newspaper readers overlap significantly; book coverage is an opportunity for newspapers to lean in, not out,” Hill told Poynter in an email. There are now fewer staff book critics at newspapers, which Adam Dalva says is a shame. He is the president of the National Book Critics Circle , an organization of more than 800 members that supports book criticism. “I love when critics have this kind of perch where they can say, ‘I’m going to build a corpus, or a body of thought, around books, instead of exclusively using freelancers,’” he said. “There are so few full-time book critics left in America.” Dalva, himself an author, said newspapers and magazines now more often commission reviews from other authors. But he wants people to remember the cultural importance of books. “In the long run, what we’re doing when we run book reviews is building a network of thought that can carry forward for many years. And we find that books offer the kind of slow thinking and careful deliberation that reflect on society and feed into every form of culture and politics and life,” Dalva said. “I think a book section, if it’s robust and vibrant, is able to provide commentary on everything that’s happening, say, in America or in the world.” In 2024, Colette Bancroft took a buyout , leaving her role as books editor at the Pulitzer Prize-winning Tampa Bay Times after 17 years. For roughly the first half of her tenure, she had a budget to pay freelancers. Then it disappeared. Bancroft recalled the common sentiment that book coverage doesn’t get enough readers. “I know they swear by the clicks, and those clicks are real, but I don’t know, to me it’s part of serving your community to cover arts in your community,” she said. “And it makes it much harder for local arts organizations to survive if they don’t have support from news organizations in their community.” Bancroft, who has since returned to Arizona, continues to write for Bay Magazine, the Tampa Bay Times’ luxury lifestyle magazine. She knows she’s not the only books editor whose role disappeared and wasn’t replaced. It’s part of a broader trend she still struggles to understand. News outlets need readers, and people who love to read, she said, tend to read both books and newspapers. “And if you dump newspaper coverage, you’re kind of shooting yourself in the foot.” Back in Minnesota, Laurie Hertzel retired from the Star Tribune in 2023. She now teaches in the low-residency MFA in narrative nonfiction program at the University of Georgia in Athens and also reviews books as a freelancer for The Boston Globe and, until recently, The Washington Post. Book coverage, once a core part of newspaper criticism, has undeniably diminished. “I think it’s very sad, because newspapers traditionally have been kind of a generalist outlet. … It’s supposed to be an array of things that are important to the community that the newspaper covers.” Hertzel said those decisions are made by higher-ups, a role she never held. “But it seems very shortsighted to me, to start cutting things that people do read. And does everybody read book coverage? No. But I will tell you, the ones who do are fervent about it.” Poynter is a nonprofit dedicated to keeping journalism strong, relevant, and grounded in sound values. Join our donor community, the First Amendment Society, to help us continue this critical work. DONATE Tags: Book coverage , book reviews , books editors , Newspaper book coverage , The Boston Globe , The Minneapolis Star Tribune , The New York Times , The Washington Post Amaris Castillo Amaris Castillo is a writing/research assistant for the NPR Public Editor and a staff writer for Poynter.org. She’s also the creator of Bodega Stories and… Amaris Castillo Cash-starved and censored, America’s student newspapers are fighting to survive Shrinking budgets and university pressure are squeezing the next generation of journalists February 23, 2026 Barbara Allen Opinion | Did President Trump call into C-SPAN under a fake name? A caller who sounded remarkably like Trump complained in his favor. C-SPAN says it wasn’t him. But it’s easy to believe he’d do something like that. February 23, 2026 Tom Jones Why Canada still doesn’t have a full-time fact-checking beat Canadian Daniel Dale became a star fact-checking Trump. Back home, the work remains ad hoc. That says a lot about Canadian politics and media. February 23, 2026 Louis Jacobson Why Donald Trump and Barack Obama are suddenly talking about aliens A viral Obama podcast answer about aliens prompted Trump to accuse him of revealing secrets and promise to release UFO files February 23, 2026 Maria Briceño Opinion | Stephen Colbert’s interview with James Talarico finds massive audience online The full clip has garnered “more than twice the daily average” on Colbert’s YouTube channel, according to data. February 20, 2026 Tom Jones Back to News Comments Perhaps it would be worth looking into how many ads publishers run to support these book sections. I suspect not much, if any. Have you looked at The New York Times Book Review lately? Log in to Reply Cancel reply You must be logged in to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed. Start your day informed and inspired. Subscribe Get the Poynter newsletter that's right for you. Media Jobs Sales and Marketing Specialist - SAN ANTONIO, TX (78229) Sinclair Inc WOAI/KABB-TV Spring 2027 T. Anthony Pollner Distinguished Professorship - Missoula, MT (59812) University of Montana Journalism Editorial Page Editor - Charleston, SC (29403) Evening Post Publishing Newspaper Group Program Director, Grants - Remote Tarbell Center for AI Journalism Program Director, Fellowship - Remote Tarbell Center for AI Journalism Membership Coordinator/WUFT-TV/FM and WJUF-FM - Gainesville, FL (32611) University of Florida Assistant Chief Engineer - Chapel Hill, NC (27517) WUNC - FM Director of Marketing & Communication - Needham, MA (02492) Camp Kingswood Assistant Camp Director - Marketing & Communications - Needham, MA (02492) Camp Kingswood Lecturer & Teacher-Special Programs - Graduate School of Journalism - Berkeley, CA (94720) University of California Berkeley Search Media Jobs Advertise a job",
    "url": "https://www.poynter.org/business-work/2026/why-dont-newspapers-review-books-anymore/",
    "publication_date": "Thu, 19 Feb 2026 12:00:57 +0000",
    "date_gathered": "2026-02-24T03:36:15.507950",
    "country": "US",
    "organization": "Poynter"
  },
  {
    "title": "Viral posts falsely name Savannah Guthrie’s husband as a ‘co-conspirator’ in the Epstein files",
    "content": "Fact-Checking Michael Feldman, left, and Savannah Guthrie attend the third annual World Mental Health Day Gala, hosted by Project Healthy Minds, at Spring Studios on Thursday, Oct. 9, 2025, in New York. (Photo by Evan Agostini/Invision/AP) By: Maria Briceño February 19, 2026 After Nancy Guthrie’s Feb.1 abduction from her Tucson, Arizona, home, her daughter “Today” host Savannah Guthrie put out a call on social media for tips on her mother’s whereabouts, pleading for her safe return. So far, social media users have been less than helpful. With the Justice Department’s Jan. 30 release of more than 3 million pages of files related to Jeffrey Epstein, X users proposed bogus links between the abduction and the file release. Multiple X posts include a photo of Savannah Guthrie’s family and an accusation about her husband, Michael Feldman. “Her husband’s company is listed as a co conspirator in the Epstein files… FGS Global,” reads a Feb. 12 X post with over 1 million views. “In case you’re wondering why now of all times for Savannah Guthrie’s mother to be ‘kidnapped.'” The co-anchor’s husband isn’t named in the Epstein files, and neither is his current company. Searching the digital Epstein files , we found one 2013 email to Epstein from a person named Michael Feldman, but it seems to be someone else, introducing himself as a “theoretical physicist.” Guthrie’s husband is a communications consultant who previously worked in the Clinton administration as chief liaison to Congress and senior adviser for former Vice President Al Gore. Feldman currently works as North American co-chairman of FGS Global, an international public relations firm. We did not find FGS Global listed in Justice Department files, but another public affairs company that was merged to found FGS Global was listed. As a community note on one of the X posts said, Feldman helped found Glover Park Group in 2001, and its name appears twice in the Epstein files. The firm merged with other companies to form FGS Global in 2021. PolitiFact reached out to FGS Global, but didn’t receive an immediate response. The first mention was in 2014. The office of Terje Rød-Larsen, a former diplomat and former president of the International Peace Institute , shared a list of articles with Epstein, and one story mentioned the Glover Park Group’s work lobbying for Egyptian interests. The second was in a 2015 email forwarded by Larry Summers, former U.S. Treasury secretary and former Harvard University president. Summers suggested that Epstein contact Joe Lockhart, who worked at the Glover Park Group and served as press secretary during the Clinton administration, as well as other Democratic politicians. The initial email says Lockhart “helped Clinton and Genera= (sic) Petraeus.” (Former CIA director and retired U.S. Army Gen. David Petraeus had an extramarital affair uncovered in 2012.) Screenshot of a Jan. 8, 2015, email exchange in the Epstein files These mentions are not evidence that Feldman, FGS Global or Glover Park Group were “co-conspirators” with Epstein. Being mentioned in the files does not mean criminal wrongdoing. We reported in 2025 that figures such as President Donald Trump and Clinton appear in the files, but that doesn’t mean they are guilty or charged with crimes. As of February 2026, Epstein and his coconspirator Ghislaine Maxwell are the only people who have been convicted in the scheme to sexually exploit and abuse multiple minor girls. Pima County Sheriff Chris Nanos said Feb. 16 on X that the Guthrie family, including “all siblings and spouses,” had been cleared as possible suspects in the Nancy Guthrie case. We rate the X posts’ claims about Guthrie’s husband’s company False. This fact check was originally published by PolitiFact , which is part of the Poynter Institute. See the sources for this fact check here . Poynter is a nonprofit dedicated to keeping journalism strong, relevant, and grounded in sound values. Join our donor community, the First Amendment Society, to help us continue this critical work. DONATE Tags: Epstein files , Jeffrey Epstein , PolitiFact , Savannah Guthrie Maria Briceño Maria Briceño is a PolitiFact reporting fellow who fact-checks misinformation in Spanish at PolitiFact. She previously interned as a space reporter with WMFE 90.7 in… Maria Briceño Cash-starved and censored, America’s student newspapers are fighting to survive Shrinking budgets and university pressure are squeezing the next generation of journalists February 23, 2026 Barbara Allen Opinion | Did President Trump call into C-SPAN under a fake name? A caller who sounded remarkably like Trump complained in his favor. C-SPAN says it wasn’t him. But it’s easy to believe he’d do something like that. February 23, 2026 Tom Jones Why Canada still doesn’t have a full-time fact-checking beat Canadian Daniel Dale became a star fact-checking Trump. Back home, the work remains ad hoc. That says a lot about Canadian politics and media. February 23, 2026 Louis Jacobson Why Donald Trump and Barack Obama are suddenly talking about aliens A viral Obama podcast answer about aliens prompted Trump to accuse him of revealing secrets and promise to release UFO files February 23, 2026 Maria Briceño Opinion | Stephen Colbert’s interview with James Talarico finds massive audience online The full clip has garnered “more than twice the daily average” on Colbert’s YouTube channel, according to data. February 20, 2026 Tom Jones Back to News Comments Cancel reply You must be logged in to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed. Start your day informed and inspired. Subscribe Get the Poynter newsletter that's right for you. Media Jobs Sales and Marketing Specialist - SAN ANTONIO, TX (78229) Sinclair Inc WOAI/KABB-TV Spring 2027 T. Anthony Pollner Distinguished Professorship - Missoula, MT (59812) University of Montana Journalism Editorial Page Editor - Charleston, SC (29403) Evening Post Publishing Newspaper Group Program Director, Grants - Remote Tarbell Center for AI Journalism Program Director, Fellowship - Remote Tarbell Center for AI Journalism Membership Coordinator/WUFT-TV/FM and WJUF-FM - Gainesville, FL (32611) University of Florida Assistant Chief Engineer - Chapel Hill, NC (27517) WUNC - FM Director of Marketing & Communication - Needham, MA (02492) Camp Kingswood Assistant Camp Director - Marketing & Communications - Needham, MA (02492) Camp Kingswood Lecturer & Teacher-Special Programs - Graduate School of Journalism - Berkeley, CA (94720) University of California Berkeley Search Media Jobs Advertise a job",
    "url": "https://www.poynter.org/fact-checking/2026/michael-feldman-fgs-global-epstein-files/",
    "publication_date": "Thu, 19 Feb 2026 11:30:55 +0000",
    "date_gathered": "2026-02-24T03:36:15.729667",
    "country": "US",
    "organization": "Poynter"
  },
  {
    "title": "What Ash Wednesday can teach journalists about truth and humility",
    "content": "Commentary Ethics & Trust Father Fabian Arias places an ash cross on the forehead of a devotee during Ash Wednesday outside the Jacob K. Javits federal building, Wednesday, Feb. 18, 2026, in New York. (AP Photo/Yuki Iwamura) By: Fernanda Camarena February 18, 2026 Ash Wednesday begins with a fact. “Remember that you are dust, and to dust you shall return.” Growing up, hearing that phrase in church felt heavy in a way I didn’t yet understand. Today, as a faithful Catholic and journalist, it feels simple, clarifying and honest. Ash Wednesday marks the beginning of Lent, a season marked by repentance, fasting, reflection and, on Easter Sunday, a celebration of Jesus’ resurrection. In church, a priest traces a small cross of ashes on your forehead and repeats that same reminder about dust. It’s an invitation to reflect and remember that none of us is bigger than the truth and God. It’s a time to remember that what we do matters, and that our time is limited. It emphasizes confronting our limits, biases and failures. That idea should resonate with journalists. The Society of Professional Journalists’ Code of Ethics begins with a clear guideline: Seek truth and report it . It calls journalists to strive for accuracy, fairness, transparency and accountability. So when Pope Leo XIV released his message for Lent this year , it hit home. He called for three things: deeper listening, fasting from harmful language and stronger relationships with one another. It wasn’t abstract. It offered practical guidance and a solid framework that speaks directly to the ethical demands of journalism today. Here are some highlights from the three parts of his message. Listening: ‘Enter into relationship’ Pope Leo XIV wrote, “The willingness to listen is the first way we demonstrate our desire to enter into relationship with someone.” He added: “God himself teaches us that listening is one of his defining characteristics.“ When I read those lines, I couldn’t stop thinking about our duties as journalists — what reporters, managers and entire newsrooms do when we’re at our best. I teach active listening in Poynter leadership programs. It’s a foundational newsroom pillar. Trust is not built in the moment we hit publish or share on social media. It’s built in the moments when we slow down and listen to the communities we aim to serve — their fears, frustrations and grief. Listening is a skill we can develop and learn. Done right, it protects us from projecting our assumptions and helps us look through a lens of empathy. Moana Ramírez, vice president of newsgathering at Univision Network, spends a lot of time thinking about how to keep her audience’s trust. I met her while leading a training session with her former team in San Antonio and she soon became a friend who I enjoy chatting with about journalism issues. “With all the newsroom noise, it’s a unique challenge to distinguish between the actual story and what really matters,” she said in an email. She also shared one example. “We recently did a story about a woman who was being evicted from her home with her 11-year-old twin girls, her 10-year-old son and 21-year-old daughter after her eldest son was recently detained and waiting for deportation. As we helped the woman not be evicted that cold Tuesday night in January, we found ourselves being the link between community resources and the community that believes in our mission as journalists to help them.” Journalism is a public service, and sometimes that means making difficult choices. “During the development of the story, we made a hard stop when we realized that we would be harming the mother more than helping her by airing her story,” Moana wrote. “We feared that she would be identified and deported. We did the behind-the-scenes work because we felt the need.” It wasn’t easy, but the newsroom made its journalistic mission and values a priority. “This story and the decision to make the hard stop was part of our collective listening,” she said, “and it matters because its what keeps us human as journalists in a difficult time to cover stories like these.” Moana, who serves on Poynter’s National Advisory Board and is a practicing Catholic, said the responsibility of leading a newsroom that serves the migrant community is one she doesn’t take for granted. Fasting: ‘Disarming our language’ Pope Leo, in his Lenten message, said: “If Lent is a time for listening, fasting is a concrete way to prepare ourselves to receive the word of God.” For Christians, fasting — going without food for a set period of time — is meant to help us grow. But Pope Leo expanded the traditional definition, suggesting that besides giving up food, we should remove harmful language from our lives. He wrote: “I would like to invite you to a very practical and frequently unappreciated form of abstinence: that of refraining from words that offend and hurt our neighbor. Let us begin by disarming our language, avoiding harsh words and rash judgment, refraining from slander and speaking ill of those who are not present and cannot defend themselves.” Quite a message, given that the temperature in our society, social media feeds and daily lives seems to increase with each passing week. The Pope continued: “Let us strive to measure our words and cultivate kindness and respect in our families, among our friends, at work, on social media, in political debates, in the media and in Christian communities. In this way, words of hatred will give way to words of hope and peace.” Together: ‘Building a civilization of love’ Pope Leo’s words remind us that our Lenten journey isn’t just personal, but something experienced as a community. For journalists, that means our work is more than reporting facts. It’s about the way we listen to the needs of our audiences, the words we choose and the choices we make in answering one of the most fundamental questions: What is our journalistic mission and purpose? Moana shared an example that speaks directly to this. “We have been covering the immigration topic for years, and most recently seen firsthand all the detentions that are being done in Central Texas,” she said. “We had an in-depth conversation in our morning editorial when our EP (executive producer) was brave enough to ask, ‘ Con que fin estamos cubriendo estas historias ’ (‘What is our intention when covering these stories’) that seem to be repetitive and seem to have no solution?” The newsroom paused. Her story continued. “This made us reflect and critically think about our responsibility to be the voice for the immigrants inside the detention centers, as well as be the link to their stories with the politicians that can actually make a change.” Right then and there, Moana’s team established a mission statement for covering the migrant community. “These immigrants have told us firsthand that they watch Televisa Univision on a daily basis and they are grateful of the countless stories we have been telling all with heart and dignity to their immigration status,” she added. Pope Leo’s message concludes: “Let us strive to make our communities places where the cry of those who suffer finds welcome, and listening opens paths towards liberation, making us ready and eager to contribute to building a civilization of love.” A beautiful message, emphasizing that it’s not about us as individuals, but our service for others, done with humility. I hope you all have a reflective and meaningful Lenten season. Poynter is a nonprofit dedicated to keeping journalism strong, relevant, and grounded in sound values. Join our donor community, the First Amendment Society, to help us continue this critical work. DONATE Tags: Commentary , Ethics , Leadership , Lent , pope leo xiv , trust Fernanda Camarena Fernanda Camarena is an award-winning journalist with more than 20 years of experience in the media industry. As a full-time faculty member at Poynter Institute,… Fernanda Camarena Cash-starved and censored, America’s student newspapers are fighting to survive Shrinking budgets and university pressure are squeezing the next generation of journalists February 23, 2026 Barbara Allen Opinion | Did President Trump call into C-SPAN under a fake name? A caller who sounded remarkably like Trump complained in his favor. C-SPAN says it wasn’t him. But it’s easy to believe he’d do something like that. February 23, 2026 Tom Jones Why Canada still doesn’t have a full-time fact-checking beat Canadian Daniel Dale became a star fact-checking Trump. Back home, the work remains ad hoc. That says a lot about Canadian politics and media. February 23, 2026 Louis Jacobson Why Donald Trump and Barack Obama are suddenly talking about aliens A viral Obama podcast answer about aliens prompted Trump to accuse him of revealing secrets and promise to release UFO files February 23, 2026 Maria Briceño Opinion | Stephen Colbert’s interview with James Talarico finds massive audience online The full clip has garnered “more than twice the daily average” on Colbert’s YouTube channel, according to data. February 20, 2026 Tom Jones Back to News Comments Cancel reply You must be logged in to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed. Start your day informed and inspired. Subscribe Get the Poynter newsletter that's right for you. Media Jobs Sales and Marketing Specialist - SAN ANTONIO, TX (78229) Sinclair Inc WOAI/KABB-TV Spring 2027 T. Anthony Pollner Distinguished Professorship - Missoula, MT (59812) University of Montana Journalism Editorial Page Editor - Charleston, SC (29403) Evening Post Publishing Newspaper Group Program Director, Grants - Remote Tarbell Center for AI Journalism Program Director, Fellowship - Remote Tarbell Center for AI Journalism Membership Coordinator/WUFT-TV/FM and WJUF-FM - Gainesville, FL (32611) University of Florida Assistant Chief Engineer - Chapel Hill, NC (27517) WUNC - FM Director of Marketing & Communication - Needham, MA (02492) Camp Kingswood Assistant Camp Director - Marketing & Communications - Needham, MA (02492) Camp Kingswood Lecturer & Teacher-Special Programs - Graduate School of Journalism - Berkeley, CA (94720) University of California Berkeley Search Media Jobs Advertise a job",
    "url": "https://www.poynter.org/commentary/2026/pope-leo-xiv-message-ash-wednesday-journalism/",
    "publication_date": "Wed, 18 Feb 2026 17:50:18 +0000",
    "date_gathered": "2026-02-24T03:36:15.985218",
    "country": "US",
    "organization": "Poynter"
  }
]