[
  {
    "title": "Ataque ao Irão: Trump dá tempo à diplomacia de Kushner e Witkoff, general aponta riscos",
    "content": "Ouça este artigo 00:00 05:02 Exclusivo Gostaria de Ouvir? Assine já O Presidente norte-americano, Donald Trump, fará depender a sua decisão sobre um novo ataque militar ao Irão daquilo que os seus enviados especiais, Jared Kushner e Steve Witkoff, lhe disserem sobre uma nova ronda de negociações a ter lugar em Genebra, na quinta-feira, com o ministro iraniano dos Negócios Estrangeiros, Abbas Araghchi, sobre o programa nuclear de Teerão. O processo de decisão é relatado esta segunda-feira pelo site Axios e os jornais Washington Post e The Guardian , que dão conta ainda das reservas levantadas pelo chefe do Estado-Maior conjunto, general Dan Caine, face à opção militar. Os leitores são a força e a vida do jornal O contributo do PÚBLICO para a vida democrática e cívica do país reside na força da relação que estabelece com os seus leitores.Para continuar a ler este artigo assine o PÚBLICO.Ligue - nos através do 808 200 095 ou envie-nos um email para assinaturas.online@publico.pt .",
    "url": "https://www.publico.pt/2026/02/24/mundo/noticia/ataque-irao-trump-tempo-diplomacia-kushner-witkoff-general-aponta-riscos-2165789",
    "publication_date": "Tue, 24 Feb 2026 00:42:31 GMT",
    "date_gathered": "2026-02-24T04:13:52.687137",
    "country": "US",
    "organization": "PUBLICO"
  },
  {
    "title": "O problema do marxismo",
    "content": "Ouça este artigo 00:00 02:13 Exclusivo Gostaria de Ouvir? Assine já Conheci (e li) muitos marxistas ao longo da vida e o que mais me espanta é nunca ter ouvido da boca deles um único \"não sei\" ou \"não faço ideia\". Os leitores são a força e a vida do jornal O contributo do PÚBLICO para a vida democrática e cívica do país reside na força da relação que estabelece com os seus leitores.Para continuar a ler este artigo assine o PÚBLICO.Ligue - nos através do 808 200 095 ou envie-nos um email para assinaturas.online@publico.pt .",
    "url": "https://www.publico.pt/2026/02/24/opiniao/cronica/problema-marxismo-2165729",
    "publication_date": "Tue, 24 Feb 2026 00:15:00 GMT",
    "date_gathered": "2026-02-24T04:13:53.579447",
    "country": "US",
    "organization": "PUBLICO"
  },
  {
    "title": "PSD de Cascais dá pelouros municipais ao Chega e PS entrega os seus em protesto",
    "content": "Ouça este artigo 00:00 05:23 Exclusivo Gostaria de Ouvir? Assine já Depois de ter assinado no final de Outubro um acordo de governação com o PS com a atribuição dos pelouros ligados à economia, emprego e gestão de fundos, o presidente social-democrata da Câmara Municipal de Cascais, Nuno Piteira Lopes, assinou agora um acordo também com os dois vereadores eleitos pelo Chega, a quem deu os pelouros da transparência e do desporto. O vereador socialista João Ruivo confirmou ao PÚBLICO que nesta terça-feira o partido vai entregar, na reunião pública da câmara, os pelouros que lhe tinham sido atribuídos, assim como a Alexandra Domingos. Os leitores são a força e a vida do jornal O contributo do PÚBLICO para a vida democrática e cívica do país reside na força da relação que estabelece com os seus leitores.Para continuar a ler este artigo assine o PÚBLICO.Ligue - nos através do 808 200 095 ou envie-nos um email para assinaturas.online@publico.pt .",
    "url": "https://www.publico.pt/2026/02/23/politica/noticia/psd-cascais-pelouros-municipais-chega-ps-entrega-protesto-2165788",
    "publication_date": "Mon, 23 Feb 2026 23:59:00 GMT",
    "date_gathered": "2026-02-24T04:13:54.389104",
    "country": "US",
    "organization": "PUBLICO"
  },
  {
    "title": "O que tem Luís Neves para ser amado por todos?",
    "content": "Luís Neves já tomou posse como novo ministro da Administração Interna e prometeu abraçar “todas as propostas positivas” que lhe cheguem. Tendo deixado a Polícia Judiciária (PJ) a poucos meses de concluir o seu terceiro mandato como director nacional, o novo ministro afasta quaisquer “reservas” quanto a esta transição e explica ter sentido o apelo para “abraçar este novo projecto”. A escolha de Luís Neves é uma boa surpresa de Luís Montenegro? O Soundbite está disponível de segunda a sexta-feira em todas as aplicações para escuta de podcasts — como a Apple Podcasts ou o Spotify —​ e na área de podcasts do site do PÚBLICO .",
    "url": "https://www.publico.pt/2026/02/23/politica/noticia/luis-neves-amado-2165699",
    "publication_date": "Mon, 23 Feb 2026 23:37:42 GMT",
    "date_gathered": "2026-02-24T04:13:54.742745",
    "country": "US",
    "organization": "PUBLICO"
  },
  {
    "title": "Benfica em vantagem no <em>derby </em>com o Sporting com golo no fim",
    "content": "Ouça este artigo 00:00 02:44 Exclusivo Gostaria de Ouvir? Assine já O Benfica colocou-se nesta segunda-feira em vantagem na corrida à presença na final a quatro da Liga dos Campeões de futsal, ao derrotar no Pavilhão da Luz o rival Sporting por 4-3, em jogo da primeira mão dos quartos-de-final. “Águias” e “leões” voltaram a encontrar-se apenas quatro dias depois de um embate entre ambos, mas a contar para o campeonato nacional, e que terminou com uma igualdade a dois golos . Desta vez, a partida era para as provas europeias e no Pavilhão da Luz, e o duelo não desiludiu. Num jogo intenso e bem disputado, muito equilibrado do início ao fim, o Sporting colocou-se em vantagem aos 15’, por intermédio de Bruno Pinto. Os sportinguistas, aliás, estiveram por três ocasiões na frente do marcador, mas os benfiquistas deram sempre resposta e, por três vezes, repuseram a igualdade. E, nos últimos segundos do encontro, conseguiram mesmo dar a volta ao resultado, quando já não havia tempo para mais. Ou melhor, só havia um segundo para se jogar. A primeira reposição da igualdade chegou aos 20’, graças a Jacaré e foi só no segundo tempo que o marcador voltaria a alterar-se – na primeira parte cada equipa fez 15 remates à baliza adversária, quatro dos quais enquadrados. Na segunda parte, Merlim voltou a colocar os “leões” na frente, mas Arthur empatou uma vez mais. A seguir, foi a vez de Zicky, que até começou de início, colocar, novamente, o Sporting em vantagem no marcador (o jogador sportinguista, vai, aos poucos, recuperando a forma após lesão) só que Raúl Moreira voltou a nivelar o resultado. E foi já no último minuto da partida que o Benfica chegou pela primeira vez à vantagem, que acabou por ser decisiva, num lance em que Diego Nunes resistiu a uma falta e rematou para dentro da baliza garantindo o triunfo “encarnado”, que continua sem saber o que é perder esta época. A equipa treinada por Cassiano Klein vai assim com um golo de vantagem para a segunda mão, que se disputará no Pavilhão João Rocha, no dia 6 de Março, às 20h. A partida desta segunda-feira ocorreu depois dos episódios de violência que antecederam o embate entre os dois emblemas no final da passada semana e que levaram à detenção de 124 pessoas por parte da Polícia de Segurança Pública (PSP). Por causa disso, esta força policial reforçou o policiamento para a partida desta segunda-feira, com a PSP a acrescentar que estaria atenta a eventuais tentativas de repetição de confrontos entre adeptos, depois da rixa da semana passada. E o reforço policial resultou em pleno, não se tendo verificado quaisquer distúrbios entre elementos dos dois clubes, nem no exterior, nem no interior do pavilhão da Luz.",
    "url": "https://www.publico.pt/2026/02/23/desporto/noticia/benfica-vantagem-derby-sporting-golo-fim-2165785",
    "publication_date": "Mon, 23 Feb 2026 22:44:08 GMT",
    "date_gathered": "2026-02-24T04:13:55.687727",
    "country": "US",
    "organization": "PUBLICO"
  },
  {
    "title": "A Rússia não está a ganhar",
    "content": "Ouça este artigo 00:00 02:32 Exclusivo Gostaria de Ouvir? Assine já Custa mesmo a engolir, mas a guerra na Ucrânia, já dura há quatro anos e não mostra sinais de terminar em breve. É muito amargo para um continente que se julgava ao abrigo da guerra ter de enfrentar um conflito que se aproxima da duração da II Guerra Mundial. Mas o verdadeiro fel é para os ucranianos, que têm parte do seu país ocupado por forças estrangeiras e continuam a pagar em vidas civis e militares a sua vontade de permanecerem independentes. Os leitores são a força e a vida do jornal O contributo do PÚBLICO para a vida democrática e cívica do país reside na força da relação que estabelece com os seus leitores.Para continuar a ler este artigo assine o PÚBLICO.Ligue - nos através do 808 200 095 ou envie-nos um email para assinaturas.online@publico.pt .",
    "url": "https://www.publico.pt/2026/02/23/opiniao/editorial/russia-nao-ganhar-2165781",
    "publication_date": "Mon, 23 Feb 2026 21:30:03 GMT",
    "date_gathered": "2026-02-24T04:13:55.854607",
    "country": "US",
    "organization": "PUBLICO"
  },
  {
    "title": "Sam Altman considera “ridícula” a ideia de colocar centros de dados no espaço",
    "content": "Ouça este artigo 00:00 03:11 Exclusivo Gostaria de Ouvir? Assine já O director executivo da OpenAI, empresa responsável pelo ChatGPT, classificou na sexta-feira como “ridícula” a ideia de construir centros de dados no espaço, uma estratégia recentemente assumida por Elon Musk, seu concorrente no campo da inteligência artificial. “Sinceramente, acho que, no cenário actual, a ideia de colocar centros de dados no espaço é ridícula”, afirmou Sam Altman numa entrevista durante a Cimeira sobre o Impacto da inteligência artificial (IA) 2026, em Nova Deli, na Índia. O fundador do ChatGPT admitiu que centros de dados espaciais poderão “fazer sentido um dia”, mas sublinhou que os custos de lançamento e as dificuldades de reparação de equipamentos como chips no espaço continuam a ser obstáculos significativos. “Ainda não estamos lá. Chegará o momento. O espaço é excelente para muitas coisas. Os centros de dados orbitais não são algo que vá ter uma relevância em escala nesta década”, acrescentou. Apesar de hoje se mostrar céptico, Altman tinha admitido, numa entrevista em 2025, que colocar estas infra-estruturas na órbita terrestre poderia ser um a solução num hipotético futuro em que “grande parte do mundo acabará coberta por centros de dados”. Esse cenário, contudo, tem estado no centro dos planos de Musk. A sua empresa aerospacial, a SpaceX, está a actualizar a sua constelação de satélites, a Starlink, para a transformar numa plataforma de computação distribuída em nuvem, com o objectivo de criar uma rede de centros de dados em órbita terrestre baixa. Em Dezembro do ano passado, durante uma reunião com colaboradores da xAI, a sua empresa de IA, Musk afirmou que os centros de dados espaciais faziam parte das ambições da xAI. Este mês, noutro encontro com a equipa, destacou que a fusão da xAI com a SpaceX permitirá acelerar a concretização dessa estratégia. Musk não está sozinho nesta etapa da corrida ao espaço. Em Novembro de 2025, a Google apresentou o Project Suncatcher , destinado a criar centros de dados orbitais, onde chips especializados seriam alimentados por painéis solares. Mais recentemente, e num podcast da empresa, o CEO Sundar Pichai adiantou que o lançamento dessas infra-estruturas poderá começar já em 2027. As empresas tecnológicas e de inteligência artificial dependem dos centros de dados de grandes dimensões para suportar modelos de linguagem de grande escala (LLM). Estes centros, por sua vez, requerem quantidades consideráveis de energia e de recursos hídricos, sobrecarregando as actuais redes de abastecimento. Esse impacto, para além da poluição associada, pode afectar negativamente a qualidade de vida das populações mais próximas. De acordo com o site Gizmodo , existem actualmente mais de 5 mil centros de dados de IA nos Estados Unidos. Projectos de expansão destas infra-estruturas no Texas, no Oklahoma e noutros estados norte-americanos têm enfrentado crescente resistência por parte das comunidades locais.",
    "url": "https://www.publico.pt/2026/02/23/enter/noticia/sam-altman-considera-ridicula-ideia-colocar-centros-dados-espaco-2165742",
    "publication_date": "Mon, 23 Feb 2026 21:27:54 GMT",
    "date_gathered": "2026-02-24T04:13:56.815337",
    "country": "US",
    "organization": "PUBLICO"
  },
  {
    "title": "Ac&ccedil;&atilde;o humana tornou o calor extremo dez vezes mais comum na Europa entre 2010 e 2024",
    "content": "As alterações climáticas causadas pela actividade humana tornaram dez vezes mais comuns os episódios de calor extremo na Europa Central e do Sul entre 2010 e 2024, em comparação com o período de 1961/1990, indica um estudo divulgado nesta segunda-feira. Uma equipa liderada por Gottfried Kirchengast, do Centro Wegener para as Alterações do Clima e Globais, da Universidade de Graz, na Áustria, relatava na revista científica Weahter and Climate Extremes como desenvolveu um novo método para calcular os riscos de fenómenos climáticos e meteorológicos extremos, como ondas de calor, cheias e secas, que permitiu avaliar o impacto da actividade humano no aumento da frequência dos episódios de calor extremo. \"O aumento tanto na frequência como na duração dos eventos, bem como na magnitude dos limites ultrapassados e a sua extensão espacial\", explicam porque é que o calor extremo se tornou tão mais comum na Europa, disse Kirchengast, citado num comunicado de imprensa da instituição onde trabalha. \"Este grande crescimento vai muito para além da variabilidade natural, e mostra a influência das al terações climáticas provocadas pelo homem com uma clareza que até eu, como investigador climático, nunca tinha visto antes\", acrescentou Kirchengast. O limiar para considerar uma temperatura como extrema foi definido como a temperatura em cada local que ultrapassou os 35 graus Celsius no sul de Espanha, 30°C na Áustria e 25ºC na Finlândia. O novo método permite calcular todas as métricas de risco relevantes para fenómenos como ondas de calor, inundações e secas em qualquer região do mundo, fornecendo ainda uma base \"para quantificar melhor os impactos negativos nas pessoas, nos ecossistemas e nas infra-estruturas\", dizem os cientistas. Muitas áreas são afectadas pelos impactos e danos dos fenómenos climáticos extremos, como a saúde, construção, agricultura, silvicultura ou o sector energético. A capacidade de calcular a gravidade destes riscos é crucial, por exemplo, para as avaliações de impacto climático e as correspondentes medidas de adaptação, refere o comunicado. O novo método pode ainda ser útil para sustentar a atribuição da responsabilidade pelos crescentes danos e dos riscos climáticos \"a actores que geram grandes emissões [de gases com efeito de estufa ], como Estados ou empresas\". Esta é uma questão fundamental, por exemplo, em acções judiciais relacionadas com o clima.",
    "url": "https://www.publico.pt/2026/02/23/azul/noticia/acção-humana-tornou-calor-extremo-dez-vezes-comum-europa-2010-2024-2165750",
    "publication_date": "Mon, 23 Feb 2026 21:03:50 GMT",
    "date_gathered": "2026-02-24T04:13:57.197196",
    "country": "US",
    "organization": "PUBLICO"
  },
  {
    "title": "Suspeito de atropelar cinco pessoas em Lisboa fica em prisão preventiva",
    "content": "Ouça este artigo 00:00 01:19 Exclusivo Gostaria de Ouvir? Assine já O suspeito do atropelamento com fuga de cinco pessoas na sexta-feira à noite na zona do Chiado, em Lisboa, ficou nesta segunda-feira em prisão preventiva, disse à Lusa fonte da PSP. Segundo a fonte da Polícia de Segurança Pública, o suspeito, de 27 anos, está indiciado pelos crimes de furto de viatura, ofensas à integridade física qualificada e condução sem habilitação legal. Presente esta segunda-feira ao juiz de instrução, o suspeito ficou sujeito à medida de coação de prisão preventiva. Na sexta-feira à noite, uma viatura entrou em despiste na zona do Chiado e acabou por embater num ciclomotor, atropelando cinco pessoas, duas das quais sofreram ferimentos graves. O condutor da viatura fugiu a pé e foi interceptado às 14h40 de sábado pela Divisão de Investigação Criminal da PSP de Lisboa no Largo do Martim Moniz. O suspeito estaria a usar um carro roubado na altura do atropelamento , disse então fonte da PSP. A fonte indicou à Lusa que o suspeito foi detido com emissão de mandado de detenção fora de flagrante delito. As vítimas foram assistidas no local e levadas para o Hospital de São José e Santa Maria, em Lisboa.",
    "url": "https://www.publico.pt/2026/02/23/sociedade/noticia/suspeito-atropelar-cinco-pessoas-lisboa-fica-prisao-preventiva-2165783",
    "publication_date": "Mon, 23 Feb 2026 21:01:50 GMT",
    "date_gathered": "2026-02-24T04:13:57.732953",
    "country": "US",
    "organization": "PUBLICO"
  },
  {
    "title": "Carlo Masala: “Os europeus estão a preparar-se para um mundo pós-americano, não pós-Trump”",
    "content": "Ouça este artigo 00:00 16:00 Exclusivo Gostaria de Ouvir? Assine já Tudo começa durante uma madrugada de Março de 2028, com uma operação muito rápida de tropas russas que, em poucas horas, ocupam a cidade estónia de Narva sem encontrar quase nenhuma oposição. Não há explosões, bombardeamentos ou sequer confrontos. Não há nada de muito espectacular nesta intervenção, mas este é o cenário que Carlo Masala explora para descrever uma cadeia de acontecimentos que fazem soçobrar a ordem mundial tal como a conhecemos. Se a Rússia Vencer – Um cenário (Penguin) é apresentado esta terça-feira, exactamente quatro anos depois de a Rússia ter invadido a Ucrânia. O professor especializado em Relações Internacionais da Universidade Bundeswehr de Munique considera que este é o cenário mais realista para os próximos anos, mas também o mais perigoso para o Ocidente. Para o evitar, os países europeus terão de fortalecer a sua capacidade de dissuasão e ter a consciência de que, embora a ameaça russa se limite directamente ao Leste, os efeitos de um falhanço em confrontar um agressor serão sentidos em todo o continente. Os leitores são a força e a vida do jornal O contributo do PÚBLICO para a vida democrática e cívica do país reside na força da relação que estabelece com os seus leitores.Para continuar a ler este artigo assine o PÚBLICO.Ligue - nos através do 808 200 095 ou envie-nos um email para assinaturas.online@publico.pt .",
    "url": "https://www.publico.pt/2026/02/23/mundo/noticia/carlo-masala-europeus-prepararse-mundo-pósamericano-póstrump-2165749",
    "publication_date": "Mon, 23 Feb 2026 21:00:00 GMT",
    "date_gathered": "2026-02-24T04:13:58.015438",
    "country": "US",
    "organization": "PUBLICO"
  }
]