[
  {
    "title": "Tune out claim about Stephen Colbert's impromptu 3 a.m. broadcast",
    "content": "Claim: In February 2026, comedian and late-night TV host Stephen Colbert unexpectedly hosted at livestream at 3 a.m. to inform viewers about a threatening text message he had received from a powerful politician. Rating: False About this rating In February 2026, posts online claimed that late-night host Stephen Colbert unexpectedly started a livestream at 3 a.m. because he had received a threatening message from a powerful politician. The posts implied, but did not outright state, that the politician in question was U.S. President Donald Trump. For instance, a Facebook page named Issa shared the claim at least three times between Feb. 16 and Feb. 20: (Facebook page Issa) Other pages also shared the claim, which was often accompanied by a link to an unreliable blog in the comments. (That link redirected a website where the post's date suggested the rumor about Colbert had been spreading since at least Jan. 25, 2026). Snopes readers wrote in asking for more information about Colbert's supposed statement. We found there was no information supporting the claim that Colbert had unexpectedly started a livestream after receiving a threatening message from Trump. S earches of Bing , DuckDuckGo , Google and Yahoo found no news media outlets reporting about the rumor. If the rumor were true, a lack of reporting would be incredibly unlikely — Colbert's show (among other late-night shows ) has made headlines multiple times over the past year due to what many observers interpret as a conflict with the Trump administration. Rather, whoever authored the story fabricated the entire tale with a goal to earn advertising revenue on websites linked from the aforementioned Facebook posts and from the social media platform itself, a type of content often associated with AI-generated tools and sometimes called AI slop . An examination of the Issa Facebook page's stories, for instance, found multiple indications of artificial intelligence-generated images . For instance, one photo included with the claim featured Colbert supposedly talking into several microphones, as if at a news conference. Those microphones, however, were labeled with complete gibberish. Another sign the page was a source of AI slop was its inhuman posting volume — new posts with similar story structures went up most hours of the day with minimal breaks. Snopes contacted a manager of the Issa Facebook page to ask about the fictional stories displayed on the feed, and will update this story if we receive more information. Colbert has often been a target of AI slop. Snopes previously checked false claims that he started a dog sanctuary or that he teamed up with Jimmy Kimmel and Simon Cowell to launch a new TV channel .",
    "url": "https://www.snopes.com/fact-check/stephen-colbert-3-am-monologue/",
    "publication_date": "Tue, 24 Feb 2026 00:48:00 +0000",
    "date_gathered": "2026-02-24T04:09:53.966008",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Breaking down report British grandmother on tourist visa was detained by ICE",
    "content": "In February 2026, a claim spread online that U.S. Immigration and Customs Enforcement officers detained a British grandmother, 65-year-old Karen Newton, for six weeks despite her valid tourist visa. The details from this claim originated from a story published by The Guardian, a reputable, progressive news outlet based in the United Kingdom. The Guardian did not immediately return a request for Newton's contact information so Snopes could independently verify her story. The U.S. Department of Homeland Security confirmed in an email that federal immigration officers detained a woman named Karen Newton alongside her husband. While DHS did not verify Newton's age, length of detention or whether she had grandchildren, the agency also did not dispute those basic details as reported by The Guardian. DHS claimed Newton and her husband had a history of staying in the United States longer than their documents authorized them to, which thus warranted \"additional scrutiny and detention.\" The Guardian reported that Newton said she had \"everything\" she needed to be in the United States. In February 2026, a claim spread online that U.S. Immigration and Customs Enforcement officers detained a British grandmother named Karen Newton for six weeks despite her valid tourist visa. Posts circulating on Facebook ( screenshot ), X and Bluesky shared Newton's story as fact. Snopes readers also wrote in to ask if ICE detained a \"British tourist\" named Karen Newton for six weeks. This story originated with a Feb. 21, 2026, report ( archived ) from The Guardian, a reputable, progressive newspaper based in the United Kingdom. According to The Guardian, ICE detained Newton, a 65-year-old British tourist and grandmother, in September 2025. In an emailed statement, the Department of Homeland Security confirmed that federal immigration officers did, in fact, detain a woman named Karen Newton. ICE and DHS did not confirm Newton's nationality, age, length of detention or whether she had grandchildren, but the agency also did not dispute these basic details as published by The Guardian. The Guardian reported that Newton had a valid tourist visa. DHS said former President Joe Biden's administration issued her a tourist visa in 2023, but the agency did not explicitly address whether she was legally in the country at the time of her detention. The DHS statement said Newton and her husband both previously violated U.S. immigration law by overstaying, and that the couple's history warranted \"additional scrutiny and detention.\" The Guardian did not immediately return a request for Newton's contact information so Snopes could independently verify Newton's story. As such, we have not rated this claim. Here's what we know: The Guardian report According to The Guardian's report — published with the headline \"'Don't go to the US – not with Trump in charge': the UK tourist with a valid visa detained by ICE for six weeks\" — Newton and her husband, Bill Newton, traveled to the United States for a \"dream holiday\" that took them through California, Nevada, Wyoming, Montana and then onto Canada for \"over two months.\" A typical tourist visa in the United States grants a stay of up to six months and is valid for up to 10 years, according to immigration law firms , although the immigration official at the port of entry ultimately determines the length of stay. The details of Newton's subsequent detention as shared on social media largely aligned with The Guardian's report. For example, The Guardian reported that Newton was a British national, a grandmother, had a valid tourist visa and that ICE detained her for six weeks (emphasis ours): Karen, 65, had a British passport and a tourist visa. […] The dream holiday ended abruptly on Friday 26 September, as Karen and Bill were trying to leave the US. When they crossed the border, Canadian officials told them they didn't have the correct paperwork to bring the car with them. They were turned back to Montana on the American side – and to US border control officials. Bill's US visa had expired; Karen's had not. \"I worried then,\" she says. \"I was worried for him. I thought, well, at least I am here to support him.\" She didn't know it at the time, but it was the beginning of an ordeal that would see Karen handcuffed, shackled and sleeping on the floor of a locked cell, before being driven for 12 hours through the night to an Immigration and Customs Enforcement (ICE) detention centre. Karen was incarcerated for a total of six weeks – even though she had been travelling with a valid visa. Karen has no criminal record. She is a grandmother who spent eight years working as an admin assistant at a primary school before her retirement. \"I don't even have parking tickets in the background anywhere,\" she says. \"I am not a dangerous criminal. I didn't enter the country illegally and I had everything I needed to be there.\" According to The Guardian, Newton was held at the Northwest ICE Processing Center in Tacoma, Washington. In an email, The GEO Group, a Florida-based private company that runs the Tacoma detention center on contract with ICE, directed any questions about specific detainees to ICE. DHS response In an email, DHS sent a statement similar to one the agency shared on X . Neither the statement on X — which included a screenshot of The Guardian's headline about Newton — nor the statement sent via email disputed that Newton was a 65-year-old British grandmother who ICE detained for six weeks. Both statements also aligned with The Guardian's reporting on the events leading up to the Newtons' detentions: Canadian officials turned away the Newtons when they attempted to cross into Canada from the United States because they didn't have the right paperwork for their vehicle. U.S. officials then detained the Newtons during their inspection on reentry into the United States. However, DHS also shared additional allegations that The Guardian did not: The agency claimed Newton's husband previously overstayed an H1-B visa, a temporary worker visa that allows people to temporarily come to the United States to work in highly specialized occupations requiring a bachelor's degree or higher. DHS also said the U.S. government previously banned Newton from entering the country because she overstayed her \"visa waiver admission,\" which allows most noncitizens of certain countries to travel to the United States for tourism or business for stays of 90 days. Still, DHS' statement did not state that Newton was in the country illegally at the time of her detention. Here's the full statement shared via email: Here are the facts. William Newton broke the laws of our country and was in the country illegally for nearly 20 years overstaying an H1-B visa. Karen Newton has also violated the laws of this country, and overstayed her visa waiver admission for almost 4 years. She was banned from the US for 10 years. The Biden administration granted her a tourist visa after her ban ended in 2023 . In September of 2025 she and her husband—who has been unlawfully present in the U.S. for nearly 20 years—attempted to cross the Canadian border, they did not have proper paperwork for their vehicle and were denied entry into Canada. During her inspection re-entering the United States , she was unable to provide clear details about her situation, including her husband's legal status. Given her history of overstays, her previous ban, her husband's unlawful presence, and the vehicle documentation issues, officers determined additional scrutiny and detention were warranted under the law and she was detained. In contrast, The Guardian reported that Newton believed ICE officers may have detained her because, allegedly, \"ICE officers are paid a bonus every time they detain someone.\" According to The Guardian, she repeatedly heard this allegation from guards at the ICE facility. ICE did not immediately return an inquiry as to whether ICE agents receive money per arrest. The Guardian reported that ICE denied the allegation.",
    "url": "https://www.snopes.com/news/2026/02/23/british-grandma-detained-ice/",
    "publication_date": "Tue, 24 Feb 2026 00:37:00 +0000",
    "date_gathered": "2026-02-24T04:09:54.141630",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Did Trump call C-SPAN as 'John Barron' after SCOTUS tariff ruling? We inspected the claim",
    "content": "Following the U.S. Supreme Court striking down President Donald Trump's tariffs on Feb. 20, 2026, a C-SPAN caller who sounded like Trump and used the name \"John Barron\" — an alias the president reportedly used in the past — criticized the ruling. C-SPAN denied that the caller was Trump, saying that the call \" came from a central Virginia phone number and came while the president was in a widely covered, in-person White-House meeting.\" Trump's schedule indicated that the White House meeting had ended before the call was made and that the president had a \"private meeting\" at that time. Snopes has reached out to C-SPAN and the White House for more information. After the U.S. Supreme Court struck down sweeping tariffs President Donald Trump imposed on imports from most countries in February 2026, a rumor spread that Trump telephoned a live call-in show on C-SPAN on Feb. 20 to criticize the decision using the alias \"John Barron.\" Several social media users made the claim, including one on Bluesky who said it was \"that John Barron. The fake name Tump used for decades\" ( archived ): NO WAY \"John Barron\" just called CSPAN to complain about the Supreme Court nuking Trump's tariffs. Yes — that John Barron. The fake name Trump used for decades. They cut him off mid-call. You cannot make this up. [image or embed] — Mickey Kuhns ( @mickeykuhns.bsky.social ) February 22, 2026 at 10:23 AM The posts included a video clip of C-SPAN presenter Greta Brawner talking to a man who sounded like Trump. Identifying himself as \"John Barron,\" he referred to two congressional Democrats from New York, House Minority Leader Hakeem Jeffries and Senate Minority Leader Chuck Schumer: BRAWNER: John in Virginia, Republican, let's hear from you. CALLER: Well this is John Barron and — look, this is the worst decision you'll ever have in your life, practically. And Jack's going to agree with me, right? But this is a terrible decision. You have Hakeem Jeffries, who — he is a dope. You have Chuck Schumer, who can't cook a cheeseburger. Of course these people are happy. Of course these people are happy. But true Americans will not be happy. And you have the woman earlier, I assume she is a woman, she is a Democrat, she says she's — she is devastated by this. BRAWNER: All right, John. As we will outline below, we could not determine who the caller was, though C-SPAN denied rumors the caller was Trump. As such, we did not rate the claim. We reached out both to the White House and C-SPAN to seek more information about the president's schedule on Feb. 20, the timing of the call and the telephone number it came from. C-SPAN and 'John Barron' The clip is legitimate. It came from the show \"Washington Journal\" on C-SPAN, which aired on Feb. 20. The caller spoke to Brawner at 10:51 a.m. Eastern time, less than an hour after the first reports that the Supreme Court had struck down Trump's tariffs (at the 44:50 mark): The voice resembled Trump's, and the name the caller used, John Barron, evoked an alias Trump reportedly used in the 1980s to call reporters acting as his publicist. (He supposedly also used the name John Miller.) Faced with the claim that the caller Brawner talked to was Trump himself, C-SPAN sought to deny it with an X post saying it could not have been the president, as he was at a breakfast with governors at the time at the White House, and the number from which he called was in central Virginia ( archived ): Because so many of you are talking about Friday's C-SPAN caller who identified himself as \"John Barron,\" we want to put this to rest: it was not the president. The call came from a central Virginia phone number and came while the president was in a widely covered, in-person White-House meeting with the governors. A review of Trump's schedule showed it was true Trump was at a meeting with governors in the State Dining Room of the White House from 9:30 to 10:30 a.m. Exploring the metadata of a short livestream of Trump speaking at the governors breakfast revealed it started around 9:38 a.m. When \"John Barron\" called, the time stamp on the show was 10:51 a.m. Eastern time — after the scheduled end of the meeting with the governors. Trump's schedule indicated that at that time he was in a \"private meeting\" in the Oval Office until 12:45 p.m. (The time stamp on the C-SPAN live broadcast of Trump's public remarks about the court's decision later that day, which matched the White House's livestream , showed he started sparking at 1:20 p.m.) We reached out to the White House to ask where Trump was at 10:51 a.m., and we emailed C-SPAN to inquire about the discrepancy between their assertion Trump was till meeting with governors at the time of the call and the schedule. We also asked if there was a possibility that the number that called belonged to a mobile phone. We will update this report should either of them respond.",
    "url": "https://www.snopes.com/news/2026/02/23/trump-john-barron-cspan/",
    "publication_date": "Tue, 24 Feb 2026 00:02:00 +0000",
    "date_gathered": "2026-02-24T04:09:54.288553",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Image of Melania Trump pole dancing for Epstein isn't real. Here's the proof",
    "content": "Claim: An image authentically shows U.S. first lady Melania Trump pole dancing for disgraced financier Jeffrey Epstein. Rating: Fake About this rating In late February 2026, internet users circulated an image they claimed showed U.S. first lady Melania Trump pole dancing for convicted sex offender Jeffrey Epstein. The image spread after the U.S. Department of Justice released more than 3 million files related to Epstein in late January. The alleged photograph spread widely on Facebook , with some users claiming that it was from a section of the Epstein files that was supposed to be redacted . (Facebook user \"David Vandygriff\") The earliest example of the image we found appeared on Feb. 9 on the Instagram page of the British artist Alison Jackson , who according to her website creates \"convincingly realistic photographs, films and sculpture depicting celebrities doing things in private.\" The Instagram post with the picture had a caption reading, \"Apparently, Melania was introduced to Donald Trump by Epstein…\" as well as a disclaimer stating, \"Fictional image. No factual claims implied.\" As a result, we've rated the image fake. We messaged Jackson's Instagram page to confirm she created the image in question and will update this story if we learn more. Snopes has previously debunked other images featuring famous people created by the same artist. For a previous story about a fake image of U.S. President Donald Trump and Epstein getting their feet washed by a girl, a spokesperson for Jackson told us: \"The image was created by Alison Jackson, she uses lookalikes of the public figures and makes them look realistic, she also uses Ai – it's a bit of both.\" We searched for the image in the Epstein files made available by the DOJ and found no such photograph in the files. A reverse image search also found no credible sources sharing the purported photograph. If this image were actually in the files, major media outlets would have widely covered it. We also ran the image through Google Gemini's SynthID check, a tool that scans for embedded watermarks input through AI software. That scan found no SynthID watermark and concluded that it was not created using Google's AI, but noted \"SynthID only detects Google's specific watermark, so it cannot determine if the image was created or altered using other AI tools or software like Photoshop.\" We also analyzed the image using other AI detection tools. Hive Moderation and Zero-GPT determined it was highly likely to contain AI-generated or deepfake content. Sight Engine determined it was unlikely to be AI-generated. (Research shows AI-detection software is imperfect and readers should consider the tools' results with skepticism.) The image has several red flags that indicate it was either AI-generated or heavily edited. First, the shadow behind the woman's figure is inconsistent and does not cast the same dark shade onto Epstein seated behind her while appearing to be lit in the same way. Second, the woman's fingers appear cut off around the pole.  Third, it is unclear where the shadow on the bed between the pole and the woman's legs is coming from. Snopes has previously investigated an image claiming to show Melania Trump, Epstein's associate Ghislaine Maxwell and a few young women or teenage girls. Snopes has also analyzed the unsubstantiated claim that Melania Trump was an escort before meeting her now-husband President Donald Trump at a party thrown by Maxwell.",
    "url": "https://www.snopes.com/fact-check/melania-trump-pole-dancing-epstein/",
    "publication_date": "Mon, 23 Feb 2026 23:48:00 +0000",
    "date_gathered": "2026-02-24T04:09:54.431744",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Snopestionary: 8 tips to vet fundraisers and protect your donations",
    "content": "Amid the rise of AI slop and deepfakes, fraudsters have more tools than ever to trick a good samaritan into handing over money for an apparent good cause. Snopes has covered online scams for years: We have warned people away from illegitimate giveaways , a fake premium version of WhatsApp and phishing attempts . We have also debunked the authenticity of several viral GoFundMe pages, including a hoax page for a fake Powerball loser. However, crowdfunding scams — as well as real people asking for help — are prominent due to global crises like those in Ukraine and Gaza and it is impossible for Snopes to cover every single one. \"Fraudsters, they're opportunistic criminals,\" Mason Wilder , a research director of the Association of Certified Fraud Examiners, said in a phone call. \"They don't let a good crisis go to waste.\" We spoke with experts and put together this guide to help readers determine if they are donating money to people and charities in need or fraudsters trying to make a quick buck: 1. Do a reverse image search Fraudsters often impersonate legitimate charities or real people in desperate circumstances. One of the simplest ways to check for impersonation is by doing a reverse image search of any pictures attached to a fundraiser, particularly of people. If the photo shows up in other, older fundraisers then that is a significant red flag. \"Scammers are lazy,\" Wilder said. \"They're just going to grab photos that exist or that they see on other people's pages and try to pass it off as their own.\" Wilder recommended the reverse image search engines TinEye , Yandex and Google Images , which we also reference in our explainer on how to perform a reverse image search. 2. Check for signs of AI Generative artificial intelligence has increasingly become more realistic and difficult to spot. According to Wilder, some scammers even use live AI tools to make someone sound and look completely different. At Snopes, we frequently use AI-detection tools like ZeroGPT and Hive Moderation , but they are not foolproof. There are a few indicators you can still look for, especially in content generated by less-sophisticated AI tools. In images , check for distorted hands and facial features , inconsistent lighting , exaggerated facial expressions and illegible text . In videos, listen for monotone voices without a natural rhythm, distortions and unnatural movement . 3. Use charity rating tools, check for documentation Sometimes, organizations get created and registered as actual charities, but they \"only exist to capitalize on some recent theme or disaster,\" Wilder said. Charity rating and legitimacy tools such as Charity Navigator , GuideStar and CharityWatch can provide insight into whether an organization is transparent about how donations are used and how much money actually goes to the cause in question. Looking for an organization's news releases or reports from reputable news media outlets can also help to determine whether a charity has actually worked to benefit a cause. \"If there's no presence on the internet other than a basic webpage, that might be a bit of a red flag,\" Wilder said. 4. Validate the URL and consider the platform you're on Scammers often use fraudulent web addresses to steal sensitive information. Before clicking on a URL, try right-clicking, copying the full link and then pasting it into a tool that checks for malicious URLs. Bhupendra Acharya , a computer science professor at the University of Louisiana who researches cybercrime and fraudulent crowdfunding campaigns , recommended VirusTotal . Other detection tools include NordVPN 's and Bitdefender 's link checkers. Potential donors should also consider what platform the fundraiser uses. While smaller organizations and mutual aid groups may legitimately use crowdfunding platforms or mobile payment services like Venmo to raise money , if a fundraising campaign is supposedly for a major, established charity but is hosted on a third-party platform, that could be a clue that there is a fraudster behind the campaign, Wilder and Acharya said. Some platforms also have various protections for your money, which donors can look for before sending anything. GoFundMe, for example, has a \" giving guarantee ,\" where the company promises a full refund for up to a year if a donor believes something is not right. (A spokesperson for GoFundMe, Leigh Lehman, said in a phone call that misuse on the platform is rare and GoFundMe has a \"robust safety process\" involving verification of personal and banking information.) 5. Take a critical eye to the story you are being told Experts recommended taking the time to read the story's details, including the history of the fundraiser, whether the recipient has shared updates and how the funds are being used. \" Fraudsters are always hasty. They want to make a lot of content creation, and they may not necessarily post all the relevant information,\" Acharya said by phone. Some crowdfunding platforms, such as GoFundMe, have contact buttons for the organizer. Lehman recommended contacting the organizer for more information if there are insufficient details in the original call to action. 6. Who is sharing the story? Acharya's research found that fraudsters often make multiple social media profiles to help boost one scam campaign and to create false credibility because victims, he said, are more likely to believe a campaign is legitimate if lots of people share it. If the accounts sharing the story do not seem to follow the rules in tip No. 5, they may be bots or fake accounts. Acharya said you can also sometimes tell if a social media account is not legitimate by looking at the profile's interests. People usually have a limited number of interests and share posts from a certain perspective, he said. For example, if the account has shared posts from dozens of different sports, that may indicate that something is off. Fundraisers for individuals shared by people who you personally know — particularly those who explain their relationship to the person fundraising — are more likely to be legitimate, both Acharya and Lehman said. 7. If you can, use a credit card Wilder recommended using credit cards over debit cards because, he said, they have better fraud protections for customers than debit cards or peer-to-peer payment platforms. \" If you use Venmo, that money is gone. You're going to have to prove that it was fraud to get money back. If you use a credit card, you've got a billing cycle. They can just kind of freeze it,\" Wilder said. (Payment apps often acknowledge that risk . Venmo also provides consumers with best practices to avoid charity scams on its app.) 8. Trust your gut While these tips can help separate fact from fraud, there is no single, concrete way to determine the legitimacy of many crowdfunding campaigns. In some situations, legitimate fundraisers can also appear to be spam or scams — and skilled fraudsters often use slick designs and professional layouts to add credibility, Acharya said. Still, all of the experts Snopes spoke to emphasized that they did not want to warn people away from donating in general and that legitimate causes and communities still need support. For many people, Wilder pointed out, the risk of being scammed is worth it if they are helping others. \"People who are in destitute situations because they're from Gaza and their whole life has been destroyed, they're not necessarily going to be able to demonstrate a long history of consistent habits as they're trying to plea for any assistance while dying of starvation,\" Wilder said, in reference to expert advice on checking a person's social media page. \"In some cases, you're going to have to make a bit of a leap of faith.\"",
    "url": "https://www.snopes.com/articles/471983/fundraiser-scam-prevention-tips/",
    "publication_date": "Sun, 22 Feb 2026 00:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:54.575826",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Did Trump say Queen Elizabeth II should pardon ex-Prince Andrew?",
    "content": "Claim: In February 2026, U.S. President Donald Trump posted on Truth Social that Queen Elizabeth II, who died in 2022, should pardon former Prince Andrew. Rating: Labeled Satire About this rating Context The screenshot of Trump’s alleged post is fabricated and originated from a satirical Facebook page. In February 2026, social media users shared a rumor claiming U.S. President Donald Trump posted on Truth Social that Queen Elizabeth II, who died in 2022, should pardon the former Prince Andrew. The purported post read, \"The arrest of Prince Andrew is an unimaginable mistake. Queen Elizabeth should pardon her own son. I would pardon my own kids if they ever needed it.\" The rumor followed the Feb. 19 arrest of the ex-prince, now known as Andrew Mountbatten-Windsor, on suspicion of misconduct in public office. His arrest was related to his ties to convicted sex offender Jeffrey Epstein. The Associated Press reported police previously said they were assessing reports he sent trade information to Epstein in 2010 while serving as Britain's special envoy for international trade. King Charles III stripped Mountbatten-Windsor, who is his brother, of his royal titles and evicted him from his royal residence in November 2025. Users shared the screenshot of Trump's alleged Truth Social post on Facebook ( archived ), Instagram ( archived ), Threads ( archived ) and X ( archived ). Many commenters seemed to believe the post truly originated from Trump's account. (@actuallystevenweber/Threads) In short, the alleged post was fabricated and originated from a Facebook page whose owners described its content as satire and parody. The image also featured a watermark identifying it as satire. A search of Trump's Truth Social account showed he did not post that Elizabeth should pardon Mountbatten-Windsor. Digging into the rumor The fake Trump post screenshot included three watermarks reading \"@Mrs. Putin Satire,\" confirming it originated ( archived ) with the satirical Mrs. Putin Facebook page . (Mrs. Putin/Facebook) The Mrs. Putin Facebook page is labeled under the \"Satire/Parody\" category and features a fake profile image depicting Trump's face on Elizabeth's body. The page's bio further clarifies its intent, saying it's for \"a fictional character based on a selfish crook who inadvertently found wealth and power.\" The screenshot itself also contains several obvious satirical markers that confirm it's fabricated. The user who created the fake post displayed Trump's name and handle as \"Donald J. Turmp\" and \"@realDotardTurmp.\" The post's number of likes showed the word \"disLikes,\" as well as the date and time of \"Feb. 20, 22026\" at \"13:62 AM.\" The heart-shaped \"like\" button also displayed the word \"satire.\" In Trump's genuine response to the news of Mountbatten-Windsor's arrest, he said , in part, \"I think it's a shame. I think it's very sad. I think it's so bad for the royal family. It's very, very sad to me. It's a very sad thing. When I see that it's a very sad thing.\" For further reading, we previously reported about a rumor claiming Mountbatten-Windsor said in 2008 , \"We're not allowed to play Monopoly at home. It gets too vicious.\" For background, here is why we alert readers to rumors created by sources calling their output humorous or satirical.",
    "url": "https://www.snopes.com/fact-check/trump-andrew-queen-elizabeth/",
    "publication_date": "Mon, 23 Feb 2026 20:42:00 +0000",
    "date_gathered": "2026-02-24T04:09:54.719704",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Watch out for video claiming Ghislaine Maxwell is walking free around Quebec",
    "content": "Claim: A video authentically showed Ghislaine Maxwell walking freely around in Quebec, Canada, in early 2026. Rating: Fake About this rating In February 2026, a video ( archived ) circulated online that appeared to show Ghislaine Maxwell, the former partner of the disgraced financier Jeffrey Epstein, walking freely around Quebec, Canada. In the video, a person appeared to bump into Maxwell on the street in Quebec, asking \"Ghislaine, do I know you? You're not Ghislaine?\" After the person the video shook their head no, the recorder continued, \"I used to order hella pizza off of her, she always delivered, yeah.\" Pizza appeared to be a reference to the \"pizzagate\" conspiracy theory , which Snopes has previously reported on . One Instagram user who posted the video wrote , \"Is it Ghislaine and her brother or Ghislaine and Alan Dershowitz spotted in Canada??\" View this post on Instagram A post shared by Sweetandsaltylin (@sweetandsaltylin) The video also circulated on X ( archived ), Facebook ( archived ), Threads ( archived ), TikTok ( archived ), Bluesky and Reddit ( archived ). Snopes readers wrote in asking whether the video really showed Maxwell. If the video were authentic, meaning not edited or generated using artificial intelligence, it would be very notable given that, according to the Department of Justice , Maxwell was serving a 20-year prison sentence in early 2026 for her role in sexually exploiting and abusing minor girls with Epstein. Maxwell received her sentence in 2022 and was incarcerated in Texas at the time of this writing, according to the Bureau of Prisons. We contacted the Instagram user @clump.qc, who first posted the video ( archived ) on Feb. 19, 2026, to ask for more information about the footage. The user appeared to admit in messages to another user that the video was an AI face swap, a technology that allows users to replace a person's face in videos and photos. Close inspection of the video that claimed to show Maxwell revealed inconsistencies that suggested the person shown wasn't the British socialite. Given the Instagram user's own reported admission and visual evidence, we find the video to be fake, meaning it did not show Maxwell out and about in Quebec. Messages suggest video is fake At the time of this writing, the top comment on @clump.qc's video read, \" Just so everyone knows, this video is AI face swap. I messaged the video creator, he said so and in a very douchey way too. I can provide receipts.\" That user also posted a screen recording that claimed to show an exchange with @clump.qc. In that apparent exchange, @clump.qc reportedly said that the video was \"a faceswap bro, look at my other vids. You think I met benjamin netanyahu, mark carney, jeff epstein and ghislaine,\" appearing to suggest that the videos were fake. The user @clump.qc also reposted a screenshot of what appeared to be a direct message on their own Instagram Stories, in which a user asked them to post \"the og video of the faceswap.\" They refused, appearing to say they wanted to protect the person's privacy. (Instagram users @clump.qc and @marniethedog) Snopes contacted @clump.qc to directly confirm with them that the video was AI and we await a reply. The user previously posted similar \"chance encounter\" videos with Epstein , Israeli Prime Minister Benjamin Netanyahu and Canadian Prime Minister Mark Carney . The user hashtagged the \"Epstein\" and \"Netanyahu\" videos \"funny\" and \"prank,\" appearing to suggest they were not authentic. Maxwell's teeth give video away The user @clump.qc reportedly claimed to have used AI face swap technology to edit the video of \"Maxwell.\" That would mean the user had the interaction seen in the video with someone in real life but used AI to replace their face with Maxwell's. The video's verifiable recording location in Quebec suggested the user who posted it used a real video as their base material. Despite containing seemingly real elements, the \"Maxwell\" video also contained inconsistencies. For example, \"Maxwell's\" teeth in the video differed from authentic photos of the Maxwell. Maxwell's left top canine (second tooth to the right of the right front tooth in the photo) had a rounded point, according to a photo from the trusted picture agency Getty Images. The \"Maxwell\" in the video appeared to have a spiky, slanted left canine tooth in her top jaw. Getty Images photos of Maxwell showed that when she smiled, her right top incisor (first tooth to the left of the left front tooth in the photo) left space between the bottom of the tooth and her lower lip and did not show her lower teeth. In the video of \"Maxwell\" in Quebec, \"Maxwell's\" smile showed both her right top and bottom incisor. We've also previously investigated claims that Epstein, who an FBI investigation found committed suicide in 2019, is still alive .",
    "url": "https://www.snopes.com/fact-check/video-ghislaine-maxwell-quebec/",
    "publication_date": "Mon, 23 Feb 2026 21:23:00 +0000",
    "date_gathered": "2026-02-24T04:09:54.864483",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Did Trump poop himself during executive order signing? Rumor isn't backed up by credible evidence",
    "content": "Rumors circulated online in late January and early February 2026 that U.S. President Donald Trump ended an Oval Office news conference early after soiling himself. Users on social media networks such as X ( archived ), Bluesky ( archived ) and Facebook shared the rumor, with some claiming video of the purported incident offered evidence that the president \"s*** his pants\" and then had reporters ushered out of the room. Reporters rushed out of the room because Trump shit his pants. lol Lady in green tasted it. 🤢 pic.twitter.com/2EJc1cXe1f — Rebekah Jones (@GeoRebekah) January 30, 2026 In a video posted to YouTube by Forbes from the Jan. 29, 2026, news conference during which Trump signed an executive order aimed at addiction recovery efforts , the president appears to abruptly end the discussion and signal for reporters to be removed from the room. Photographs from the event are available to view on the credible image repository Getty Images . While the video was authentic and showed no signs of digital manipulation or content generated by artificial intelligence, there was no evidence to support the claim that Trump pooped himself during the meeting. There was no way for Snopes to independently verify the rumor, so we have left this claim unrated. By email, White House spokesman Steven Cheung said the rumor was \"not true.\" The rumor was the latest in a series of speculation about Trump's alleged bodily functions, including rumors that he soiled himself at the Kennedy Center Honors ceremony in December 2025. Such rumors are typically used by critics as a way to point out the president's age or fitness for the job. The rumor began when social media users pointed out a sound around the 34-second mark in the Forbes video, which could be perceived as a \"fart noise\" or an indication of defecation. Some users claimed that attendees at the news conference visibly reacted to the noise. For instance, Reddit users pointed out that the blond woman in green over Trump's right shoulder, identified as Kathryn Burgum, wife of Interior Secretary Doug Burgum, and Attorney General Pam Bondi appeared to react. Kathryn Burgum and Bondi both appeared to look toward Trump at the moment in question and then turn away. However, it was just as possible that the women were reacting to the words being spoken by Martin Makary, the commissioner of the Food and Drug Administration, who was addressing Trump and standing to Bondi's right. For further reading, Snopes previously investigated claims of an oil executive complaining about Trump's farts and whether former President Joe Biden pooped his pants in Rome.",
    "url": "https://www.snopes.com/news/2026/02/02/trump-poop-executive-order/",
    "publication_date": "Tue, 03 Feb 2026 00:28:00 +0000",
    "date_gathered": "2026-02-24T04:09:55.009508",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Did JetBlue flight attendant thank Trump on Presidents Day? What we know",
    "content": "In February 2026, a claim ( archived ) circulated online that a JetBlue flight attendant thanked U.S. President Donald Trump and his Cabinet for their work during a Presidents Day flight. The claim stemmed from Threads user James Weir, whose initial Feb. 16 post read : @jetblue The fact that the pilot or flight attendant chose to begin the flight by specifically thanking President Trump and his cabinet for all that they do means this will be the last time I choose your airline. View on Threads In a follow-up post , Weir clarified that a flight attendant supposedly made the announcement. Weir's initial post also circulated on Facebook ( archived ), Instagram ( archived ) and Bluesky ( archived ). Snopes readers wrote in, asking whether the claim was true. Weir wrote on Threads that the alleged announcement occurred on JetBlue Flight 2010 from Los Angeles International Airport to Palm Beach International Airport in Florida. The timestamps on his initial post about the announcement and his follow-up post after landing aligned with the known departure and arrival times ( archived ) for that flight on Presidents Day. Weir's post did not include a video or audio recording of the alleged announcement, and Snopes could not find evidence of one online . We contacted JetBlue to confirm whether a flight attendant made such an announcement on the Feb. 16 flight and await a reply. In the meantime, we leave this claim unrated. An X user named Chip Franklin also posted ( archived ) about the alleged announcement on a JetBlue flight on Feb. 17. We contacted Franklin for more details and await a reply. Details of alleged announcement Weir sent Snopes a screenshot of a boarding pass that showed his seat on Flight 2010. Speaking by phone on Feb. 18, he said the announcement occurred before the flight left Los Angeles. Weir said he did not have a recording of the moment. Weir said he could not recall the exact wording of the flight attendant's announcement, but he remembered hearing Trump's name and a mention of his Cabinet. He found that unusual, given that Presidents Day does not generally celebrate sitting presidents. He said passengers around him also took note of the mention of the Trump administration. Weir then recounted what he wrote on Threads: that he spoke to a flight attendant during the flight who said that the \"No. 1,\" or lead, flight attendant had decided to make the announcement on their own. The flight attendant Weir spoke to allegedly said later that they had spoken to the lead flight attendant and asked them not to make the same announcement on the return flight to Los Angeles. Weir said JetBlue had not contacted him following his Threads post, which had more than 600,000 views at the time of this writing. He added that he tried to file a formal complaint on Feb. 17 but was unable to reach an employee. Were you on the flight and have a recording of the announcement? Send us a tip .",
    "url": "https://www.snopes.com/news/2026/02/18/jetblue-pilot-flight-attendant-thanks-trump/",
    "publication_date": "Wed, 18 Feb 2026 19:11:00 +0000",
    "date_gathered": "2026-02-24T04:09:55.156678",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "German parade floats mocking Trump are real. Here's why the caricatures were displayed",
    "content": "Claim: Images authentically show floats mocking U.S. President Donald Trump at a German parade, including a float of a pantsless Trump and a gagged Statue of Liberty. Rating: True About this rating In February 2026, social media users ( archived ) shared images of a parade float with a caricature of U.S. President Donald Trump licking a gagged Statue of Liberty. According to a Facebook post, the float was one of three satirizing Trump in \"Düsseldorf's infamous Rose Monday carnival parade.\" Düsseldorf is a city in western Germany. Different versions of the claim circulated on various social media platforms. For example, another Facebook post ( archived ) shared an image of the same float, claiming it was from a \"German Presidents Day Festival.\" On X, one user claimed ( archived ) it was from a carnival in Mainz, Germany. A Reddit post ( archived ) included the image among other parade floats mocking Trump, claiming they were from \"Düsseldorf's Rose Monday Parade.\" Other purported parade floats depicted Trump punching Jesus and trying to devour Europe with Russian President Vladimir Putin. The images of the satirical Trump and Statue of Liberty float, as well as other floats mocking Trump, were authentic photos depicting scenes from real German parades. While the parades were held on America's Presidents Day, the German parades are annual traditions dating back to before that holiday existed. Photos of the float with Trump and the Statue of Liberty were available from Getty Images , Alamy and Reuters . All three photo agencies said the float was from a Rose Monday parade in Mainz. The city of Mainz describes Rose Monday as the highlight of carnival season, which it called its folk festival with \"fantastic days and nights of revelry.\" Carnival starts annually on Nov. 11 and ends on Ash Wednesday. Each year, the city hosts a parade on Rose Monday, the final Monday before Ash Wednesday. In 2026, Rose Monday was Feb. 16, the same date that the U.S. celebrated Presidents Day. A Mainz Carnival website , which dates these celebrations back to 1838, also confirmed the annual parade was scheduled for Feb. 16. Congress didn't create Presidents Day, celebrated on the third Monday of February, until 1968 . The Mainz Carnival Museum says that the floats which satirize current events and politics are an \"important part of the parade.\" The photo of the float with Trump and the Statue of Liberty was often shared alongside the photos of floats depicting Trump punching Jesus and trying to devour Europe with Putin. Getty Images placed the other two floats as being from Düsseldorf. Düsseldorf, Mainz and Cologne, another German city, are the \" three strongholds of the Rhineland Carnival ,\" according to a nonprofit group that seeks to preserve and share Düsseldorf's carnival traditions. Düsseldorf, like Mainz, celebrates Rose Monday with a parade that includes floats satirizing current events and politics.",
    "url": "https://www.snopes.com/fact-check/germany-parade-floats-trump/",
    "publication_date": "Thu, 19 Feb 2026 00:33:00 +0000",
    "date_gathered": "2026-02-24T04:09:55.321994",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Trump said US is only country that allows mail-in ballots. Here's the truth",
    "content": "Claim: As of February 2026, the United States is the only country in the world that allows mail-in ballots, as U.S. President Donald Trump claimed. Rating: False About this rating While defending the so-called SAVE America Act in February 2026, U.S. President Donald Trump repeatedly claimed the United States is the only country in the world that allows mail-in voting. Should it become law, the SAVE America Act will require voters to show proof of their citizenship upon registration. Critics have argued it would infringe upon states' ability to administer elections as they choose and that it would restrict eligible voters from casting their ballots, in part by gutting registration by mail. The American Civil Liberties Union called the legislation \"a dangerous assault on democracy.\" Trump said the SAVE America Act is necessary to prevent \"crooked elections\" (he and his supporters blamed his loss in the 2020 presidential election on voter fraud, a claim Snopes has repeatedly debunked .) The bill passed the House of Representatives on Feb. 11, 2026. It had not passed the Senate as of this writing, despite appearing to on Congress.gov, an online database of legislative information. (Sen. Rick Scott, R-Fla., initially introduced the bill in the Senate, though it addressed accessibility of Veterans Affairs for disabled veterans. The Senate voted on it, then the House rewrote it as the SAVE America Act and passed it — lawmakers sometimes use this loophole to get around procedural obstacles, such as deadlines. Both houses must pass the same version of the bill for it to become law.) On Feb. 12, Trump incorrectly told reporters the SAVE America Act would ban mail-in ballots, with a few exceptions ( the bill would not ban mail-in ballots; it would ban voter registration by mail by requiring voters to register in person ). He added that the U.S. is the only country in the world \"that has mail-in ballots\" (the full exchange begins at the 29:10 mark of the video below). The full exchange was as follows (emphasis ours): REPORTER: On the SAVE Act, Mr. President, voter ID polls very well nationally. Even the majority of Democrat voters want it. TRUMP: Right. REPORTER: So, why do you think Senate Democrats are resisting the SAVE Act? And what is your strategy and realistic pathway to getting the SAVE Act passed to ensure free and fair elections for the next generation? TRUMP: It's such a great question. I appreciate it actually because it's called the SAVE America Act. We've changed the name. It's the SAVE America Act and the Democrats are against it. I heard one of them say, \"we will stop the SAVE America Act.\" No, we're trying to save America and it has to do with largely voting and basically it's got three very simple points. It's got voter ID, photo ID, but voter ID with a photo, right? It's got the confirmation of U.S. citizenship. You have to be a citizen. So, you have a vote, you have an ID. That's about a 99% one and I think 90% with Democrats. Then you have confirmation U.S. citizenship. That's about a 99% one with Republicans, about 86% with Democrats — except Democrat politicians because they cheat on elections. And then you have no mail-in ballots, and it would be no mail-in ballots. Very important. You know, we're the only country in the world that does a system like we do. We're the only country in the world that has mail-in ballots. The way we do this is unbelievable. It guarantees cheating. So, it's no mail-in ballots, with the exception of disability, illness, military or, if you're traveling, you can get an exemption. You know, if you happen to be out of the country for a good reason, you can have an exemption. So, with exceptions, it's no mail-in ballots, and that will assure the security of our crooked elections. In short, Trump's claim that the U.S. is the only country to allow mail-in ballots was false. As of this writing, a number of countries allow mail-in voting in some capacity. As outlined below, some countries allow in-country postal voting for all the electorate, while others make in-country postal voting possible for some voters. In August 2025, International IDEA — an intergovernmental organization dedicated to assisting governments in democratic and electoral reform — published a report saying 31 countries, in addition to the U.S., allow some form of in-country postal voting. Out of those, 11 nations, including Canada , Germany , Switzerland and the United Kingdom , allow all voters to choose mail-in voting. The same report said 21 countries allow in-country postal voting based on certain criteria. These include Australia , France , Ireland , Japan and Spain . For example, France makes in-country postal voting possible for some people in detention , while Japan, Ireland and Australia allow it for those with disabilities. Given its large size, Australia also allows this option for people who live more than eight kilometers (roughly 5 miles) from a polling place. Contrary to Trump's claim, the U.S. is not unique in allowing mail-in voting. Further, the SAVE America Act would not ban it in the United States. For further reading, Snopes previously examined a meme listing countries that supposedly banned mail-in voting .",
    "url": "https://www.snopes.com/fact-check/trump-mail-in-voting/",
    "publication_date": "Mon, 23 Feb 2026 16:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:55.477404",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Ditch images showing abandoned KFC bucket-shaped restaurant",
    "content": "Claim: Images shared online in February 2026 authentically showed a bucket-shaped KFC restaurant in Dayton, Ohio, that was closed and abandoned years ago. Rating: Fake About this rating In February 2026, a post to Facebook ( archived ) shared several images of an abandoned KFC restaurant designed in the shape and appearance of one of its signature chicken buckets . The images' caption merely read, \"An abandoned bucket-shaped fast food restaurant. Would you visit it?\" The same Facebook page also posted a video ( archived ) allegedly exploring the restaurant with clips shot from the same places the images were taken. According to the description of the video, the \"abandoned bucket-shaped restaurant outside Dayton, Ohio, closed in 2021\" and was \"never cleaned out.\" Other Facebook pages ( archived ) and X accounts ( archived ) that shared the images also claimed the restaurant was in Dayton and closed in 2021. In short, the images and video of the bucket KFC were generated with artificial intelligence tools and the story about the restaurant was fictional. Therefore, we have rated the claim as fake. Google leaves invisible watermarks in images and videos generated with its AI tools. These watermarks can be detected by Google's SynthID AI tool . When Snopes checked one of the images in the post with the tool, the check found that \"most or all of this image was edited or generated with Google AI.\" The original post's edit history revealed the post once had a disclaimer about the images' AI origins. They were posted on Feb. 13, 2026, with the description, \"An abandoned bucket-shaped fast food restaurant hidden outside Dayton, Ohio. Closed in 2021 after financial collapse, the entire building was left untouched — from the dining area to the basement storage rooms. A forgotten piece of fast-food history frozen in time.\" Later that day the page edited the post to remove the em dash and add a disclaimer that said, \"This is an AI-generated fictional abandoned location and a fictional story.\" Snopes archived this version of the post. The same disclaimer also appeared at the end of the video's description. However, the page removed the detailed description and the AI disclaimer from the images in favor of the \"would you visit it?\" description about an hour later. The page ( archived ), appeared to post mostly AI-generated content consisting of fictional abandoned places. Many of these images had the same AI disclaimers that were removed from the KFC bucket restaurant post, including those attached to a post depicting another abandoned KFC ( archived ) and to a video of a Kmart ( archived ) that the page similarly claimed was closed in 2021 for financial reasons and left untouched since. The images of the bucket KFC themselves included several major clues confirming they were AI-generated. For example, two images included a poster to the left of the counter that was filled with gibberish, which has long been a common type of mistake made by AI when generating content. In the image of the hidden storage basement , the lights were on, suggesting the building still had power even though the location was supposed to have been abandoned for five years. Many of the boxes in the image lacked dust or cobwebs even though cobwebs remained on the ceiling and the boxes had five years to build up dust. Finally, the windows as they appeared from inside the restaurant didn't match the size and shape of the same windows as seen from outside , though they should have been identical.",
    "url": "https://www.snopes.com/fact-check/bucket-shaped-kfc-restaurant/",
    "publication_date": "Mon, 23 Feb 2026 14:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:55.622308",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Did Melania and Barron Trump open 'Hope Medical Center' for homeless?",
    "content": "Claim: U.S. first lady Melania Trump and her son, Barron Trump, opened a free hospital for homeless people in early 2026. Rating: False About this rating A claim ( archived ) that U.S. first lady Melania Trump and her son, Barron Trump, opened a free hospital for homeless people circulated online in mid-February 2026. One such claim on Facebook began , \"MELANIA & BARRON TRUMP JUST OPENED AMERICA'S FIRST 100% FREE HOMELESS HOSPITAL – 'THIS IS THE LEGACY WE WANT TO LEAVE BEHIND.'\" The claim circulated mainly on Facebook ( archived , archived , archived ). T he Facebook posts featured links in top comments leading to articles in advertisement-filled blogs — not reputable news media outlets. The webpage mentioned above went live on Feb. 16, 2026. However, searches of Bing , DuckDuckGo , Google and Yahoo for the alleged \"Hope Medical Center\" and the Trump name a day later found no credible news media outlets reporting on the pair opening a hospital ( archived , archived , archived , archived ), as the ad-filled story claimed. Prominent news media outlets would have widely reported this rumor, if it were true. Rather, whoever authored the story fabricated the entire report as one of hundreds of inspirational tales that depicted celebrities, athletes and public figures performing inspiring acts of kindness. They aimed to earn advertising revenue on websites linked from the aforementioned Facebook posts. As we lay out below, the story about Melania and Barron Trump's alleged free hospital amounted to fiction. Snopes previously reported on this claim when it circulated online around Feb. 2, 2026. It was unclear who first posted the later claim about the Trumps' alleged hospital. One Facebook page that posted the story toward the end of February also posted it earlier that month. Story used AI images and text Regarding the image of Melania and Barron Trump that Facebook posts shared, Hive Moderation and Sightengine , two online AI detectors, found a higher-than-60% probability they were \"likely\" AI-generated. (Such AI detectors are fallible and, therefore, cannot be relied upon alone.) The purported Melania Trump also looked different from authentic pictures of the first lady from mid-February 2026. (Sightengine/Hive Moderation/Snopes illustration) The image that the Facebook page above used in its  post also appeared in similar forms on three other Facebook pages . It showed the Trumps in identical poses but wearing different clothes. It was highly unlikely that the pair would have posed in an identical manner so many times in different outfits. ZeroGPT , an online AI detector for text, found that AI was \"100%\" likely to have written parts of an ad-filled story that one Facebook page linked to. For further reading, Snopes frequently checks online claims about both Melania and Barron Trump.",
    "url": "https://www.snopes.com/fact-check/melania-barron-trump-homeless-hospital/",
    "publication_date": "Sun, 22 Feb 2026 19:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:55.782205",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Photo shows Bill Clinton typing out email in 1998. But was it his first?",
    "content": "In the 1980s and '90s, people across the world started sending and receiving their very first emails. This included former U.S. President Bill Clinton. According to one claim ( archived ) circulating online, a photo showed the 42nd U.S. President sending the first ever presidential email in 1993. The X account that shared the photo wrote, \"President Clinton composing the first presidential email, 1993.\" The photo and claim also circulated on Facebook ( archived ) and Reddit ( archived ). The photo was authentic, meaning not generated by artificial intelligence. According to the reputable photo agency Getty Images , the photo actually showed Clinton writing an email to astronaut John Glenn aboard the space shuttle Discovery in November 1998 — five years after the date online posts said. The Clinton Presidential Library held another photo that showed Clinton writing to Glenn that it also said was from November 1998. Given the above, it appeared the photos circulating online were from 1998, not 1993. However, as we lay out below, it remains unclear whether they showed Clinton's first presidential email. Therefore, we leave this claim unrated. The 1998 message According to official sources and Clinton himself, the former president did send his first email in 1998. Clinton posted ( archived ) on X (then Twitter) in 2014 that the 1998 photo showed him writing his \" first (ever!) email\" to Glenn. Three years earlier, in 2011, Clinton reportedly said during a talk at the Ford Foundation in New York that the email to Glenn was one of two he sent while president — the other being a message to U.S. troops in the Adriatic. The Clinton Presidential Library ( archived ) and Clinton Presidential Center ( archived ) also both said on social media that Clinton's first email was the message to Glenn in 1998. According to the Clinton White House's website , Clinton had a public email address since 1993 and was the first president to have one. We contacted the Clinton Presidential Library and Presidential Center to ask why Clinton appeared to have had an email address that he allegedly never used for five years and await a reply. WH tech director said Clinton first emailed himself A transcript of an interview with Dr. John Gibbons, Clinton's d irector of the White House Office of Science and Technology Policy, cast doubt on claims that Clinton wrote his first email to Glenn in November 1998. Gibbons served in the White House from Clinton's inauguration in 1993 to April 1998 — six months before the picture of Clinton writing to Glen was taken. According to that interview transcript, Gibbons presided over Clinton's first email, which was to himself. Gibbons reportedly said: We wanted to introduce the President to email and the Net. So we brought him over to the old EOB, and he sat down in front of this computer—it may have been the first time he sat down in front of a computer—and showed him how email worked and gave him his email address over across the street in the Oval Office. So he typed in his first email message. It was something like, Bill Clinton, it's time to come home for lunch. Signed, Hillary, something like that. I saved a copy of it. That was his first email. Gibbons did not say in the interview when Clinton sent this alleged email but given Gibbons' time in the White House, Clinton would have written the reported email before November 1998. Gibbons died in 2015. His daughter told Snopes via email that the family donated most of her father's documents to the National Archives. That collection did not contain the alleged email, and Snopes could not independently verify its existence. Of all (or both) the emails Clinton sent, the one depicted in the 1998 photo is perhaps the most famous. The Toshiba brand computer that Clinton used, which still had copies of Glenn's message and Clinton's reply on its hard drive, sold at auction in 2014 for $61,931. Bill Clinton is not the only Clinton to face doubts about how he managed his emails. Snopes has previously reported on Clinton's wife, Hillary Clinton, and the FBI's two investigations into her email practices while secretary of state.",
    "url": "https://www.snopes.com/articles/472425/clinton-first-email-photo/",
    "publication_date": "Mon, 23 Feb 2026 12:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:55.925011",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Did Trump make over 4K wire transfers to Epstein totaling $1B? Claim doesn't add up",
    "content": "Claim: U.S. President Donald Trump made 4,725 wire transfers to the late, disgraced financier and convicted sex offender Jeffrey Epstein for a total of $1.1 billion. Rating: False About this rating Context The rumor stemmed from a misunderstanding. U.S. Sen. Ron Wyden, a Democrat from Oregon, said that his investigators had found 4,725 transactions to and from one of Epstein's accounts for a total of $1.1 billion, with no mention of Trump. After the U.S. Department of Justice published millions of files related to late sex offender Jeffrey Epstein in late January 2026, a rumor resurfaced online that President Donald Trump had made 4,725 wire transfers to Epstein for a total of $1.1 billion. For example, on Feb. 9, a Facebook user claimed ( archived ) the alleged story was new: Just released files are showing trump made over 4,725 wire transfers to epstein totalling over 1.1 billion dollars. If you can't make the connection between that many money transfers from a convicted rapist to a convicted pedophile running the largest child trafficking ring in history. Your a special kind of stupid. Contrary to the Facebook user's caption, the claim had circulated online since July 2025, as an X post showed ( archived ). The rumor stemmed from findings by the office of U.S. Sen. Ron Wyden, a Democrat from Oregon who featured in the X post's video. However, while the posts accurately relayed the number of transactions and the amount they totaled, they incorrectly attributed them all to Trump. For this reason, we have deemed the claim false. On July 17, 2025, Wyden spoke in a Senate session about files related to Epstein that his team had found at the U.S. Department of Treasury. His speech streamed live on C-SPAN (at the 2 hour and 47 minute mark): Wyden said his investigative team had found the following details in the Treasury files in 2024 when then President Joe Biden gave them permission to do so: Somewhere in the Treasury Department, Mr. President [Trump], locked away in a cabinet drawer is a big Epstein file that's full of actionable information, follow-the-money details about his financing and operations that await investigation. Last year, the Biden administration allowed our investigators to look at portions of the file. We did that at the Treasury Building. Here is what it says. Treasury's Epstein file details, Mr. President, 4,725 wire transfers. Let me repeat that: 4,725 wire transfers adding up to nearly $1.1 billion, flowing in and out of just one of Mr. Epstein's bank accounts. If you ask me, that is more than 4000 potential lines of investigation right there. Hundreds of millions more flowed through other accounts. That's even a lot more to investigate. The file shows that Mr. Epstein used multiple Russian banks, which are now under sanctions, to process payments related to sex trafficking. A lot of the women and girls he targeted came from Russia, Belarus, Turkey and elsewhere. One shudders to think about the kinds of people who must have been involved in trafficking these women and young girls out of those companies and into the Epstein web of abuse. Again, these are all potential leads, Mr. President, the Department of Justice ought to be digging into. This is about years and years of international sex trafficking. However, at no point in his speech did Wyden say or suggest Trump was one of the people on the other end of the transactions, let alone all of them. Instead, he urged the administration to investigate the transactions, which he called \"potential leads.\" Prior to speaking in the Senate, Wyden had spoken to The New York Times and told the publication that his team had been carrying out an inquiry on \"Epstein's financial network for the past three years,\" revealing that Wyden's efforts were not new and that his team had access to bank records, which are confidential, according to federal law. Wyden cannot release the records himself, which is why he was urging the Trump administration to do so in his Senate address. A member of Wyden's investigative team on the Senate Finance Committee , of which the senator is the ranking member, as of this writing, told Snopes that the investigation started with the goal of creating legislation to prevent tax evasion. Investigators in Congress are not allowed to start inquiries without a legislative goal. The aide confirmed the New York Times' reporting that the team was looking, specifically, into money exchanges between Epstein and Leon Black, the cofounder of Apollo Global Management, Inc., a private equity behemoth with $938 billion under management as of Dec. 31, 2025. Black paid Epstein \"$170 million for tax planning advice that was not worth nearly that amount,\" according to the aide. Black's net worth was $13.3 billion as of this writing, according to Forbes. His wealth, the aide said, would have given him \"access to the best tax lawyers and accountants in the world, and he could have paid them a fraction of that price for the same advice.\" \"It's all just enormously suspect,\" the aide added. He said that several times since Trump took office, the team asked the new presidential administration to release these documents to the Finance Committee so they can continue to investigate, to no avail. Asked if these documents had already been investigated, the aide said, \"We do know that none of the tax work Epstein did for Leon Black was audited by the Internal Revenue Service.\" The aide further explained that federal law compels banks to conduct checks on customers' accounts. \"What the law says is that when [banks] think something fishy is going on, they're supposed to file these documents with the Treasury Department,\" the aide said. \"It's supposed to provide a lead for law enforcement. To our knowledge, there has been no investigation here.\" The aide added that these documents had been filed after Epstein was arrested and, in some cases, after Epstein died, when it would have been too late to stop criminal activity on Epstein's part.",
    "url": "https://www.snopes.com/fact-check/trump-money-transfers-epstein/",
    "publication_date": "Mon, 23 Feb 2026 11:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:56.080315",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Did dog illegally vote in California election? Sniffing out the truth",
    "content": "Claim: A dog was registered to vote by its owner, who submitted a ballot in the pet’s name in California's 2021 gubernatorial recall election. Rating: True About this rating Rumors that a dog in California was successfully registered to vote and cast a ballot in an election circulated online in mid-February 2026. The claim was popularized on the social media platform X after a post ( archived ) asserting the rumor was shared by X chairman Elon Musk ( archived ). Some users pointed to the story as an example of alleged rampant voter fraud in the United States electoral system. I wonder who he voted for? 🤣 https://t.co/3LwkkAmARW — sunny madra (@sundeep) February 17, 2026 The claim that a dog voted in a California election was true. A boxer named Maya, owned by 62-year-old Laura Lee Yourex of Costa Mesa, California, was registered to vote and successfully cast a ballot in 2021. The Orange County district attorney's office announced it would be prosecuting Yourex on voter fraud charges in a news release dated Sept. 5, 2025. According to the release, Yourex was charged with five felonies: one count of perjury, one count of procuring or offering a false or forged document to be filed, two counts of casting a ballot when not entitled to vote and one count of registering a nonexistent person to vote. The dog had votes cast in California's 2021 gubernatorial recall election and the 2022 gubernatorial election, but only the 2021 vote was counted. It joined the majority of California voters rejecting the attempt to recall Democratic Gov. Gavin Newsom. The 2022 vote was \"challenged and rejected,\" according to the district attorney's office. An investigation reportedly uncovered a social media post from January 2022 in which Yourex posted a photo of the dog wearing an \"I voted\" sticker and another from October 2024 that showed a vote-by-mail ballot with the dog's name and a caption that said \"Maya is still getting her ballot\" despite the dog having died. Snopes was unable to locate any social accounts for Yourex as of this writing. A search of Orange County court records showed that the case remained active as of this writing, with a hearing scheduled for early March 2026. According to local TV news station KABC , Yourex's lawyers emphasized that their client had never been in trouble with the law previously and read from a statement in which she said she \"regrets her unwise attempt to expose flaws in our state voting system, intending to improve it by demonstrating that even a dog can be registered to vote.\" Snopes reached out to the Orange County district attorney's office for an update on the proceedings and will update this article if we receive a response. U.S. Rep. Kevin Kiley, R-Calif, made reference to Yourex and Maya during remarks about California's Proposition 50 during a session of the House of Representatives on Sept. 19, 2025. The proposition, which was an effort to redraw congressional district lines to favor Democrats and counteract similar efforts in Texas and elsewhere, passed with 64% of the vote. Kiley brought up Yourex's case as an example of voter fraud allegedly running rampant in California, beginning at the 3:08:33 timestamp of a C-SPAN video capturing the entire session. He accurately summarized the situation and speculated that Yourex \"probably\" would have gotten away with it had she not posted about it on social media. \"To be clear, dogs are not allowed to vote in California. And yet in this case, the animal did,\" Kiley said. \"So the question we have to ask, Mr. Speaker, is how in the world do we have so few safeguards on our electoral process in California that such a thing could ever happen?\" Kiley later posted the clip of his remarks about Yourex on his Facebook page .",
    "url": "https://www.snopes.com/fact-check/dog-voted-california-election/",
    "publication_date": "Mon, 23 Feb 2026 03:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:56.243436",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Does video show 'humanoid' robot in London? We inspected",
    "content": "In February 2026, a video ( archived ) circulated online purportedly showing a \"humanoid robot\" in London. The clip, recorded in the Hoxton area of East London, showed the \"robot\" interacting with young people whom appeared to be students, answering questions about its name and creator. One person who shared the footage on X wrote , \"Meanwhile, in London.. an AI humanoid was seen walking the streets and was surrounding by intrigued school kids. Spooky.\" (X user @KieraDiss) The video of the alleged robot also circulated on YouTube and TikTok . Though the context of the footage was unclear as of this writing, it did not appear to show a \"humanoid robot,\" meaning a robot modeled after the human body. Rather, it appeared to show a woman in a costume, given that at around the 00:28 mark of the version circulating on X, the woman briefly broke character and laughed. The \"robot\" in the video appeared to be a version of \"Joy\" — an invention that AI company Joyous AI described as \" The World's First Indistinguishable from Human, Humanoid Robot.\" Joyous' Instagram profile posted several videos of their \"robot\" appearing across London. Snopes contacted Callum Scott , who described himself as Joyous' chief robotics officer on LinkedIn, for more information about \"Joy.\" When reached by phone, Scott deflected a question about whether \"Joy\" was actually a human and referred us to the company's spokesperson, who had not commented by the provided deadline. We also contacted the TikTok user Eduard Constantin , who recorded three videos of \"Joy,\" to ask for his assessment of the \"humanoid robot.\" We will update this article if he responds. One of Constantin's videos showed \"Joy\" making more human-like movements (at around the 0:27 mark), such as rubbing her hands together. Due to a lack of reliable confirmation about what the footage showed, we have left this claim unrated. At the time of this writing, Joyous was advertising an event , titled \"Joy In The Flesh\" on Feb. 27, 2026, in London. It appeared the company would unveil \"Joy\" at this event. It was unclear why the company decided to do a walkabout with \"Joy\" in Hoxton in February 2026. The videos circulating online showed the \"robot\" in Purcell Street and Pitfield Street . In 2023, passersby also spotted \"humanoid robots\" at London Bridge train station ( archived ), also in the U.K. capital. These \"robots\" were humans in costume carrying out a promotion for the sci-fi movie \"The Creator.\" In early February 2026, the tech publication \"rest of the world\" reported that 90% of the world's humanoid robots are produced in China. The industry in the country is highly developed, with companies even putting on all-robot soccer matches . Have more information on the origin of this video? Send us a tip .",
    "url": "https://www.snopes.com/news/2026/02/23/video-robot-london/",
    "publication_date": "Mon, 23 Feb 2026 00:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:56.407488",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Beware alleged Epstein and Courtney Love photo",
    "content": "Claim: An image posted online in early February 2026 shows sex offender Jeffrey Epstein posing with singer Courtney Love. Rating: Originated as Satire About this rating In February 2026, social media users circulated a photograph they claimed showed convicted sex offender Jeffrey Epstein posing with singer Courtney Love. One X post ( archived ) included a caption reading \"I think I figured out what really happened to Kurt Cobain.  I mean come on, do you trust Courtney Love?\" (X user @MrViper) The image also spread on Facebook and in Italian - and French -language X posts. In comments, many users appeared to believe it was real. However, the image was not an authentic photo and originated from a satirical social media account. The account that first shared the image included a bio emphasizing that its content was not real, reading \"• It's all fake • Laugh about it • No Dms • Check the highlights • GFL.\" In the comments, the original poster also pointed users back to that bio. We also ran the image through Google Gemini's SynthID check, a tool that scans for embedded watermarks by artificial intelligence software. That scan detected a SynthID watermark and concluded \"All or part of this image was created or edited using Google's AI tools.\" (Google Gemini) Below is a genuine Getty Images photograph showing Love in an outfit similar to the one depicted in the fake photo — showing how the manipulated image appears to have been based on real footage: (Getty Images) All in all, the photograph purportedly showing Epstein with Love does not document a real meeting or relationship. It was digitally fabricated and originated on a satirical account, and there is no verified evidence that it represents an actual moment in either person's life. For background, here is why we alert readers to rumors created by sources calling their output humorous or satirical.",
    "url": "https://www.snopes.com/fact-check/epstein-courtney-love-photo/",
    "publication_date": "Sun, 22 Feb 2026 14:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:56.575088",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "Was Florida man arrested after baptizing alligator in Waffle House? Don't bite",
    "content": "Claim: A man was arrested in Florida after he attempted to “baptize” an alligator inside a Waffle House. Rating: Originated as Satire About this rating Rumors that a man in the state of Florida was arrested after trying to \"baptize\" an alligator in a Waffle House restaurant circulated online in mid-February 2026. Users on social media platforms like Facebook ( archived ), Threads ( archived ) and Instagram ( archived ) were eager to share the outrageous claim, spreading a purported mugshot of the man in question and an alleged post from Florida news outlet WFOR that said he attempted to use a \"pitcher of iced tea\" to perform the ritual. (The Dude Humor Report on Instagram) There was no evidence that the claim was true or that the mugshot included in the social media posts was authentic. Instead, the rumor originated as a satirical post from an account that identified itself as \"comedy.\" A search of Google , Bing , DuckDuckGo and Yahoo returned no results for credible news outlets reporting on such a story. A Google reverse image search of the purported social media post from WFOR's account returned only other social media accounts posting the same alleged screenshot, all from mid-February. (Google) WFOR is a broadcast channel in Miami, Florida, officially branded as CBS Miami . The social media accounts for the station are labeled as \"CBS Miami\" and not \"WFOR4NEWS\" as of this writing. A search of CBS Miami's social accounts for a post matching the screenshot shared in the claim returned no relevant results. A search of newspaper archive Newspapers.com and the CBS Miami website also returned no results for such a story. The image appeared to originate from a Facebook account that shared a multitude of alleged stories accompanied by fake imagery similar to the one shown in the claim. The account posted ( archived ) the claim about a Florida man baptizing an alligator on Feb. 12, 2026. However, the same account posted similar claims around the same time as the post in question, all allegedly from the same purported WFOR4NEWS account. Other purported headlines included a Florida woman arrested for starting a brush fire after \"using a flamethrower to clear a spider web from her porch\" and a man attempting to trade an alligator for beer at a store. Like the \"baptizing\" claim, these posts included alleged mugshots, but there was no evidence the reports or images were authentic. The mugshots appeared to be created using generative artificial intelligence, although Snopes has been unable to independently verify that. All of the above mentioned posts from the Facebook account in question were labeled with the hashtags \"comedy,\" \"satire\" and \"for entertainment only,\" indicating they were intended as a joke. Further, the page from which these posts originated featured a disclaimer that read, \"This page features satire and parody stories that are exaggerated, developing fictional — created for entertainment purposes only.\" For background, here is why we alert readers to rumors created by sources calling their output humorous or satirical.",
    "url": "https://www.snopes.com/fact-check/florida-man-alligator-waffle-house/",
    "publication_date": "Sun, 22 Feb 2026 03:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:56.725446",
    "country": "US",
    "organization": "Snopes"
  },
  {
    "title": "8 fake images of Epstein with prominent figures we've debunked after latest files release",
    "content": "After the U.S. Department of Justice released millions of new files related to deceased sex offender Jeffrey Epstein on Jan. 30, 2026, we investigated and debunked numerous images that social media users claimed were part of the newly disclosed materials. Numerous fabricated images spread online in the days following the release, many of them appearing to show Epstein with prominent political figures in the United States and abroad . In several cases, social media posts alleged the visuals were pulled directly from the Justice Department's files. We found no evidence that any of the fabricated images we reviewed were included in the Jan. 30 document release. Some of the images originated as satire and were later reshared without their original context. Others were AI-generated or digitally altered. Several fabricated images that circulated in previous years also resurfaced amid renewed public attention on Epstein's case. The fake images often circulated alongside broader allegations tying various politicians to Epstein's crimes. Epstein died by suicide in 2019 while awaiting trial on federal sex trafficking charges. Over the years, numerous public figures have acknowledged meeting or socializing with him, while often denying any knowledge of or involvement in his criminal conduct. Below are eight Epstein-related images Snopes fact-checked after the Jan. 30 file release: Don't fall for alleged image of Epstein dining with Chuck Schumer Feb. 16, 2026 The image was created using Google AI tools. Read More Beware alleged photo of Hakeem Jeffries with Epstein Feb. 13, 2026 The image originated from a social media account that describes itself as \"an AI-powered meme en ... Read More Don't be fooled by alleged image of Trump and Epstein getting feet washed by girl Feb. 10, 2026 The image originated from an artist who creates realistic but, ultimately, fake images depicting ... Read More Does this image show Epstein with Island Boys hip-hop duo? Don't be fooled Feb. 4, 2026 The image allegedly showed convicted sex offender Jeffrey Epstein posing for a photo on a beach  ... Read More Don't fall for this image of Epstein with Nigel Farage Feb. 3, 2026 The image circulated following the U.S. Department of Justice's release of over 3 million files  ... Read More Beware image showing Mamdani and his mom with Epstein, Clinton, Gates, Bezos Feb. 3, 2026 Although Mamdani's mother attended an afterparty at Ghislaine Maxwell's house for a film she dir ... Read More Watch out for alleged video of Trump, Epstein with young girls at party Feb. 15, 2026 In February 2026, social media users resurfaced an AI-generated video that animated an authentic ... Read More Don't fall for this photo of Trump, Epstein, young female and children Feb. 2, 2026 The photo spread online as the Department of Justice said it released more than 3 million files  ... Read More",
    "url": "https://www.snopes.com/collections/fake-epstein-images/",
    "publication_date": "Sat, 21 Feb 2026 19:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:56.884589",
    "country": "US",
    "organization": "Snopes"
  }
]