[
  {
    "title": "150 Days",
    "content": "Nick Catoggio / February 23, 2026 150 Days An election-year tariff crisis for Republican candidates? The Capitol is seen a day before the State of the Union address in Washington, D.C. on February 23, 2026. (Photo by Brendan SMIALOWSKI / AFP via Getty Images) The Capitol is seen a day before the State of the Union address in Washington, D.C. on February 23, 2026. (Photo by Brendan SMIALOWSKI / AFP via Getty Images) Audio Audio Turn any article into a podcast. Upgrade now to start listening. Text Size Premium Members can share articles with friends & family to bypass the paywall. Facebook Twitter LinkedIn Threads Email 0 Open and scroll to the comments section You’re reading Boiling Frogs , Nick Catoggio’s daily newsletter on politics. To unlock the full version, become a Dispatch member today . We’re hitting the road and heading to Dallas, Texas, for Dispatch Energy: The Current State , a symposium focused on the future of energy innovation. You can catch Kevin D. Williamson , Jonah Goldberg, Steve Hayes, and more of your favorite Dispatch authors as we bring our Dispatch Energy newsletter to life. Tickets are available here —but hurry, they’re almost sold out. I’ve gotten used to cowardice from congressional Republicans, but I’ll never get used to horses—t like this . After the Supreme Court’s ruling on Friday, GOP sources assured Axios that the legislature would have acted to limit the president’s tariff authority soon if the court had not. “A ‘messy’ full-scale revolt on the issue was just around the corner,” those sources claimed. According to one senior House Republican, “Patience was running thin, and in some respects the Supreme Court decision makes a messy breakup unnecessary.\" We’ve been waiting 11 years , through a coup attempt and four criminal indictments, for a “full-scale revolt” against Donald Trump by right-wing invertebrates in Washington that has never come. If Axios ’ source really did believe that revolt was “just around the corner,” one would think, he wouldn’t have insisted on being quoted anonymously. The only thing more pathetic than licking the president’s boots is licking them while swearing that you’ve almost—almost, but not quite—gotten sick of the taste. So long as craven House and Senate Republicans have a say in the matter, there will be no revolt. The tongue-shining will continue. What’s interesting about the president’s latest move on tariffs is that, under the law, they might no longer have a say. Hours after the court nuked his authority under the International Emergency Economic Powers Act of 1977 (IEEPA), Trump issued an executive order imposing a 10 percent global tariff under Section 122 of the Trade Act of 1974. (He raised it to 15 percent a day later, just because.) He preferred to use IEEPA as his cudgel on trade because it came with no strings attached—no restrictions on how high the tariffs could go, no requirements that he explain himself to Congress and, importantly, no time limits on how long the tariffs might remain in effect. Section 122 does come with strings. In particular, any tariffs imposed by the president under its authority expire automatically after 150 days … unless Congress votes to extend them. That means the deadline for Trump’s new tariff authority will detonate like a grenade in the House and Senate in late July, with the midterm campaign in full swing. Interestingly, most state primaries will be over by then , theoretically freeing nearly all congressional Republicans to oppose the tariffs without fear of losing their party’s endorsement this cycle. Nothing will stop them from doing so—except, I suppose, the prospect of the president throwing a gigantic tantrum and urging right-wing voters not to turn out in the general election for “disloyal” Republicans. Which he’s perfectly capable of doing. Side with the tariff-hating American majority or with the tariff-loving vindictive Peronist autocrat: That’s the intriguing dilemma that House and Senate Republicans will face this summer, 100 or so days out from a national election. How likely is it that the “full-scale revolt” we’re forever being promised might arrive at last in July? Not very, I think. But a full-scale revolt won’t be needed to kill these tariffs dead. You are receiving the free, truncated version of Boiling Frogs . To read Nick’s full newsletter—and unlock all of our stories, podcasts, community benefits, and our newest feature, Dispatch Voiced , which allows you to listen to our written stories in your own podcast feed— join The Dispatch as a paying member . Stories We Think You’ll Like The Supreme Court Spurns a Presidential Power Grab Ilya Somin / February 23, 2026 But the court sidestepped the president’s claims to sweeping emergency powers. The Court Has Acted on Tariffs. Now Congress Must Act, Too. Kevin D. Williamson / February 23, 2026 The judicial branch has shown the legislative branch it can slow Donald Trump’s power grabs. Trump, Tariffs, and the Dangers of an Unbound Presidency Matthew Mitchell / February 22, 2026 The president already found a workaround to impose new tariffs. Will Congress reclaim its power? Let someone else handle it. The average Republican coward’s approach to restraining Trump has been clear and consistent for a decade. Five simple words: Let. Someone. Else. Handle. It. That meant forcing House Democrats to impeach the president after January 6 with almost no Republican support. It meant leaving it to the criminal justice system to stop him from returning to office instead of Senate Republicans disqualifying him at his second impeachment trial. And it meant crossing one’s fingers and making a wish that the Supreme Court would blow up his IEEPA tariffs in lieu of Congress doing it. “Let someone else handle it” will also be the way congressional Republicans approach Trump’s new tariffs. And someone else—namely, the courts—almost certainly will do so. That’s because the Section 122 tariffs are illegal. By its own terms, as National Review ’s Andrew McCarthy explains, the statute empowers the president to act when there are “large and serious United States balance-of-payments deficits.” The White House seems to believe “balance-of-payments deficit” is a fancy term for “trade deficit,” but it isn’t: They’re two different things . There’s a yuuuuuge trade deficit right now thanks partly to Trump’s trade war but no balance-of-payments deficit whatsoever . Absurdly, his own Justice Department is on record as agreeing. In defending the president’s IEEPA authority, the DOJ argued that he couldn’t use Section 122 instead because there’s no national emergency involving a balance-of-payments deficit, only one (supposedly) caused by a trade deficit. Now, I suppose, they’re going to have to argue the opposite. It won’t work. The courts are going to block these tariffs—and for many congressional Republicans, that will provide a convenient excuse to support extending them as the 150-day deadline approaches. Why risk your neck with Trump and MAGA by voting to kill the Section 122 levies if the judiciary is likely to do it for you, sparing you from swing voters’ wrath in November? Let someone else handle it. In fact, House and Senate Republicans might use the ongoing litigation as a justification to try to extend them. If Congress hasn’t acted by late July, an appeals court weighing Trump’s Section 122 authority might declare the matter moot and dismiss the case, reasoning that the tariffs have now lapsed. “We need to extend these tariffs simply to keep the case alive and give the judiciary a chance to decide the ‘balance-of-payments’ issue,” the GOP might claim, not very convincingly. Caesar and the Senate. The president will inevitably try to spare them from having to make that argument, though. As we approach the 150-day deadline, my guess is that he’ll try to extend the deadline unilaterally via executive order instead of following the statute by asking Congress to do it. There’ll be no “full-scale revolt” among Republicans because they’ll be too busy pretending that Trump can reset the deadline on his own authority. In this iteration of “let someone else handle it,” the president himself is “someone.” He did something similar, remember, when he repeatedly extended the deadline for TikTok’s sale despite the fact that nothing in the statute allowed it. Extending the Section 122 deadline unilaterally would be even more absurd, as the whole point of the 150-day time limit is to bar the president from setting trade policy indefinitely without congressional approval. But he’s going to try it—not primarily because he’s worried that Congress won’t pass an extension, I suspect, but because he resents in principle the idea that he should have to ask the legislature for permission to do anything. We live in a world in which Trump’s party controls the House, the Senate, and the Supreme Court and yet he still grasps for excuses not to seek authorization from other branches. It’s not because he can’t win a vote in Congress, it’s because the thought of having to do so offends his Caesarist prerogatives on trade. Although, for the record, he almost certainly can’t win a vote in Congress on Section 122. That’s the third reason there’ll be no “full-scale revolt” against the new tariffs among Republican lawmakers. There’s no need. The margins in the House and Senate are now so narrow that even a tiny revolt within the GOP will suffice to block legislation that would extend the 150-day deadline—and that tiny revolt is already underway, as we’ve seen in other recent tariff votes. In the Senate, four Republicans have already voted more than once to block other Trump tariffs . Susan Collins, Lisa Murkowski, and Mitch McConnell owe the president nothing, and Rand Paul is a libertarian ideologue who’s unlikely to buckle on trade. Those four votes together with all 47 Democrats in the chamber would be enough to prevent a Section 122 extension. Meanwhile in the House, six Republicans joined Democrats earlier this month in voting to end the fake “national emergency” that Trump cited to justify slapping tariffs on Canada. With one exception, those members are either retiring (Don Bacon, Dan Newhouse), answer to major Democratic constituencies back home (Brian Fitzpatrick, Kevin Kiley), or have gone full maverick (Thomas Massie). There’s no reason to think any of those five would flip on a gut-check Section 122 vote. (The sixth, Jeff Hurd of Colorado, has already been savaged by the president as a RINO who should be primaried, so flipping on the new tariffs wouldn’t do him much good either.) With all House Democrats joining them, that should guarantee that legislation to extend the new tariffs will fail. What incentive is there, then, for a “full-scale revolt” among the rest of the GOP caucus? If Massie et al. are willing to do the dirty work of killing the bill, then there’s no downside to the average House Republican in casting a futile vote to pass it. Doing so will earn them the gratitude of Trump and MAGA, and the bill’s failure should spare them the wrath of swing voters satisfied by the outcome. Win-win. Let someone else handle it! Lame duck. Is there any scenario in which we really might see a broad revolt among congressional Republicans against extending the 150-day deadline? The only one I can think of is if the bottom fell out of the president’s job approval before July, making him an especially lame duck, which is unlikely but not unthinkable . In particular, if the cause of his slide were economic—a new surge in inflation, for instance—tariffs would become a harder sell to the American public than they already are. And they’re a pretty hard sell already. For once, the House and Senate GOP would have an electoral reason not to let someone else handle it. On Friday, YouGov published a snap poll about the Supreme Court’s tariff decision. Americans supported it to the tune of 60-23 while independents split 63-16. Even more notable were the results when respondents were asked what effect they thought Trump’s tariffs have had on costs. Forty-one percent of those surveyed believe prices have increased “a lot” and another 25 percent think they’ve increased “slightly” because of his policies. Among independents, those numbers were 44 and 24 percent, respectively. Among Republicans, 13 and 31 percent. In the midst of a major cost-of-living crisis, in other words, a heavy majority of the public and a near-majority of his own party believes the president’s trade policy is partly responsible for their pain. When I said last year that tariffs were the biggest political mistake he’s made in his second term, that’s why. By deliberately making life less affordable, he’s taken ownership of an economy with which most Americans are dissatisfied; if that economy takes a dive this summer, congressional Republicans will be desperate for ways to offload blame for it. That’s when a vote on the Section 122 tariffs would get interesting. The mere fact that the 150-day deadline guarantees five more months (at least) of tariffs as a scalding hot political potato also threatens the GOP, as it might cause midterm-minded voters to start asking uncomfortable questions about the policy. For instance, why did Trump impose 10 percent global tariffs after Friday’s court ruling and then immediately jack them up to 15 percent the next day? What was the careful deliberative logic behind that decision? It must be the first time in U.S. history that Americans were hit with a major tax hike because the president is mad at the Supreme Court . Another question: Didn’t he just negotiate a bunch of trade deals with foreign powers , some of whom promised to invest heavily in the United States? Are those deals affected by the new 15 percent rate? What happens to a country that signed a deal with a tariff rate higher than 15 percent? Did the White House give a moment’s thought to any of that in its rush to spite the court by replacing the IEEPA tariffs as quickly as possible? A show about nothing. Here’s a particularly good one, per Vox ’s Benjy Sarlin : Won’t these new Section 122 tariffs obviously fail to achieve the president’s goals on trade? His goals on trade, I thought, were to reshore jobs and investment in the United States by forcing trade partners who’d been “taking advantage of us” to come to the table. The IEEPA tariffs made sense in that context. Because they were unlimited in scope and duration, they were well-suited for a long-term protectionist project to rebuild American industry. Trump could, in theory, have gone on using them to try to bring manufacturing back to the United States for the duration of his presidency. But Section 122 is limited. As I’ve explained, the new tariffs will be kaput in court eventually and kaput in 150 days regardless since there’s virtually no chance they’ll be extended by Congress. They’ll expire before the president can use them to achieve any long-term protectionist goals. And given the immense legal and legislative uncertainty around them ( a Trump specialty! ), foreign nations now have no incentive to negotiate new trade deals with him. They’re better off sitting tight until July and waiting for the tariffs to expire. Protectionism by executive fiat is dead thanks to the Supreme Court, and rightly so. So why, voters might wonder, are we still doing tariffs? If Trump is unwilling or unable to get Congress to agree to take the baton on repatriating jobs by taxing imports lawfully, why continue to subject Americans to the ludicrous volatility of imposing disruptive here-today-gone-tomorrow levies? Many will struggle to understand it—but not us. You and I know why: The president yearns to govern as a king , and arrogating all power over trade was one of his most kingly pretenses. Economist Noah Smith correctly identified why the IEEPA tariffs mattered so much to him: It allowed him to conduct foreign policy entirely on his own. It allowed him to enrich himself and his family. It allowed him to gain influence domestically, by holding out the promise of tariff exemptions for businesses that toe his political line. And it allowed him to act as a sort of haphazard economic central planner, using tariffs like a scalpel to discourage the kinds of trade and production that he didn’t personally like. In other words, I think that although the tariffs had their origin in 1990s-era worries about trade deficits, they ended up as a way to make the Presidency more like a dictatorship. Trump relishes the pardon power for similar instrumentalist reasons, because it grants him leverage over would-be courtiers. It’s a royal shield for those willing to do His Majesty a favor. His tariff authority was far greater, though, a royal sword he could and did hold to the throats of everyone from heads of state to captains of industry to ensure their cooperation with whatever new demand he had made of them. To a megalomaniac, it must have felt like a bona fide superpower. Now it’s gone, and there’s no such thing as a superpower that lasts for only 150 days. The clearer it becomes to voters that Trump’s ongoing interest in tariffs has more to do with protecting his personal influence than with protecting the American economy, the heavier that liability will become for him and his party. If you’re still holding out hope for that long-awaited “full-scale revolt” among House Republicans, that’s your best shot. Nick Catoggio Nick Catoggio is a staff writer at The Dispatch and is based in Texas. Prior to joining the company in 2022, he spent 16 years gradually alienating a populist readership at Hot Air. When Nick isn’t busy writing a daily newsletter on politics, he’s … probably planning the next day’s newsletter. Newsletter selected Click sign up to start receiving your newsletters. Sign up Submitting...",
    "url": "https://thedispatch.com/newsletter/boilingfrogs/trump-tariffs-republicans-congress-revolt/",
    "publication_date": "Mon, 23 Feb 2026 22:53:15 +0000",
    "date_gathered": "2026-02-24T04:09:46.084425",
    "country": "US",
    "organization": "The Dispatch"
  },
  {
    "title": "The Court Has Acted on Tariffs. Now Congress Must Act, Too.",
    "content": "Wanderland The Court Has Acted on Tariffs. Now Congress Must Act, Too. The judicial branch has shown the legislative branch it can slow Donald Trump’s power grabs. Kevin D. Williamson / February 23, 2026 Illustration by Noah Hickey/The Dispatch (Photos via Getty Images and Unsplash). Illustration by Noah Hickey/The Dispatch (Photos via Getty Images and Unsplash). Audio Audio Turn any article into a podcast. Upgrade now to start listening. Text Size Premium Members can share articles with friends & family to bypass the paywall. Facebook Twitter LinkedIn Threads Email 0 Open and scroll to the comments section You’re reading Wanderland , Kevin D. Williamson’s weekly newsletter on politics, policy, and culture. To unlock the full version, become a Dispatch member today . We’re hitting the road and heading to Dallas, Texas, for Dispatch Energy: The Current State , a symposium focused on the future of energy innovation. You can catch Kevin D. Williamson , Jonah Goldberg, Steve Hayes, and more of your favorite Dispatch authors as we bring our Dispatch Energy newsletter to life. Tickets are available here —but hurry, they’re almost sold out. Anyone is free to disagree with Justice Clarence Thomas’s legal opinions—but only a fool fails to take his views seriously. I am always a little nervous when I find myself on the opposite side of a legal question from Justice Thomas, but Chief Justice John Roberts does Thomas the courtesy of a very thoughtful response to his dissent in the recent tariffs case, a response that contains what I think we might consider a “Kinsley gaffe,” i.e., stating a truth that is more than one meant to say. The chief justice writes: Suppose for argument’s sake that Congress can delegate its tariff powers to the President as completely as Justice Thomas suggests. Even then, the question remains whether Congress has given the President the tariff authority he claims in this case—or whether the President is seeking to exploit questionable statutory language to aggrandize his own power. Chief Justice Roberts is a very careful writer, and his words here, while couched in the form of a question, are plainer than I am accustomed to reading from him or from any other member of the court: “the President is seeking to exploit questionable statutory language to aggrandize his own power.” One need not be an esoteric Straussian to assume that the word whether should be omitted to access the sentence’s true meaning. Of course “the President is seeking to exploit questionable statutory language to aggrandize his own power.” He also seeks to exploit imaginary statutory language to aggrandize his own power, and seeks to exploit phony emergencies to aggrandize his own power, to exploit imaginary Venezuelan fentanyl to aggrandize his own power, to exploit imaginary Haitian cat-eaters in Ohio to aggrandize his own power, to exploit an absolutely ignorant misunderstanding of trade deficits to aggrandize his own power, etc. The president of these United States is not an aspiring autocrat but an actual autocrat acting outside of the constitutional powers of his office in matters ranging from imposing illegal taxes on Americans to carrying out massacres of civilians in the Caribbean. Speaking with his trademark stroke victim’s diction, Trump insisted: I am allowed to cut off any and all trade or business with that same country. In other words, I can destroy the trade. I can destroy the country! I’m even allowed to impose a foreign country-destroying embargo. I can embargo. I can do anything I want, but I can’t charge $1. Because that’s not what it says, and that’s the way it even reads. I can do anything I wanted to do to them but can’t charge any money. So I’m allowed to destroy the country, but it can’t be a little fee. We have there what would have been another Kinsley gaffe coming from the mouth of anyone else—the president’s attachment to the erroneous and unconstitutional idea that “I can do anything I want”—but, given that Trump has been talking about himself as a god-emperor for as long as he has been in politics, the statement surely is not unintentional. You are receiving the free, truncated version of Wanderland . To read Kevin’s full newsletter—and unlock all of our stories, podcasts, community benefits, and our newest feature, Dispatch Voiced , which allows you to listen to our written stories in your own podcast feed— join The Dispatch as a paying member . Stories We Think You’ll Like How the Navy Prepared to Fight the Japanese Empire Thomas Sheppard / February 20, 2026 The U.S. military viewed a Pacific war as a possibility years before Pearl Harbor and gamed out how to wage it. Trump’s $18 Trillion Fantasy Scott Lincicome / February 19, 2026 The president’s math on foreign investment doesn’t add up. Trump Attempts a Tightrope Walk on Selling AI Chips to China Without Boosting Its Military Jonathan Gibson / February 19, 2026 The president’s plan may be an attempt to thread an ‘impossible needle.’ “The President is seeking to exploit questionable statutory language to aggrandize his own power,” writes the chief justice—out of context, yes, but that is where the truth is. And the Supreme Court now has acted, in its modest way. Trump, being Trump, has announced that he will set about subverting this ruling by any means he can find “to exploit questionable statutory language to aggrandize his own power.” Back to the traumatic brain injury ward: More is a symbol of economic national security. And also, I would say, just for our country itself, so important because we’re doing so well as a country. We’ve never done so well. The good news is that there are methods, practices, statutes and authorities, as recognized by the entire court in this terrible decision, and also as recognized by Congress, which they refer to, that are even stronger than the IEEPA tariffs available to me as President of the United States. Attention to Mike Johnson, the gutless worm who serves as speaker of the House—that is the sound of history calling your name. The Supreme Court has done what the Supreme Court can do, but now it is time for Congress to get in the game—long past time, in fact. The best time for Congress to rediscover its self-respect (as opposed to its self-importance) would have been 40 years ago—the second-best time is now . Never mind the fantasy of a Republican Congress impeaching and removing Donald Trump from the presidency, a prophylactic measure that should have been taken at the very latest after the attempted coup d’état that crowned his first administration but which was not, thanks in part to the catastrophic miscalculation of the risk-averse Mitch McConnell, then the Republican leader in the Senate. Congressional Republicans, having grown accustomed to (and perhaps even fond of) the taste of cordwainer’s leather, will not be weaned from their boot-licking ways so quickly. What could be done instead—what should be done but almost certainly will not be done—is to remove all of the president’s current statutory authorities touching trade in such a way as to invite his taking the opportunity “to exploit questionable statutory language to aggrandize his own power.” And while it is the case that as a political reality Donald Trump cannot be impeached, is it so impossible to think that Commerce Secretary Howard Lutnick or Kevin Hassett, the president’s top economic adviser, could? If not by gutless Republicans today, then by a new Democratic majority come January? Can you imagine how much fun it would be to have a halfway competent economic inquisitor (I know, I know: Democrats ) putting one of those guys through some tough questions (including ethical questions about Lutnick’s self-dealing) in front of the cameras for a couple of weeks? Hassett, who does not believe a word of the bullshit that comes out of his mouth but really likes to ride on Air Force One, would, from the Democratic point of view, make an excellent face for the Republican Party in its current intellectually vacant, shifty, self-serving, amateur-hour incarnation. The Trump administration’s tariff policy is—and I cannot write was , inasmuch as they are going to try to ignore the Supreme Court ruling—bad on three counts. Least important is the fiscal calculation: The tariffs will bring in some money, but the extra revenue is had at the expense of decreased economic efficiency and increased economic chaos. There are easier ways to raise a couple hundred billion dollars a year. Slightly more important, in the long run, is the ideological content: Protectionism is a dumb and backward economic policy that may serve the short- to middle-term interests of a small number of market incumbents but which does not serve the overall economy very well. The relatively dynamic and risk-exposed U.S. economy has lifted Americans’ standard of living relative to the rest of the world, while the relatively statist, risk-averse, protectionist economic policies of the rich nations of Europe have produced relatively low growth, to such an extent that U.S. GDP per capita is now half-again as much as Germany’s and twice the average of the European Union. Japan’s GDP per capita is lower than that of West Virginia or Mississippi, our two poorest states. Trump’s notion that the rest of the world has been getting over on the United States through crafty trade policy is utterly unsupported by the facts—it is pure flat-earther economics. The fact that ignorant protectionism is on the upswing in both parties—Joe Biden’s trade policies were substantially similar to what Trump pursued in his first administration—is a catastrophe for American economic thinking. Most important—and most often overlooked—is the procedural issue: It is really, really important that presidents not be permitted to do things beyond the constitutional power of their offices. The president of the United States already has made war on Venezuela and Iran, threatened to make war on NATO, and reshaped the tax environment for American businesses (tariffs are taxes on American businesses) with no congressional authorization, only by “seeking to exploit questionable statutory language to aggrandize his own power.” Contrary to the popular assumption, overpowered executives unmoored from procedural and constitutional restraints do not produce order by consolidating power—they produce chaos by making one man’s whimsy the law of the land. Recall that Trump—by his own account—raised tariffs on Switzerland because his feelings were hurt in a conversation with the Swiss prime minister, a person who (and I, for one, think this part still matters) does not actually exist . (There is no prime minister of Switzerland.) We have separation of powers to prevent precisely this sort of thing by requiring that big, important changes to public policy—or big, important actions such as arresting people— require the cooperation of at least two of our three branches of government . As a paragon of management excellence once said to an underling: “ A nutless monkey could do your job .” If the other job candidate is Mike Johnson, I’d hire the nutless monkey. But perhaps there is someone in Congress—and I do not much care which party that someone belongs to—who is willing to stand up and do his goddamned job . Chief Justice John Roberts has done his. Your turn. And Furthermore ... I’ll admit being a little irritated with my friends at National Review when I read this editorial about Virginia and gerrymandering. In 2024, Donald Trump carried 90 of Virginia’s 133 counties and independent cities. Even in Spanberger’s blowout victory over Winsome Earle-Sears in the 2025 gubernatorial race, Earle-Sears won 83 of them. West of the Brunswick County line, covering some two-thirds of the state’s land mass, Spanberger carried only four counties. She also lost most of the upper Chesapeake area in the state’s east. That’s true. But do you know which countries Winsome Earle-Sears won? The ones without any people in them, which is why she got only 42 percent of the vote. As a native of West Texas, I can assure you that counting counties does not tell you very much about the people of a state: When I was at the Lubbock Avalanche-Journal , our sports department covered something like 40 counties that had a total of maybe 500,000 people in them, which, according to my English-major math, means an average county population of not very damned many . Republicans—beginning with Texas Republicans—need to get their heads around the fact that they are really good at winning counties that don’t have very many people in them and really, really bad at winning counties that have a lot of people in them. The fact that the Texas GOP is going to win both Hartley County (population 5,382) and Armstrong County (population 1,848) does not somehow undermine the fact that the Democrats are going to win Harris County (population 5,221,006) and Dallas County (population 2,656,028). Whoever the Republicans end up nominating for the Senate race this time around (Ken Paxton is a corrupt imbecile, so you have to assume he has the inside track) is going to have to stitch together a lot of little counties to overcome the fact that the Democrat is going to win every city larger than Fort Worth—and may win Fort Worth, too. Texas’ four largest cities have about 6 million people in them altogether, and Democrats are very likely going to win very large majorities of those city voters as well as majorities of the larger urban counties around them. I mean, hurray for Deaf Smith and Jim Hogg counties and all, but that isn’t where the people are. County-counting is a silly way of arguing about voting, and about gerrymandering. Words About Words A reader sends this in from Axios : After small businesses sued to block Trump’s tariffs last year, a quick ruling was expected. The delay underscores the enormity of a decision that, either way, could rattle the global economy. An old bugaboo: It is true that Donald Trump thinks the Supreme Court decision was an enormity, but I myself disagree. An enormity is not a big thing, it is an evil thing, a crime : the enormities of Jack the Ripper, the enormities of Trump’s interior decorator, the enormity of needless poverty, etc. A better word there would be importance or gravity . Elsewhere You can buy my most recent book, Big White Ghetto , here . You can buy my other books here . Please subscribe to The Dispatch if you haven’t . You can check out “How the World Works,” a series of interviews on work I’m doing for the Competitive Enterprise Institute, here . In Closing Charles Murray has suggested that a millennium hence what will be remembered of the 20 th century is World War II and the moon landing. Looking a little less distantly into the future, I think that it is entirely possible that outside of a few serious scholars, what most educated people 200 years from now will know about the United States in the 20 th century will consist of: the two world wars and the Cold War, which will be remembered as essentially one complicated, century-spanning conflict; the emergence of the internet as a mass medium; and the moon landing already referenced. If any matters of domestic politics throughout the whole of American history still register, they will be the American founding itself, possibly the New Deal, and—almost certainly, I think—the civil rights movement. What the American founding, the New Deal, and the civil rights movement have in common is that each changed the fundamental assumptions about the nature of the relationship between state and citizen in ways that were significant not only for the United States but for all the world. Liberal democracy in the form of constitutionally limited government incorporating a concept of inalienable rights began in Philadelphia and became a global norm among advanced countries; the New Deal was not the first model of the modern welfare state—Otto von Bismarck had a program, and Jonah Goldberg has done very interesting work on the New Deal’s authoritarian cousins—but it was the model that proved most compatible with the principles of liberal democracy exported from the United States, having been so successful that 21 st century Europeans can talk about a “Green New Deal” without anybody having to explain the reference to Spaniards or Belgians; the civil rights movement began with the question of a single racial minority group in a single country but established both the principles of dignity and fundamental equality for minority groups of many kinds (ethnic, religious, sexual, etc.) and provided an influential working model for a political program to put those principles into action. I myself am not an admirer of the New Deal, but, setting aside the question of personal preferences, these are historically consequential ways in which the domestic political development of the United States shaped not only our own republic but the world. These are what will ensure that the United States will not—at least for a long time—end up with the epitaph T.S. Eliot imagined for his adopted Great Britain: And the wind shall say: “Here were decent Godless people: Their only monument the asphalt road And a thousand lost golf balls.” Some readers were a little surprised that I argued that history will judge the late Rev. Jesse Jackson kindly in spite of his grifting, his philandering, and his troublesome record of antisemitism. The Rev. Jackson’s sins were common, the sort of thing that happens every day, but the civil rights movement was not the sort of thing that happens every day, and the Rev. Jackson’s historical significance proceeds from his association with that series of events. The fact that Mohandas K. Gandhi was a health crank and a little bit of a sexual weirdo has not much diminished his reputation save among certain historical specialists; Thomas Jefferson’s contemptible hypocrisy on the matter of slavery is consequential not because contemptible hypocrisy per se is interesting, which it isn’t (it is as common as fleas) but because of how it colors our understanding of the universalist principles he championed; the Rev. Jackson’s girl-chasing and featherbedding are lamentable, but also banal and ordinary, and probably will have very little effect on his historical standing—less even than the Rev. Martin Luther King Jr.’s adultery has had on his. Admirers of Donald Trump who profess to be shocked and offended by the Rev. Jackson’s significant moral shortcomings are, of course, beneath contempt, but we may take some comfort in the fact that none of these ignoramuses will have very much influence on how history is written. “Is it your reputation that’s bothering you?” Marcus Aurelius asked himself. “Think of how soon we all will be utterly forgotten. The abyss of endless time swallows all. Consider the emptiness of those applauding hands and remember that the people who praise us are capricious and arbitrary.” It is worth thinking a little more about the fact that so many of the main figures of the civil rights movement were religious leaders, Christian and Jewish. The Rev. Jackson may have seemed to have forgotten his vocation from time to time, but, at his best, he made clear the biblical context of his times and his project. Recalling the death of King, Jackson cited Genesis and the story of Joseph, whose brothers said: “Behold, this dreamer cometh. Come now therefore, and let us slay him, and cast him into some pit, and we will say some evil beast hath devoured him. And we shall see what will become of his dreams.” Launching from there into a sermon in which he argued that King’s famous line about “the content of their character” was being used in a way that let the world off too easily, the Rev. Jackson insisted that justice only comes with the sacrifice of blood—Schwerner, Goodman, Chaney—two Jews, a black, and Viola Liuzzo. And churches bombed and dogs biting flesh and the horses kicking people. Through the rush and the blood of it all, and the lives lost, and sacrificed, martyrs, we wrote the Voting Rights Act in blood. It was co-signed. And Mr. Johnson said, “We will lose the South for 25 years, but we must say now ‘We Shall Overcome’ together.” Dr. King would still be around here preaching if he had just dreamed abstract, non-threatening, conservative, privatized dreams. He changed the law. ... It was always a call to action, a challenge, a threat to the status quo, to Pharaoh, to Nebuchadnezzar, to George Wallace, to Bull Connor—challenging some present, powerful, oppressive force. One might criticize the Rev. Jackson for being too much the politician and too little the man of the cloth, for thinking and speaking—and preaching—almost exclusively about the affairs of this world, and not infrequently in a way that served his own ambitions. But there is a place for charity here (forgive us our trespasses, etc.) as well as for reality—and the reality of Jackson’s life was in many times and places extraordinarily brutal and ugly: My father got off the train in Washington coming home from the Second World War, but, going south to Virginia, he had to sit behind Nazi prisoners of war because of skin color. My high school class could not take its picture on the lawn of the state capitol. Dogs could. Jesse Jackson famously got a “D” in preaching when he was in seminary, and he himself observed that there was little if any difference between his sermons and his political speeches. If his ministry was not always directed at otherworldly heights, perhaps it was because he was thinking of that state capitol and what the men who worked there could do to him and had done to him. The world weighed on him. It was not theology that cost John the Baptist his life but political criticism—there are precedents for a ministry such as Jackson’s. \"After all these years, what remains for me, is God is a source of mystery and wonder,” Jackson said toward the end of his life. “Scripture holds up. The righteous are not forsaken.” The Rev. Jackson now has gone to face a judgment beyond the judgment of history—in the one court in which we are all truly equal, because we are all equally condemned save for that borrowed righteousness in which Christians place their hope. “I will have mercy and not sacrifice, for I am not come to call the righteous but sinners to repentance.” Let us hope that Scripture does indeed hold up, such that it is not only the righteous who are not forsaken but also the ordinary hapless fallen sinners chained to transgressions that are not even grand but petty and venal and embarrassing—meaning you and me and the late Rev. Jesse Jackson. Kevin D. Williamson Kevin D. Williamson is national correspondent at The Dispatch and is based in Virginia. Prior to joining the company in 2022, he spent 15 years as a writer and editor at National Review, worked as the theater critic at the New Criterion, and had a long career in local newspapers. He is also a writer in residence at the Competitive Enterprise Institute. When Kevin is not reporting on the world outside Washington for his Wanderland newsletter, you can find him at the rifle range or reading a book about literally almost anything other than politics. Newsletter selected Click sign up to start receiving your newsletters. Sign up Submitting...",
    "url": "https://thedispatch.com/newsletter/wanderland/trump-supreme-court-tariffs-kinsley-gaffe/",
    "publication_date": "Mon, 23 Feb 2026 14:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:46.859758",
    "country": "US",
    "organization": "The Dispatch"
  },
  {
    "title": "Trump Loses Tariff Case",
    "content": "The Morning Dispatch Trump Loses Tariff Case Plus: Cartel leader El Mencho killed with help from U.S. intelligence, ISIS suspects escape prison in Syria, and Justice Neil Gorsuch provides a civics lesson. James P. Sutton , Peter Gattuso , & Ross Anderson / February 23, 2026 Audio Audio Turn any article into a podcast. Upgrade now to start listening. Text Size Premium Members can share articles with friends & family to bypass the paywall. Facebook Twitter LinkedIn Threads Email 0 Open and scroll to the comments section You’re reading The Morning Dispatch , our flagship daily newsletter explaining all the news you need to know today in fewer than 15 minutes. To unlock the full version, become a Dispatch member today . We’re hitting the road and heading to Dallas, Texas, for Dispatch Energy: The Current State , a symposium focused on the future of energy innovation. You can catch Kevin D. Williamson , Jonah Goldberg, Steve Hayes, and more of your favorite Dispatch authors as we bring our Dispatch Energy newsletter to life. Tickets are available here —but hurry, they’re almost sold out. Happy Monday! Scientists in Zhejiang, China, have used the genome-editing tool CRISPR/Cas9 to create ordinary-looking tomatoes that smell like buttered popcorn. Finally! Quick Hits: Today’s Top Stories Supreme Court Strikes Down Trump’s Tariffs In a 6-3 decision on Friday, the Supreme Court ruled that President Donald Trump could not impose tariffs under the 1977 International Emergency Economic Powers Act (IEEPA), striking down most of the administration’s current duties. Chief Justice John Roberts wrote the 21-page majority opinion, joined by the three liberal justices, as well as Justices Amy Coney Barrett and Neil Gorsuch. Justice Brett Kavanaugh wrote a dissent, joined by Justices Samuel Alito and Clarence Thomas, arguing that IEEPA’s text clearly delegated tariff power to the executive, and noted that courts have avoided invoking the “major questions” doctrine in cases involving foreign affairs. To learn more about the decision and its implications, read the full piece in today’s TMD , as well as Amy Howe’s SCOTUSblog write-up and articles from Ilya Somin , Matthew Mitchell , Nick Catoggio , and Jonah Goldberg on the site. The justices did not determine whether or how to issue refunds for the duties. In response to the ruling, Trump on Friday said the justices who voted against him were a “disgrace to our nation” and “unpatriotic,” accusing them of being “swayed by foreign interests.” On Friday, Trump announced a 10 percent global tariff —hiked to 15 percent on Saturday—which is set to take effect tomorrow. This will expire after 150 days, however, unless Congress votes to extend it. U.S. Intel Assists In Mexico Cartel Operation U.S. and Mexican officials said on Sunday that a Mexican-led military operation, assisted by U.S. intelligence, killed Nemesio Rubén Oseguera Cervantes, the boss of the Jalisco New Generation Cartel (CJNG) and the country’s most-wanted criminal. The government forces intercepted Oseguera Cervantes, nicknamed “El Mencho,” in the southern part of Jalisco, aiming to arrest him. However, a firefight followed between the forces and cartel members, in which soldiers shot seven cartel fighters; four of whom died on site, and the remaining three, including Oseguera Cervantes, died while being flown to Mexico City for treatment. Three soldiers were injured in the shootout. Government forces also detained two others in the operation. Last year, the Trump administration designated Oseguera Cervantes’ Jalisco New Generation Cartel as a foreign terrorist organization. A former U.S. official told Reuters that Oseguera Cervantes was a top target, and possibly the highest-level target, in Mexico for the U.S. government. The U.S. Embassy in Mexico put out a warning on Sunday to U.S. travelers in five Mexican states, advising them to “shelter in place until further notice” amid the unrest. Violence has erupted across Mexico in the aftermath, with CJNG members and affiliates torching vehicles to block roads at more than 250 points across 20 states. New Economic Data A new Bureau of Economic Analysis report published on Friday found that the personal consumption expenditures (PCE) price index—the Federal Reserve’s preferred inflation metric— increased 0.4 percent in December 2025 from the previous month. Annual PCE inflation was at 2.9 percent in December, up 0.1 percent from the year-over-year mark in November. Core PCE, which excludes more volatile food and energy prices, also increased 0.4 percent in December and is up 3.0 percent annually. The release of the reports had been delayed due to the fall 2025 government shutdown, and January’s PCE report is not expected to be released until mid-March. U.S. GDP grew at an annualized rate of 1.4 percent in the fourth quarter of 2025, substantially lower than Dow Jones’ estimates of 2.5 percent. In 2025, GDP grew by 2.2 percent, a 0.6 percentage point decline from the U.S.’s economic gains in 2024. Trump claimed on Truth Social on Friday that the government shutdown, which he pinned on Democrats, was to blame for the lackluster GDP gains. Trump also criticized Federal Reserve Chairman Jerome Powell, urging him to lower interest rates and describing him as “the WORST!!!” ISIS Suspects Escape in Syria The Wall Street Journal reported Friday that a majority of people held at an Al-Hol detention camp in Syria, which included suspected Islamic State fighters, have escaped during a five-hour security vacuum when the Syrian Democratic Forces (SDF) withdrew and Syrian government forces had yet to secure the camp. U.S. officials told the Journal that an estimated 15,000 to 20,000 people, including Islamic Jihadist terrorists and their families, are believed to be on the loose. U.S. officials attributed the escape to mismanagement of the facility by Syria’s government and a failure to secure the detention camp’s security perimeter. Earlier that week, Reuters reported that many foreign nationals detained at the Al-Hol camp had fled, and that those who remain are mostly Syrians. On Saturday, Islamic State spokesman Abu Huzaifa al-Ansari released his first audio statement since January 2024, urging Islamic jihadists to make it “their priority” to fight the “new Syrian regime.” Outlets report that U.S. forces will fully withdraw from Syria within a month. Armed Man Shot and Killed at Mar-a-Lago Security officials at Trump’s Mar-a-Lago mansion and resort in Florida shot and killed an armed 21-year-old North Carolina man after he entered “the inner perimeter” near the north gate of the property. The president was in Washington, D.C., at the time of the incident. Palm Beach County Sheriff Ric Bradshaw said at a press conference that law enforcement officials had ordered the man to “drop the items,” including a shotgun and a fuel cannister, but he instead raised the firearm to a “shooting position.” In response, the security officials, including one deputy and two Secret Service agents, opened fire, fatally striking him. No law enforcement officials were harmed during the incident. That morning, the suspect’s mother shared that her son had left home on Saturday and had stopped communicating later that night, behavior she said was unusual for him. A message from Pacific Legal Foundation Can Trump Take Credit for Lower Oil Prices? While it is undeniable that President Trump wants lower oil prices, his track record—in terms of oil market influence through his first year back in office—is mixed, and arguably leans in the opposite direction. Thus far in his second term, Trump has been a net positive factor for oil prices, tightening the market through his aggressive policies toward producers Iran, Russia, and Venezuela. That prices have dropped, then, is largely in spite of the White House and has been the result of policy choices by the world’s other major oil-producing states. Read more in Dispatch Energy . Duty Free The U.S. Supreme Court building in Washington, D.C. (Photo by Al Drago/Bloomberg via Getty Images) Erik Bigglestone’s role as owner and manager of a board game store in Berkeley, California, usually includes organizing events, selecting inventory, and handling the other logistical aspects of running a brick-and-mortar business. But in 2025, he added a new responsibility: suing the president of the United States. Bigglestone was one of several small business owners who signed onto an amicus brief supporting a legal challenge to President Donald Trump’s tariffs in Learning Resources, Inc. , v. Trump, President of the United States . TMD spoke to him in November, as the case was ongoing, and again on Friday, after his side had triumphed at the Supreme Court. “I’m feeling, you know, conditionally good,” he said. “[But] it’s definitely a long road ahead here.” That journey began on Friday, when the Supreme Court rejected a key legal pillar of the president’s tariff policy. In a 6-3 decision , three members of the court’s conservative bloc—including two Trump appointees— joined the three liberals to hold that the White House’s invocation of the International Emergency Economic Powers Act (IEEPA) to levy tariffs on most countries exceeded the scope of the law. Chief Justice John Roberts wrote the majority opinion, with Justices Neil Gorsuch, Amy Coney Barrett, Elena Kagan, and Ketanji Brown Jackson each filing separate concurrences. Justice Brett Kavanaugh wrote a dissent joined by Justices Samuel Alito and Clarence Thomas, with Thomas also writing his own separate dissent. In a press conference later that day, Trump castigated the justices who voted against him as a “disgrace to our nation” and “unpatriotic,” accusing them of being “swayed by foreign interests” and promising to continue implementing his trade policies via other avenues. But will those other avenues afford him the same wide latitude over tariff policy he enjoyed while using IEEPA? And how will Friday’s decision affect the countries and businesses that bore the brunt of the tariffs? You are receiving the free, truncated version of The Morning Dispatch . To read the full newsletter—and unlock all of our stories, podcasts, community benefits, and our newest feature, Dispatch Voiced , which allows you to listen to our written stories in your own podcast feed— join The Dispatch as a paying member . The government’s case in Learning Resources rested on IEEPA’s provision that allows the president to “regulate … importation or exportation” of “property in which any foreign country or a national thereof has any interest” in the event of a national emergency. Trump had invoked the law last year when issuing a series of executive orders that imposed punitive tariffs on Canada, Mexico, and China to address alleged failures to stop drug trafficking, setting a flat 10 percent minimum tariff on imports from almost every other country, and adding further “reciprocal” tariffs on dozens of countries that the White House believed had engaged in unfair trade practices. The Supreme Court majority’s reasoning was straightforward: IEEPA does not mention the word “tariff,” has never been used to impose tariffs, and therefore could not be interpreted as giving the president nearly unlimited power to unilaterally set tariff rates. “We decide whether the International Emergency Economic Powers Act (IEEPA) authorizes the President to impose tariffs,” Roberts wrote in the first sentence of the majority opinion. “Based on two words separated by 16 others in Section 1702(a)(1)(B) of IEEPA—‘regulate’ and ‘importation’—the President asserts the independent power to impose tariffs on imports from any country, of any product, at any rate, for any amount of time. … Those words cannot bear such weight.” All six justices in the majority agreed on that basic point. But they split on the “Major Questions Doctrine”: the principle, popular among conservative lawyers and judges, that Congress must be clear and explicit when delegating important powers to the executive branch. While Barrett and Gorsuch signed on to Roberts’ argument that Trump must “point to clear congressional authorization” to impose tariffs, the three liberal justices did not. Liberal justices have tended to distrust the Major Questions Doctrine as a theory of interpretation, arguing that it expands judicial power at the expense of federal agencies and regulatory expertise. Justice Kagan wrote in her concurrence, for example, that “straight-up statutory construction resolves this case” for her, and that she needed “no major-questions thumb on the interpretive scales.” The chief dissent was authored by Kavanaugh. “Like quotas and embargoes, tariffs are a traditional and common tool to regulate importation,” he wrote , arguing that previous 20 th -century laws granting the president the authority to impose tariffs meant that Congress would have intended regulation to include the tariff power as well. Kavanaugh separately argued that courts should not apply the Major Questions Doctrine to foreign affairs, a position consistent with his broader view of executive primacy in that domain. “Although I firmly disagree with the Court’s holding today, the decision might not substantially constrain a President’s ability to order tariffs going forward,” Kavanaugh concluded, “because numerous other federal statutes authorize the President to impose tariffs and might justify most (if not all) of the tariffs at issue in this case—albeit perhaps with a few additional procedural steps that IEEPA, as an emergency statute, does not require.” Trump himself seemed to agree, noting in his Friday afternoon press conference that Kavanaugh’s “stock has gone so up.” The president vowed to continue his tariff policies regardless, using different mechanisms that already have congressional approval: Sections 122 and 301 of the 1974 Trade Act , and Section 232 of the Trade Expansion Act of 1962. On Friday, the White House invoked Section 122, which allows the president to impose tariffs to combat “large and serious” balance-of-payments deficits, to impose a 10 percent across-the-board tariff. One day later, that number was bumped up to 15 percent—the maximum allowable under the law. While Section 122 tariffs require congressional reauthorization after 150 days, Kathleen Claussen, an expert in international trade law at Georgetown University Law School, told TMD , “I don’t see any legal barrier to the President on day 151, declaring, again, that 122 is in place.” On Friday, U.S. Trade Representative Jamieson Greer issued a statement declaring that his office would immediately begin investigations under Section 301 of the 1974 Trade Act, which allows the president to impose tariffs after an investigation finds that a given country is engaging in unfair trade practices. Almost all of the tariffs against China fall under this authority and have withstood legal challenges—and Greer believes it could “cover most major trading partners,” hitting a range of potential concerns. Greer said tariffs under Section 232 of the Trade Expansion Act—which grants the president broad authority to impose tariffs on imports deemed important to national security—will also be maintained and possibly expanded. The White House has already used this authority to set tariffs on steel, aluminum, automobiles, and lumber, among other products. All of these authorities are on much firmer legal footing than IEEPA tariffs, Timothy Meyer, an expert on international trade law at Duke University School of Law, told TMD . In Learning Resources , Meyer said, the court answered the question of “does the president have the power to impose taxes, basically, given that the statute doesn’t say anything about taxes.” He added that most of these other laws “actually do explicitly authorize tariffs.” “I’ve heard everybody say the president is more constrained” following the court’s decision, Claussen, the Georgetown University Law School professor, said. “Factually, that is true, but as a matter of magnitude or scale, it’s not that much.” That only three justices were willing to invoke the Major Questions Doctrine also bodes ill for those hoping that the theory will place further limits on the president’s economic powers, according to Scott Anderson, a fellow at the Brookings Institution and former attorney-advisor for the State Department. “In the context of major questions doctrine, obviously three justices think that a foreign relations nexus is not a barrier to application,” he told TMD . “There’s actually a bigger divide here between Kavanaugh and the other conservative justices that hasn’t fully been reckoned with,” on the question of the courts’ role in foreign affairs. Friday’s ruling also left another major question unanswered: refunds. In its decision, the majority didn’t address whether the government was now required to issue refunds for the struck-down tariffs, or to whom. “Wouldn’t you think they would have put one sentence in there saying that keep the money or don’t keep the money, right?” Trump complained on Friday. “I guess it has to get litigated for the next two years. … We’ll end up being in court for the next five years.” Some companies, such as the Toyota Group affiliate Toyota Tsusho, have already sued the U.S. government seeking relief for paying import duties. Claussen noted that there’s precedent here, as many of the tariffs imposed on Japan last year were refunded following the U.S.-Japan trade deal in the fall. But as of now, the White House is waiting for further orders from the courts. “We’ll follow whatever they say to do,” Greer told Fox News on Sunday. There is also the matter of countries that have agreed to trade deals over the past year that include tariffs above 15 percent. On Thursday—one day before the court issued its decision—Indonesia signed a U.S. trade agreement that included a 19 percent tariff rate. CNBC reported on Sunday that India, which had agreed to an interim deal earlier this month that set the tariff on Indian imports at 18 percent, would be rescheduling meetings with the U.S., set for this week, that were intended to finalize the deal. It’s unclear whether these commitments still hold. “That’s the one that countries are asking me, with IEEPA having fallen,” Claussen told TMD —not just whether they need to uphold their end of the bargain, but what the U.S. is now offering in return. For small business owners like Bigglestone, it’s unclear whether refunds would bring any relief at all, as his company mostly suffered from increased costs further up the supply chain. “My big ask is to make [refunds] happen as quickly as possible for the stakeholders, because they’re not going to give me that money back directly,” he told TMD . “I need you to give them some relief so that hopefully we’ll be able to get some relief too.” Today’s Must-Read The Monday Essay ‘Hero’ Isn’t a Bygone Concept Samuel Kronen / February 23, 2026 The modern imagination is fascinated with medieval history, knighthood, and heroism, with countless films and shows centering around these periods and themes in recent years—HBO’s A Knight of the Seven Kingdoms is the latest example. In this week’s Monday Essay, writer Sam Kronen analyzes the classic hero’s journey, and why these stories are particularly important for Gen Z. “The heroic ideal reminds us of our potential for great heights and depths: There are potential and actual heroes all around us, in the small and quiet places,” he writes. “Young people, especially, who are so spiritually and morally exhausted by our digital hellscape, might benefit from hero stories; they might learn that it’s still possible to stand for something, to live and die for something, to become more than what you are by committing to an ideal.” Toeing the Company Line Trump, Tariffs, and the Dangers of an Unbound Presidency Matthew Mitchell / February 22, 2026 The president already found a workaround to impose new tariffs. Will Congress reclaim its power? The Supreme Court Spurns a Presidential Power Grab Ilya Somin / February 23, 2026 But the court sidestepped the president’s claims to sweeping emergency powers. Marco Rubio Has a ‘Rainy Day’ Account. What Does That Mean for 2028? David M. Drucker / February 23, 2026 The secretary of state has been vocally supportive of J.D. Vance. But some Republicans would prefer him to the vice president. How to Sell Chewing Tobacco Valerie Pavilonis , Chris Stirewalt , & Anna Coulter / February 21, 2026 Mail Pouch barns, a deranged penguin, and mouth tape. Lent Reminds Us That a Penitent Imagination Can Counter Evil Michael Reneau & Hannah Anderson / February 22, 2026 What’s happening right now is unimaginable, and that’s a problem. In Other News Today in America U.S. Southern Command struck another suspected drug trafficking boat in the Eastern Pacific on Friday, killing three people aboard. Deputy Attorney General Todd Blanche fired longtime defense lawyer James Hundley from his post as federal attorney for the Eastern District of Virginia, hours after a federal panel appointed him to the position. The Homeland Security Department said the Transportation Security Administration’s Pre-Check program will remain active for now, after earlier announcing that its services would be suspended. U.S. and Iranian officials will reportedly meet indirectly in Geneva on Thursday. With the games now over, Norway led the overall Olympic medal count, with 41, and the gold medal count with 18. The U.S. won 33 medals at the Winter Olympics: 12 gold, 12 silver, and nine bronze. The U.S. men’s hockey team defeated Canada 2-1 in overtime to take the gold for the first time since the “Miracle on Ice” team in 1980. Around the World Pakistan’s military carried out air raids on eastern Afghan border provinces. Pakistan claims its forces killed 70 militants, whereas Afghanistan’s Taliban government said civilians were targeted and that the strikes were a violation of its sovereignty. Israeli settlers are suspected of torching a mosque in the West Bank town of Tell, near Nablus, overnight, tagging the building with “price tag” and “revenge” graffiti. India and Brazil reached a deal to expand mineral-mining operations together. A Ukrainian police officer was killed , and 24 others were wounded, following blasts in Lviv that police later determined came from “homemade explosive devices.” Ukrainian President Volodymyr Zelensky said the attack was orchestrated by Russia. Chinese state-run media reported that China’s navy tracked and monitored an Australian warship that traveled in the Taiwan Strait. Large numbers of Cuban security officials and professional health authorities, including doctors, are reportedly leaving Venezuela. On the Money Trump, in a social media post, warned Netflix to fire the streaming company’s board member, Susan Rice, or “pay the consequences.” Novo Nordisk shares fell 15 percent on Monday after a head-to-head trial showed its next-generation weight-loss drug, CagriSema, failed to match the efficacy of Eli Lilly’s rival compound, tirzepatide. Colombia’s energy chief said the country’s state-owned oil company cannot obtain a license from the U.S. to import natural gas from Venezuela. The electric power company PacifiCorp will pay $575 million in a settlement agreement with the federal government following allegations that the company’s power lines were responsible for starting four fires in Oregon and two in California between 2020 and 2022. Phil Spencer, who led Microsoft’s gaming division for 12 years and spent 38 years at the company, announced his retirement. Microsoft named Asha Sharma, who previously led product development for the company’s AI tools and services, to replace Spencer. An investigation by the Financial Times reportedly determined that a smuggling ring of about 48 entities has helped Russia transport about $90 billion of sanctioned oil. Worth Your Time “The ‘Incredibly Significant’ US Military Forces Surrounding Iran” ( Financial Times ) Stacey Vanek Smith looks at the moves Jerome Powell has made to further protect the central bank’s independence. ( Bloomberg ) Hanan Zaffar and Jyoti Thakur report on the growing number of Indians using AI deepfakes to bring back dead and absent loved ones. ( Rest of World ) Jackie Flynn Mogensen on how an AI tool may have unlocked the rules for playing an ancient Roman board game. ( Scientific American ) Amanda Sakuma breaks down the structural flaws in sizing options for women’s clothing. ( Pudding ) Rob Biertempfel on the life of former professional baseball player Bill Mazeroski, who hit the game-winning home run in Game 7 of the 1960 World Series, and died on Saturday at the age of 89. ( The Athletic ) Presented Without Comment Justice Neil Gorsuch, in his Learning Resources, Inc. , v. Trump concurrence: For those who think it important for the Nation to impose more tariffs, I understand that today’s decision will be disappointing. All I can offer them is that most major decisions affecting the rights and responsibilities of the American people (including the duty to pay taxes and tariffs) are funneled through the legislative process for a reason. Yes, legislating can be hard and take time. And, yes, it can be tempting to bypass Congress when some pressing problem arises. But the deliberative nature of the legislative process was the whole point of its design. Through that process, the Nation can tap the combined wisdom of the people’s elected representatives, not just that of one faction or man. There, deliberation tempers impulse, and compromise hammers disagreements into workable solutions. And because laws must earn such broad support to survive the legislative process, they tend to endure, allowing ordinary people to plan their lives in ways they cannot when the rules shift from day to day. In all, the legislative process helps ensure each of us has a stake in the laws that govern us and in the Nation’s future. For some today, the weight of those virtues is apparent. For others, it may not seem so obvious. But if history is any guide, the tables will turn and the day will come when those disappointed by today’s result will appreciate the legislative process for the bulwark of liberty it is Also Presented Without Comment Fortune : ‘I Have a Chip on My Shoulder.’ Phoebe Gates Wants Her $185 Million AI Startup Phia To Succeed With ‘No Ties to My Privilege or My Last Name’ Also Also Presented Without Comment The Guardian : Man in Sicily Trained His Dog To Illegally Dump Rubbish, Say Police Let Us Know Have any thoughts or questions about today’s newsletter? Drop us a note in the comments or via email at tmd.questions@thedispatch.com. We read every submission, and your message could be featured in an upcoming “Behind the Scenes” segment. Have any thoughts or questions about today’s newsletter? Become a member to unlock commenting privileges and access to a members-only email address. We read every submission, and answer questions in the following edition of TMD . James P. Sutton James P. Sutton is a Morning Dispatch Reporter, based in Washington D.C. Prior to joining the company in 2024, he most recently graduated from University of Oxford with a Master’s degree in history. He has also taught high school history in suburban Philadelphia, and interned at National Review and the Foreign Policy Research Institute. When not writing for The Morning Dispatch, he is probably playing racquet sports, reading a history book, or rooting for Bay Area sports teams. Peter Gattuso Peter Gattuso is a Morning Dispatch reporter for The Dispatch, based in Washington, D.C. Prior to joining the company in 2024, he interned at The Dispatch, National Review, the Cato Institute, and the Competitive Enterprise Institute. When Peter is not fact-checking, he is probably watching baseball, listening to music on vinyl records, or discussing the Jones Act. Ross Anderson Ross Anderson is the Editor of The Morning Dispatch, based in London. Prior to joining the company in 2025, he was an editor at The Spectator, columnist at The New York Sun, and a Tablet fellow. When Ross isn’t working on TMD, he’s probably trying out new tech, lifting weights, or hanging out with his cat, Teddy. Newsletter selected Click sign up to start receiving your newsletters. Sign up Submitting...",
    "url": "https://thedispatch.com/newsletter/morning/trump-loses-tariff-case/",
    "publication_date": "Mon, 23 Feb 2026 11:43:36 +0000",
    "date_gathered": "2026-02-24T04:09:47.766335",
    "country": "US",
    "organization": "The Dispatch"
  },
  {
    "title": "Freedom Hasn’t Always Meant Choice | Interview: Sophia Rosenfeld",
    "content": "Freedom Hasn’t Always Meant Choice | Interview: Sophia Rosenfeld Jonah Goldberg / February 23, 2026 The Remnant Listen on your player of choice Text Size Premium Members can share articles with friends & family to bypass the paywall. Facebook Twitter LinkedIn Threads Email 0 Open and scroll to the comments section On today’s episode, Jonah spoils himself by conversing with historian Sophia Rosenfeld about the history of choice, changes in the meaning of freedom, the significance of the mundane, and the American Revolution’s impact on Europe. Shownotes: — The Age of Choice: A History of Freedom in Modern Life — Jerry Muller: The Mind and the Market: Capitalism in Western Thought — Moscow On The Hudson Coffee Coffee Coffee — FDR: Second Bill of Rights — Milton Friedman: Free to Choose: A Personal Statement — Irving Kristol: “The American Revolution as a Successful Revolution” — Jonah: “The American Revolution was a Really Big Deal” — Voices of Protest: Huey Long, Father Coughlin, & the Great Depression The Remnant is a production of ⁠The Dispatch⁠ , a digital media company covering politics, policy, and culture from a non-partisan, conservative perspective. To access all of The Dispatch’s offerings—including access to all of Jonah’s G-File newsletters— ⁠click here⁠ . If you’d like to remove all ads from your podcast experience, consider becoming a premium Dispatch member ⁠by clicking here⁠ . Jonah Goldberg Jonah Goldberg is editor-in-chief and co-founder of The Dispatch, based in Washington, D.C. Prior to that, enormous lizards roamed the Earth. More immediately prior to that, Jonah spent two decades at National Review, where he was a senior editor, among other things. He is also a bestselling author, longtime columnist for the Los Angeles Times, commentator for CNN, and a senior fellow at the American Enterprise Institute. When he is not writing the G-File or hosting The Remnant podcast, he finds real joy in family time, attending to his dogs and cat, and blaming Steve Hayes for various things.",
    "url": "https://thedispatch.com/podcast/remnant/freedom-hasnt-always-meant-choice-interview-sophia-rosenfeld/",
    "publication_date": "Mon, 23 Feb 2026 08:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:48.994825",
    "country": "US",
    "organization": "The Dispatch"
  },
  {
    "title": "Marco Rubio Has a ‘Rainy Day’ Account. What Does That Mean for 2028?",
    "content": "David M. Drucker / February 23, 2026 Marco Rubio Has a ‘Rainy Day’ Account. What Does That Mean for 2028? The secretary of state has been vocally supportive of J.D. Vance. But some Republicans would prefer him to the vice president. Politics Illustration by Noah Hickey/The Dispatch (Photo by Umit Bektas / POOL / AFP via Getty Images). Illustration by Noah Hickey/The Dispatch (Photo by Umit Bektas / POOL / AFP via Getty Images). Audio Audio Turn any article into a podcast. Upgrade now to start listening. Text Size Premium Members can share articles with friends & family to bypass the paywall. Facebook Twitter LinkedIn Threads Email 0 Open and scroll to the comments section Marco Rubio is vowing not to challenge Vice President J.D. Vance for the Republican nomination, a decision that appears to preclude the secretary of state from launching a 2028 White House bid. But many GOP insiders believe that commitment is less ironclad than it seems. Stoking skepticism of Rubio’s denials has been his recent assertion of influence inside President Donald Trump’s Cabinet: torpedoing the Russia-friendly peace accord White House diplomatic envoy Steve Witkoff tried to force on Ukraine, running point on Venezuela following U.S. military action to facilitate the arrest of strongman Nicolás Maduro, and addressing European leaders at the Munich Security Conference. Also sparking speculation that Rubio is keeping his options open is the existence of a political nonprofit group founded and run by close political advisers. America 2100 was founded in 2023, at the beginning of Rubio’s third term as a Florida senator, by Mike Needham, a top political counselor and his former chief of staff. The 501(c)4 organization’s slogan—“Ensuring the next century is an American century”—is similar to the secretary’s 2016 presidential campaign motto. Since circulating videos in the fall of 2024 to bolster the Trump-Vance campaign, America 2100 has gone dormant. Per its latest Internal Revenue Service filing, the group had banked just under $3 million, a paltry sum. But that the group continues to exist has caught the attention of some veteran Republican operatives. America 2100 could function as an initial launchpad for a Rubio 2028 bid should circumstances change—for instance, in the event Vance doesn’t run for president. The organization might also offer a discreet way for GOP donors who hope the secretary changes his mind about seeking the White House to express support, as 501(c)4s do not have to disclose contributors. (America 2100 declined to comment.) “This is like planning for a rainy day,” Republican consultant Jeff Burton told The Dispatch . “At this point it doesn’t appear likely that he would run against J.D. Vance. But a lot can happen in the next couple of years. Things change fast in politics and it’s always better to be prepared.” “There’s going to be a large contingency of donors who prefer Rubio to Vance,” a longtime Republican strategist added, requesting anonymity to speak candidly. “That does not mean Rubio will run—but it does mean there will be a market for him to run whether he chooses to do so or not. And so it only makes sense there would exist a receptacle for people to go who just walk in the door.” With Trump, 79, barred from reelection because of constitutional term limits, Vance’s and Rubio’s emergence as the leading Republicans to succeed him in 2028 reveals the extent to which the outgoing president has altered the GOP during his decade-plus atop the party. For nearly three decades after Ronald Reagan’s presidency, traditional conservatives made up the majority of the Republican coalition. They were (and are) partial to small government, free markets and free trade, and a foreign policy that favored interconnected alliances led by Washington, with the GOP platform reflecting that agenda. Heading into the nation’s 61 st presidential election, conservative populists have firmly taken the reins of power from the Reaganites. Big government industrial policy is in, as is skepticism of financial markets, international trade, and foreign policy that revolves around the post-World War II alliances the U.S. built and nurtured for so long. To varying degrees, Vance and Rubio reflect this newer, Trump-inflected populist GOP—and their domination of the 2028 discussion on the right suggests the previous version of the party isn’t returning anytime soon (although traditional conservatives remain as a robust minority). “Rubio and Vance represent different shades of the post-Trump, populist domination of the Republican primary base,” Henry Olsen , a senior fellow at the Ethics and Public Policy Center, a conservative think tank in Washington, D.C., said in an interview with The Dispatch . “The fact that they are the two people who are being talked about as the leading contenders demonstrates that … a return to pre-Trumpism is impossible.” “The victory of Trump in 2016, and the victory of Trump in 2024, and the continued victories of Trumpist-style candidates in Republican primaries shows that Republican voters like a populist-infused Republican party,” added Olsen, who has closely studied populism’s rise inside the GOP. “There is still a significant minority that would prefer an unpopulist-infused Republican. They are overrepresented in the D.C. elites.” Rubio, 54, says he is firmly behind Vance for 2028. “If J.D. Vance runs for president, he’s going to be our nominee, and I’ll be one of the first people to support him,” the secretary told Vanity Fair in an interview last year. Rubio is no doubt interested in mounting another White House bid, an effort that might be less taxing the second time around because his four children are now grown. But so far, Rubio is focusing on his job—doing and saying little to cast doubt on the sincerity of his endorsement of the vice president. Indeed, to avoid uncertainty about his intentions, the secretary appears to be deliberately steering clear of domestic travel, other than to Florida to visit family (including trips to Gainesville, to watch his son play football for the University of Florida). Compare that to Mike Pompeo, Trump’s secretary of state during the final three years of his first presidency. Pompeo traveled extensively inside the U.S. during his tenure, while also hosting private dinners with business, media, and political leaders aimed at raising his national profile. Meanwhile, Vance, 41, is full steam ahead. The vice president has spent the last year as Republican National Committee finance chairman, entrenching him in the national party apparatus. Vance is supported on the outside by a coalition of wealthy GOP donors and party operatives, known as Rockbridge Network —formed specifically to strengthen his White House prospects. And he regularly gasses up Air Force Two for trips abroad and to key swing states to promote Trump’s domestic and foreign policy agendas, all the while burnishing his image as the 45 th and 47 th president’s heir apparent. Add to that Vance’s incredible popularity among Republican primary voters, the likelihood of receiving Trump’s endorsement should he run—and, according to some Republican insiders, the unlikelihood of facing meaningful competition in the primary—and the nomination would seem his for the taking. Still, when asked about his 2028 plans and a theoretical rivalry with Rubio, the vice president downplays both. “Marco is my closest friend in the administration, I think he’s doing a great job for the American people,” he told Fox News’ Martha MacCallum . “That’s what we’re focused on.” “I think it’s so interesting,” Vance added in that interview. “The media wants to create this conflict, where there just isn’t any conflict.” But it’s not just the media. Gaming out whether Rubio 2028 comes to fruition, or whether the GOP is more likely than not to nominate a Vance-Rubio ticket, is something of an obsession among Republicans inside the Beltway. Many traditional conservatives inside the party regularly confide to The Dispatch that they prefer Rubio. To be sure, the secretary embraced Trump-styled domestic populism following his failed 2016 presidential campaign. But he has retained his penchant for internationalist foreign policy that projects American power and is friendlier to alliances, which is comforting to GOP Reaganites—especially if the alternative is Vance. Plus, they’re convinced Rubio is more appealing than the vice president with general election voters. As for Rubio, he once reflected on what it takes to be successful in presidential politics in an interview with this reporter, explaining, essentially, that it all comes down to timing. And that might shed some light on his thinking vis-à-vis Vance. “I’m not a surfer but I equate it a little bit to surfing,” the secretary said following Trump’s first term, in an interview for In Trump’s Shadow; The Battle for 2024 and the Future of the GOP about his political future. “You can have the best surfboard in the world; you could be the best surfer in the world. If there’s no waves, or if you don’t time the waves, you’re not going to surf. You don’t control that part of it.” David M. Drucker David M. Drucker is a senior writer at The Dispatch and is based in Washington, D.C. Prior to joining the company in 2023, he was a senior correspondent for the Washington Examiner. When Drucker is not covering American politics for The Dispatch, he enjoys hanging out with his two boys and listening to his wife's excellent taste in music.",
    "url": "https://thedispatch.com/article/marco-rubio-vance-heir-trump/",
    "publication_date": "Mon, 23 Feb 2026 07:45:00 +0000",
    "date_gathered": "2026-02-24T04:09:49.692524",
    "country": "US",
    "organization": "The Dispatch"
  },
  {
    "title": "‘Hero’ Isn’t a Bygone Concept",
    "content": "Samuel Kronen / February 23, 2026 ‘Hero’ Isn’t a Bygone Concept Courage can persist even in the modern world. The Monday Essay Illustration by Noah Hickey/The Dispatch (Photograph by Steffan Hill/HBO). Illustration by Noah Hickey/The Dispatch (Photograph by Steffan Hill/HBO). Audio Audio Turn any article into a podcast. Upgrade now to start listening. Text Size Premium Members can share articles with friends & family to bypass the paywall. Facebook Twitter LinkedIn Threads Email 0 Open and scroll to the comments section This winter, HBO took us back to the world of Westeros with its new series, A Knight of the Seven Kingdoms . The show follows a humble everyman hedge knight and his weird little squire as they travel around the continent looking for people to save and end up getting caught up in all sorts of shenanigans and scenarios connected to the larger fate of the kingdom. The story is about how much good can be done with a strong will and heart, and it explores what it means to be a true hero in a broken and complex world. Unlike Game of Thrones and House of the Dragon, A Knight of the Seven Kingdoms is much more contained in its scope, lighter in spirit and tone. Taking place about 90 years before the events of Game of Thrones, we are introduced to a young man named Dunk, an orphan bastard from the slums of the capital who is raised and trained by a hedge knight. (In this world, hedge knights are roaming mercenaries.) When his father figure dies at the beginning of the story, Dunk takes up his master’s sword and hits the road as a traveling hedge knight to participate in a tourney under the false title Ser Duncan the Tall. Dunk is not very smart or talented, but he’s big and strong and truly wants to be and do good. On the road, Dunk meets a fellow traveler named Egg, a strange child with a bald head and a sharp tongue, and together they form a kind of odd couple dynamic. But Dunk is not a real knight, and Egg is not a peasant despite presenting as one, and their adventures have a huge impact on the later story of Game of Thrones. The success of George R.R. Martin’s books and shows is a testament to the reality, complexity, and depth of his characters and stories, balancing human political drama with an air of prophecy and myth and magic. The Seven Kingdoms of Westeros, a proxy for the Western world and where most of the story takes place, are constantly devolving into chaos and warfare—and they were only able to be united by the judicious use of gigantic fire-breathing f–king dragons centuries prior by the ruling family, the blonde and purple-eyed Targaryens. In this world, seasons can last years, magic is real but obscure, whole empires have literally erupted in a flood of apocalyptic flame, and entire continents are left unexplored and filled with ungodly creatures like giant worms and monkeys and dinosaurs: People exist at the mercy of an unforgiving environment and its natural and unnatural forces. Yet in a world of such instability and uncertainty, with pain and death waiting around every corner, people hold to the things that give life firmness: sacred duties and traditions, and the vows that transcend time. In our own history, the notion of knighthood emerged from the broken feudal system of the Dark Ages, in which individuals with martial prowess were tasked with restoring law and order and keeping the peace in exchange for land and titles. Knights were meant to dole out justice and defend the vulnerable and innocent, taking sacred vows to be courageous, honorable, and humble. In practice, however, they were often marauding agents of chaos and wielders of brutal oppressive power: As the historian Barbara Tuchman has written , “by the 14th century, the violence and lawlessness of men of the sword had become a major agency of disorder.” But just because knights didn’t always live up to the ideal doesn’t mean it was the wrong ideal. Being a hero and a knight is about more than noble titles and ceremonies. It’s about certain essential human qualities that anyone can access—loyalty, bravery, honor, inner power—to navigate suffering well and carry on despite adversity, qualities which imply a kind of purity and wholeness of being. The modern imagination is fascinated with medieval history, knighthood, and heroism, with countless recent films and shows centering around these periods and themes . There is clearly some sort of unconscious longing at play, a yearning to connect with the values and beliefs that carried our ancestors through much harsher times. As the Gen Z writer Freya India has observed , what many young people seem to crave today is to be humbled and bound, to be tethered to something that lasts. And so while stories of knights and heroes may be antiquated on the surface, we can’t seem to totally shake off the ideas at their centers. The mythic hero’s journey follows an unmistakable cycle. An individual is pulled from obscurity and away from home, their journeys and struggles bring about great inner change that culminates in a confrontation—with the darkness, the dragon, chaos—before returning home to renew the larger community and restore balance to the world. As Joseph Campbell put it in his classic Hero with a Thousand Faces , “A hero ventures forth from the world of common day into a region of supernatural wonder: fabulous forces are there encountered and a decisive victory is won: The hero comes back from this mysterious adventure with the power to bestow boons on his fellow man.” What makes both a hero and an actualized human being is the ability to change reality by facing it. The hero absorbs the darkness, pain and death and time and evil and chaos and fear, and alchemizes it into a source of light and life and fire, standing for what is human against the alienation and adversity and absurdity of the natural universe. This alchemizing is not easy: It demands wrestling with difficult realities, often represented in film and literature by the dragon, the monster, the darkness. The suffering built into facing reality is a call to heroic action; how one bears and uses that suffering is what makes a hero. The ideal of an independent individual—relying on their own strength and savvy, committing and devoting themselves to higher principles, moving with purpose and despite pain—still resonates because it’s a profoundly human idea. The whole point of vows and oaths and promises is that they test your honor and faith, holding you to something against the chaos of reality. The closest equivalent to modern knights in contemporary media and culture would be superheroes, cloaked in armor and cape, concealing their identities to stand for a larger ideal and risking life and limb to protect and serve. The best iteration of these themes is Christopher Nolan’s Dark Knight trilogy, which gives a more modern philosophical take on the Batman saga. In the films, Bruce Wayne is a tortured billionaire wrestling with the trauma of watching his parents’ murder as his city comes apart at the seams from crime and social decay. Bruce leaves home to undertake a metaphorical hero’s journey, surveying the world’s criminal underbelly to understand the true nature of evil. He studies martial arts, joins a mercenary group of vigilante ninjas called the League of Shadows, learns to embrace his fears to use against his enemies—in his case a childhood terror of bats—and returns to Gotham transformed into a symbol of justice, a dark knight to be feared and lauded. Justice to Batman is not about personal revenge and evening the scales, but defending the sanctity of human life no matter what. As an initiation into the League of Shadows, Bruce is asked to kill a captured criminal, but he refuses. “Compassion is a weakness your enemies will not share,” he is told. “That’s why it’s so important,” he says. There’s something archetypal and human about putting on a mask to embody an ideal, and the concept of masking is a major touchstone of the trilogy. As Bruce tells the butler Alfred upon his return to Gotham, “People need dramatic examples to shake them out of apathy. I can’t do that as Bruce Wayne. As a man, I’m flesh and blood. I can be ignored, I can be destroyed. But as a symbol, I can be incorruptible. I can be everlasting.” As he later says when asked his true identity, “It’s not who I am underneath, but what I do, that defines me.” Bruce weaponizes his suffering, his fears and vulnerabilities and rage and personal darkness to spare others suffering and save the city—a true hero and a knight. In the second and most successful installment of the trilogy, The Dark Knight, Batman faces an adversary of pure chaos and nihilism: the Joker. At one point, the Joker is killing innocents to force Batman to take off his mask/ When Bruce asks Alfred for advice, the butler tells him, “Endure, Master Wayne. Take it. They’ll hate you for it. But that’s the point of Batman. He can be the outcast. He can make the choice no one else can make: the right choice.” In the final installment, The Dark Knight Rises , Batman is forced to return after a long time away, only to be physically bested and crippled by the villain Bane. Bruce has to embrace his fears once again and rise back to the surface. “Why do we fall?” an earlier phrase from his father rings out in his dreams. “So we can learn to pick ourselves up.” A hero keeps coming back, rises . And Bane’s plan is foiled by the knight. In the novel A Game of Thrones, an old maester tells a young warrior that love is the death of duty. What is honor compared to a woman’s love? What is duty against the feel of a newborn son in your arms ... or the memory of a brother’s smile? Wind and words. Wind and words. We are only human, and the gods have fashioned us for love. That is our great glory, and our great tragedy. But maybe duty is the highest form of love . Maybe what it means to be a hero lies somewhere directly between our human brokenness and fallenness and our highest and noblest ideals. Maybe people need those ideals and values and archetypes and stories to pull them out of the earthly muck, and it is this constant rising that defines the human condition. Maybe it is only there, on the cutting edge of reality where life meets death, that one discovers the means within oneself to do what is necessary: the will to do and act and change. Because it is not who someone is underneath, but what they do , that defines them. Because it is the qualities a person embraces—dignity, honor, sacrifice, courage, humility—that, when the crucial moment comes, make someone who and what they are, that turns a messy human animal into a lasting ideal, a hero. The heroic ideal reminds us of our potential for great heights and depths: There are potential and actual heroes all around us, in the small and quiet places. Young people, especially, who are so spiritually and morally exhausted by our digital hellscape, might benefit from hero stories; they might learn that it’s still possible to stand for something, to live and die for something, to become more than what you are by committing to an ideal. There’s a Hunter S. Thompson quote that we turn ourselves into beasts to avoid the pain of being a man. But maybe a related truth is that we turn ourselves into heroes to overcome that pain. Samuel Kronen Samuel Kronen is a writer living with myalgic encephalomyelitis. You can follow his work on his Substack, Alien Nation.",
    "url": "https://thedispatch.com/article/gen-z-heroes-bruce-wayne-knights/",
    "publication_date": "Mon, 23 Feb 2026 07:45:00 +0000",
    "date_gathered": "2026-02-24T04:09:50.416561",
    "country": "US",
    "organization": "The Dispatch"
  },
  {
    "title": "The Supreme Court Spurns a Presidential Power Grab",
    "content": "Ilya Somin / February 23, 2026 The Supreme Court Spurns a Presidential Power Grab But the court sidestepped the president’s claims to sweeping emergency powers. Law Illustration by Noah Hickey/The Dispatch (Photos via Unsplash). Illustration by Noah Hickey/The Dispatch (Photos via Unsplash). Audio Audio Turn any article into a podcast. Upgrade now to start listening. Text Size Premium Members can share articles with friends & family to bypass the paywall. Facebook Twitter LinkedIn Threads Email 0 Open and scroll to the comments section On Friday, the Supreme Court ruled on three cases challenging President Donald Trump’s massive system of tariffs imposed under the International Emergency Economic Powers Act of 1977 (IEEPA). In a 6-3 decision , the court rightly held that IEEPA does not give the president the power to impose tariffs. Among the cases decided was VOS Selections Inc. v. Trump , which the Liberty Justice Center and I filed on behalf of five small American businesses harmed by the tariffs (we were later joined by prominent litigators Neal Katyal and Michael McConnell). The decision is important for its impact on tariffs, and as a rejection of a sweeping executive power grab. But it also raises a crucial broader—and as yet unresolved—issue: how much deference to give presidential invocations of sweeping emergency powers. That issue is central to various cases working their way through the courts, and may soon arise again in the tariff context. Trump’s April 2025 “Liberation Day” executive order invoked IEEPA to impose 10 percent tariffs on almost every nation in the world, plus large additional “reciprocal” tariffs against dozens of other countries. He also used IEEPA to impose 25 percent tariffs against Canada and Mexico, and 10 percent tariffs against China, supposedly justified by the flow of fentanyl into the United States from those countries. Taken together, these tariffs amounted to the highest U.S. tariff rates since the disastrous Smoot-Hawley tariffs of the Great Depression, and would have caused grave damage to the U.S. economy . The main basis for the court’s ruling is that IEEPA does not even mention the word “tariff,” and has never been used to impose them by any previous president during the statute’s nearly 50-year history. The power to “regulate” importation, which IEEPA does grant in some situations, does not include a power to impose taxes. But an additional crucial factor was the sheer scope of the authority claimed by Trump. As Chief Justice John Roberts noted in his opinion for the court, the president claimed virtually unlimited power to “impose tariffs on imports from any country, of any product, at any rate, for any amount of time.” The framers of the Constitution wanted to ensure the president would not be able to repeat the abuses of English kings, who imposed taxes without legislative authorization. Under Trump’s interpretation of the law, the president would have virtually unlimited tariff authority, similar to that of an absolute monarch of the kind King Charles I aspired to be. The court decisively rejected this aspiration to unconstrained presidential power. Roberts’ majority opinion, a concurring opinion by Justice Neil Gorsuch, and one by Justice Elena Kagan (writing for all three liberal justices) all, in different ways , emphasized this aspect of the case. As Gorsuch put it, “Our system of separated powers and checks-and-balances threatens to give way to the continual and permanent accretion of power in the hands of one man. That is no recipe for a republic.” In addition to relying on statutory text, the three conservative justices in the majority also bolstered their holding by citing the “major questions doctrine,” which requires Congress to “speak clearly” when authorizing the executive to make “decisions of vast economic and political significance.” In addition, Justice Gorsuch relied on the nondelegation doctrine, which limits the extent to which Congress can delegate its authority to executive discretion. Together, major questions and nondelegation are valuable tools for constraining presidential power grabs. And these three justices deserve credit for applying them to a Republican president with the same rigor as they previously did with Democratic ones, most notably Joe Biden. But the judiciary’s future ability to constrain dangerous presidential power grabs depends in large part on an issue the court managed to avoid in the IEEPA case: whether and to what extent to defer to presidential assertions that an extraordinary situation exists justifying the invocation of sweeping emergency powers. IEEPA is limited to situations in which there is an “emergency” amounting to an “unusual and extraordinary threat.” Trump’s Liberation Day tariffs were supposedly justified by the threat of trade deficits. But deficits are a common phenomenon , neither unusual nor extraordinary. Nor do they pose any danger to the United States. If trade deficits count as an “unusual and extraordinary threat,” virtually anything does. The fentanyl tariffs also did not address a genuine threat. The flow of fentanyl from Canada to the U.S. is negligible , and the vast bulk of that from Mexico is actually brought in by U.S. citizens coming through legal ports of entry. The court didn’t have to consider whether a genuine “unusual and extraordinary threat” existed in the IEEPA case, because it ruled that IEEPA did not authorize imposition of tariffs in any situation. But, as I explained in an earlier piece for The Dispatch , there are many cases working their way through the court system in which presidential invocations of emergency powers depend on determinations that an emergency of the right type exists. Most notably, Trump has claimed that illegal migration and drug smuggling qualify as an “invasion” that justifies invoking the Alien Enemies Act of 1798, which would grant sweeping power to detain and deport even legal migrants. In the event of “invasion,” the Constitution also grants the federal government the power to detain people without due process. The administration has claimed the president is entitled to broad deference when he asserts an invasion exists. So much so that he could—by the Justice Department’s own admission in an ongoing court case—even invoke the Alien Enemies Act in response to the “British Invasion” of rock stars like the Beatles. The ultimate outcome of the “invasion” litigation remains to be seen. Courts would do well to rule, as some already have, that only a military attack qualifies as an “invasion” and that the executive must prove that one exists before invoking emergency powers, not merely assert it. Trump also demands similar deference for his domestic use of the military . Of course, Republican presidents like Trump are not the only ones who can abuse emergency powers. President Biden sought to do so when he tried to use the COVID emergency as a pretext for a massive student loan forgiveness plan, most of whose beneficiaries were not actually victims of the pandemic (the Supreme Court rightly ruled against the move ). Today, as Justice Gorsuch noted during the tariff case oral arguments, some on the left hope to invoke a “climate emergency,” even though climate change is not a sudden crisis but an ongoing long-term problem. The issue of how much deference to give to presidential invocation of emergencies is also likely to arise again in the context of tariffs. Within hours of the court’s decision, Trump issued an executive order using Section 122 of the Trade Act of 1974 to impose 10 percent global tariffs, before upping the rate to 15 percent the next day. But Section 122 only permits tariffs in response to “fundamental international payments problems” that cause “large and serious United States balance-of-payments deficits” (which are not the same thing as trade deficits), “an imminent or significant depreciation of the dollar,” or to cooperate with other countries in addressing an “international balance-of-payments disequilibrium.” As prominent conservative legal commentator Andrew McCarthy explains in an insightful article for National Review , these preconditions for the use of Section 122 do not exist. There is no “fundamental international payments problem,” and the United States does not have a balance-of-payments deficit. In addition, Section 122 tariffs can only remain in force for up to 150 days unless extended by Congress. But when the Section 122 tariffs are challenged in court (as they likely will be), judges will have to decide whether to defer to Trump on the question of whether the statutory prerequisites are met. And when the 150-day period expires, they may also have to decide whether Trump can extend it simply by claiming a new balance-of-payments problem has arisen. If judges (mistakenly) give him broad deference, Section 122 could become a blank check for presidential tariff-setting that the Supreme Court just denied him in the IEEPA case. More generally, if the courts are not willing to carefully scrutinize executive invocations of sweeping emergency powers, deference to such claims could be a backdoor path to the sort of monarchical authority the court rightly rejected in its tariff decision. Ilya Somin Ilya Somin is a professor of law at George Mason University, the B. Kenneth Simon Chair in Constitutional Studies at the Cato Institute, and author of “Free to Move: Foot Voting, Migration and Political Freedom.” Together with the Liberty Justice Center and others, he was co-counsel in VOS Selections v. Trump, one of the tariff cases decided by the Supreme Court.",
    "url": "https://thedispatch.com/article/supreme-court-tariffs-emergency-powers/",
    "publication_date": "Mon, 23 Feb 2026 07:41:00 +0000",
    "date_gathered": "2026-02-24T04:09:51.226812",
    "country": "US",
    "organization": "The Dispatch"
  },
  {
    "title": "Trump, Tariffs, and the Dangers of an Unbound Presidency",
    "content": "Matthew Mitchell / February 22, 2026 Trump, Tariffs, and the Dangers of an Unbound Presidency The president already found a workaround to impose new tariffs. Will Congress reclaim its power? Law The Supreme Court as seen on February 20, 2026. (Photo by Heather Diehl/Getty Images) The Supreme Court as seen on February 20, 2026. (Photo by Heather Diehl/Getty Images) Audio Audio Turn any article into a podcast. Upgrade now to start listening. Text Size Premium Members can share articles with friends & family to bypass the paywall. Facebook Twitter LinkedIn Threads Email 0 Open and scroll to the comments section The Supreme Court has ruled that President Donald Trump’s “emergency” tariffs are unconstitutional . If we were inclined to keep the republic that Ben Franklin and his colleagues imparted to us, that would be that. Trump would concede that the Constitution means what it says when it grants Congress—and Congress alone—the “power to lay and collect taxes, duties, imposts, and excises.” Congress, meanwhile, would reclaim its power. It could use it in one of two ways: either giving the president the tax on Americans he so craves, or declining to do so. Either way, in the words of Justice Neil Gorsuch, it would “tap the combined wisdom of the people’s elected representatives, not just that of one faction or man.” How quaint. Ideally, everyone would grant that there is some virtue in preserving the basic elements of a republican system: that is, a system in which elected officials have certain limited and enumerated powers granted through the Constitution. And any power not explicitly granted to one branch of the government or another would be reserved for the people or the states, respectively. But, alas, I fear that few in Washington are all that interested in keeping this kind of republic. And so now we wait to see how cute the president tries to get. Getting cute. Two centuries of trade research have shown Adam Smith to have been correct when he declared, “Nothing, however, can be more absurd than this whole doctrine of the balance of trade.” Trump has evidently weighed this research and rejected it. And he’s already shown that he’s not inclined to wait for Congress to delegate tariff powers to him. Though the Supreme Court ruled that he could not use the  International Emergency Economic Powers Act of 1977 (IEEPA) to levy tariffs, there are other statutes that allow the president limited tariff authority. On Friday—mere hours after the court ruled—he signed an executive order imposing 10 percent tariffs on the entire world under Section 122 of the Trade Act of 1974. A few hours later he thought better of it and raised these rates to 15 percent. Section 122 allows him to impose across-the-board tariffs of up to 15 percent to address “balance of payments” issues. Never mind that the balance of payments deficit is currently zero. And never mind that these Section 122 powers were designed “to prevent an imminent and significant depreciation of the dollar in foreign exchange markets.” This is not about to happen. And, ironically, Trump has long sought depreciation of the dollar. These Section 122 tariffs, however, can only last 150 days. After that, he would need to turn to some other authority. Next, he might claim that Section 301 of the Trade Act of 1974 permits him to impose tariffs on any country that has engaged in “unreasonable” or “discriminatory” trade practices. What is an unreasonable or discriminatory trade practice? You might think it is a “practice,” an actual policy adopted by another government. But in Trump’s mind, it is unreasonable any time Americans choose to buy more from the citizens of another country than those citizens buy from us. That, after all, is how he arrived at a 46 percent “reciprocal tariff” on goods bought from Vietnam even though the Vietnamese government imposes only a 9.5 percent duty on goods bought from the US. In any case, a faithful reading of the statute would necessitate a careful and lengthy investigation by the U.S. trade representative before any tariff could be imposed. But Trump could get cute with that too, ordering an expedited and cursory analysis. We’ll have to see how far the courts let him get with that. Next, he might try to use Section 232 of the Trade Expansion Act of 1962 . This allows tariffs on goods that pose a threat to the national security of the United States, but requires a careful Commerce Department investigation into what constitutes a threat. Does Europe’s reluctance to hand over Greenland constitute a threat? Secretary Howard Lutnick’s Commerce Department may well see it that way. Don’t forget that last October, Trump imposed an additional 10 percent tariff on Canadian imports—citing IEEPA authority—because a Canadian premier had aired a commercial featuring Ronald Reagan saying some critical things about tariffs. Speaking of Greenland, Trump never bothered to cite any authority for his threatened tariffs against Denmark, Norway, Sweden, France, Germany, the U.K, the Netherlands, and Finland for their refusal to let him annex an ally’s territory. So, he may simply try to impose tariffs without any authority. Cute. The origins of an unbound presidency. What is wrong with cute? Why should we care? Our duly elected president seems to genuinely believe in tariffs. It may be the one position he has consistently held throughout his decades as a public figure. And voters overwhelmingly chose him in 2024. Don’t they deserve to see their democratically selected policies enacted? For decades now, there have been two unsatisfactory answers to these questions. The first, supplied by progressives operating in the tradition of Woodrow Wilson, is that cute is fine. Wilson thought that “[t]he makers of the Constitution constructed the federal government upon a theory of checks and balances ... but no government can be successfully conducted upon so mechanical a theory.” Rather than think of the government as a machine, he preferred to think of it as a living being , and “[n]o living thing can have its organs offset against each other, as checks, and live.” Wilson was motivated by an outsized view of his own intelligence. Five years before he ascended to the presidency, he wrote , “The President is at liberty, both in law and conscience, to be as big a man as he can. His capacity will set the limit.” If this sounds familiar, recall that Trump recently told the New York Times that his power is limited only by “My own morality. My own mind. It’s the only thing that can stop me.” But long before it captured Trump’s imagination, Wilson’s vision of an unbounded presidency stirred the imagination of the left. In an unprecedented exercise of power, Wilson issued more than 1,800 executive orders, nationalized railroads, and imposed price controls. He also segregated the federal labor force, suppressed free speech, and rounded up thousands of suspected socialists, but those achievements of the progressive era are less celebrated by today’s modern progressives. The unbounded presidency also inspired Franklin D. Roosevelt to close banks, to confiscate gold, and to intern Japanese Americans via executive order. It gave President Barack Obama, frustrated by Congress’ opposition to his agenda, the courage to declare in 2014: “I’ve got a pen, and I’ve got a phone.” And it gave President Joe Biden the notion that he could cancel up to $430 billion in debt owed to the American taxpayers without bothering to seek Congress’ approval. The Constitution, ineptly defended. The great 19 th -century French economist Frédéric Bastiat once warned that “the worst thing that can happen to a good cause is, not to be skillfully attacked, but to be ineptly defended.” Which brings us to the second answer to what’s wrong with cute. Each time a Democrat asserted unbounded presidential or governmental power, there was almost always a Republican there to counter it. Obama’s 2014 pen remarks were especially successful in rousing Republican ire. House Speaker John Boehner declared , “I would remind the president he also has a Constitution and an oath of office that he took” while Sen.Ted Cruz lectured : “‘I have a pen, and I have a phone,’ is not how laws are made under our Constitution. A strong president governs by consensus and persuasion, not with a pen and a phone. Americans deserve a President who will work in good faith with their elected representatives to follow the law of the land and to pass laws that reflect the will of the people.” These are stirring statements. But the Constitution would not be so ineptly defended if Republicans could muster the courage to repeat them today to their own man. To his credit, Cruz has often criticized the wisdom of Trump’s tariffs. But so far, he hasn’t brought himself to challenge the constitutionality of them. His newfound reticence is nothing compared to House Speaker Mike Johnson, however. In January, Johnson declared : “I have no intention of getting in the way of President Turmp and his administration. … He has used the tariff power that he has under Article II very effectively.” Huh? Which Article II power is he talking about? Does he think our keyboards lack a Ctrl-F? A better defense. It is clear now that many Republicans saw constitutional fealty as a nice talking point, a way to skewer Democrats for their unpatriotic rejection of the American founding. But it appears that some Republicans’ own constitutionalism runs about as deep as Trump’s understanding of economics. They favor the Constitution when it thwarts the Democrats. They favor it because it is old and vaguely patriotic. Its antique and loopy cursive make for a beautiful backdrop for a speech. Like the flag itself, it’s the kind of thing you can hug (awkwardly). But it isn’t the kind of thing you think about. But let’s think about it. Few people thought as clearly or as thoroughly about the wisdom of constitutions as the late political economist James Buchanan . When talking about constitutions, the 1986 Nobel laureate liked to invoke Ulysses tying himself to the mast. Ulysses didn’t tie himself to the mast because he wanted to embarrass the Trojans. Nor did he do it because he wanted to inspire his men or remind them of their patriotic forefathers. He did it for far more practical reasons. He knew that he would be tempted by the siren’s song. He knew he would go mad with lust, and he wanted to stop himself. And so it is with political power. Government is not, as former Rep. Barney Frank once naively put it, “the things we choose to do together.” We do all sorts of things together. We start businesses together. We play softball together. We fish, and we pray, and we get drunk at concerts together. But none of those things is government. When we form governments together, we assert the power to legitimately coerce our fellow citizens. No one can make you join the softball league. But government can make you pay your taxes, buy health insurance, or register for the draft. Try selling loose cigarettes on a Staten Island sidewalk and men with guns may stop you. Frank had it exactly backward. Government isn’t what we choose to do together. It’s what we say you don’t have a choice in. Like paying your taxes! Which brings us back to the Supreme Court’s decision. The framers understood that the power to tax is the power to destroy. And so they decided not to give that power to one man. After all, he might wake up one day and get offended by a TV commercial featuring a (more) popular Republican president. Or he might decide that a Swiss politician rubs him the wrong way. Those would be silly, arbitrary, and capricious reasons to coerce money from Americans. So, the framers wisely gave the power to tax to our Congress, imperfect as it may be. They made it difficult for Congress to exercise this power—requiring legislation to pass both houses and constituting each house differently—because they wanted to ensure that this power wasn’t abused. But the system works only if we take the Constitution and our commitment to republican government seriously. The Constitution is not, as progressives in the Wilsonian mold assert, an antiquated document. Nor is it, as some Republicans seem to think, a prop. We may yet keep our republic if we can resist the urge to get cute. Matthew Mitchell Matthew D. Mitchell is a senior fellow with the Fraser Institute, and an affiliated senior scholar with the Mercatus Center at George Mason University.",
    "url": "https://thedispatch.com/article/trump-tariffs-supreme-court-congress-constitution/",
    "publication_date": "Mon, 23 Feb 2026 01:04:33 +0000",
    "date_gathered": "2026-02-24T04:09:52.042187",
    "country": "US",
    "organization": "The Dispatch"
  },
  {
    "title": "The Monthly Mailbag With Ross Anderson",
    "content": "Ross Anderson / February 22, 2026 The Monthly Mailbag With Ross Anderson Our TMD editor answers your questions. General Photo via Ross Anderson. Photo via Ross Anderson. Audio Audio Turn any article into a podcast. Upgrade now to start listening. Text Size Premium Members can share articles with friends & family to bypass the paywall. Facebook Twitter LinkedIn Threads Email 0 Open and scroll to the comments section At the beginning of every month, a different Dispatch staffer fields questions from members and compiles his or her answers in a mailbag a few weeks later. This month, it was Morning Dispatch editor Ross Anderson’s turn. To ensure you’re able to submit questions for March’s Mailbag , click below to become a full Dispatch member. JOIN TODAY! At the beginning of every month, a different Dispatch staffer fields questions from members and compiles his or her answers in a mailbag a few weeks later. This month, it was Morning Dispatch editor Ross Anderson’s turn. Happy Sunday, and thanks to everyone for your great questions. Without further ado … From Richard Kennedy: What have been the reasons and impetus for having lived in almost every hemisphere in your lifetime? You’ve lived far and wide! I was born in Belfast to Northern Irish parents, and they didn’t want their kids growing up around the Troubles, or anything to do with it. But my mother doesn’t like guns, so America was out of the picture, and my father didn’t want to learn French, so I grew up in Australia. I lived in a small hippie town called Mullumbimby in Northern New South Wales, near Byron Bay, then moved to New Zealand as a teenager, came back to Europe for work and education, and moved to London because I wanted to. And I love it! From JohnM: How did you find this job? Or how did it find you? Have you met the bosses yet? Last year was one of the most tumultuous of my career, and in July, I’d basically settled on leaving journalism. I never planned on becoming a writer, and I stumbled into it from blogging as a hobby. I was proud of my work, and passionate about it, but I’d become sick of the instability of the industry, and a lot of the people in it. I’d settled on leaving it to work in tech—but left the door open if a job opened up at a very small list of publications that I loved. And then, one morning, my favorite morning newsletter advertised for a new editor; and within two weeks or so, I had signed on the proverbial dotted line to become its new editor . And yes, Steve and I chat fairly regularly about TMD, making sure that we’re always making it better, and I was actually supposed to grab coffee with Jonah last year as he passed through London, but we didn’t quite make it happen. From Denise Cote (and Mccumberrick ): Of all the places you’ve lived, which country is your favorite and why? From DaveW: What are the pluses and minuses of the varied places you’ve lived? I’m going to skip some smaller spots and give a biggest upside and biggest downside for various places I’ve lived : Australia (East Coast): The best parts: the scenery, beach-swimming, and the wildlife. The worst parts: the blistering heat in summer, the terrible housing market, and (in rural Australia) lack of opportunities to advance or get quality education. New Zealand (Auckland and Waiheke): The best parts: Auckland is basically a European city, but with lovely weather and idyllic scenery. The worst parts: obscenely expensive, particularly given the relative lack of employment opportunities. New Zealand also has a bad housing market, albeit not as disastrous as Australia. Ireland (Dublin): The best parts: It’s a really pretty city, with so much history, and some of the best cocktail bars and pubs in the world. Also, the Luas tram system is great. The worst parts: It’s small, with relatively little to do that you couldn’t experience in a long weekend trip, and you pay an extreme premium to live there compared to any other similar city. Scotland (Glasgow): The best parts: The people. Glaswegians have the best banter and conversations, and I miss them terribly. The worst parts: There are rough parts, and it is a small city. Within a few years, I felt like I’d seen every foot of it too many times over, and wanted more. England (London): The best parts: I live slightly out of the buzz of it all, in a pleasant leafy part, but within 45 minutes, I’m in the middle of one of the oldest, most diverse, bustling cities in the world. Every day, there’s something new to try, or somewhere you haven’t visited yet, and that’s just exciting. Also, so many areas feel utterly unlike any other part; it’s hard to believe that Battersea Power Station, Regent’s Park, Canary Wharf, and Soho are all in the same city. Also, I don’t feel like a stranger or foreigner here, in a way that I have everywhere else I’ve lived. The worst parts: The accommodation scarcity means that every apartment has a massive waiting list, and many are in terrible condition despite the capital-city prices. Also, the public transport infrastructure is great but poorly managed, to put it politely. From Sully: What’s the most underrated city for food, style, culture, etc ... based on extensive globetrotting? Find a random town at the top of a mountain in Sicily and order something simple with lots of wine on the side—it is the best food you will ever try. Also, I adore Las Vegas—it is among the greatest cities in the world. Americans don’t appreciate it enough. I wrote a long tribute to it in The Spectator if you’re interested. Style is a little tougher, because the internet has flattened fashion and you can find the same styles and niches everywhere. Parisians still have a casual understanding of good style, and the Japanese also dress well, as they generally have an excellent understanding of cut. For example, their coats stop closer to the ankle than just below the knee, which is the best length for a coat. I hope American and British brands soon realize this. From Florida Kitty: I’m a single, older woman and travel to Scotland and/or Ireland is on my bucket list. Not sure I can afford both, but will gladly appreciate your insight into cities/towns you think would be safe for an older woman traveling alone, full of history and architecture, beautiful scenery for medium hikes (relatively good health/fitness) and/or short day trips from a central location, and of course, local pubs/distilleries. My experience traveling is that, so long as you use common sense, most places are far safer than people assume. But, to answer the specific question at hand: I would default to recommending a Scotland trip! Start in Glasgow, and get the train up to Oban, where you can have the best fish and chips by the waterfront. Once you’re up there, there are so many staggeringly beautiful places to hike in the Highlands. You can also try any number of wonderful whisky distillery tours in Speyside, and travel back to Edinburgh, which is such a charming city, with so much history. Try a St. Mungo beer when you’re in Glasgow, a great peaty whisky when you’re north, and have Irn-Bru and Tunnock’s Teacakes on your travels. The Irish equivalent would be spending a few days in Dublin, checking out all the various historical spots before heading out to walk in beautiful Wicklow—but I think your dollar will stretch further, and give you a more memorable trip, in Scotland. From Ben Connelly: What have you learned about strength training that you wish you knew earlier? Also is this strength training to just stay in shape or is it for a sport (including powerlifting or bodybuilding)? Do you have a favorite lift/exercise and if so why? I’ve learned that being consistent is far more important and far more difficult than anything else. Just turning up every day for your routine sounds so easy, but you really do have to set up your life in such a way to make that possible. You should also always record your sets (it means you don’t have to count reps, and you can review your form better), and that having a great coach is so worth the money if you care about lifting (shoutout to Trevor). They can help you improve issues you have, program your mesocycles to develop your physique best, and just let you know when things are going well, even if you have doubts. I started training for the general health benefits, but now do so for bodybuilding! As for my favorite exercise, the incline dumbbell chest-supported row is just wonderful. But, to give some more exercises, and explanation: My favorite isolation exercises are those that hit my muscles in tough new ways I haven’t tried before. Namely, decline dumbbell flyes , lying bicep curls , dumbbell curl-to-press , and tough lateral raises (using the full vertical arc, then just to horizontal, then partial reps once you can’t do horizontal anymore either). My favorite compound movements are difficult to master and feel powerful to perform: barbell Romanian deadlift, barbell bent over rows, and, best of all, the bench press, which I do with a wide grip and full powerlifter’s back arch . It’s not unusual to love the bench press, but I think people miss how complex and difficult to master it is. From Derek M: What is the tech gadget you can’t live without? The devices I depend upon that most people don’t have are my Oura Ring 4 Ceramic and Logitech MX Master 4 mouse. If you want to track your steps, sleep, and general health patterns, nothing can beat an Oura Ring. And while the MX Master 4 is an expensive mouse, I have about 40 different shortcuts synced to it, which I use constantly throughout the day, and I would be dramatically less productive and less happy using a different mouse. It’s basically an extension of my hand at this point. From Whiskeyman: I’m curious about the tech worth buying versus not. … What is your No. 1 “you must buy this now” and your No. 1 “never buy this”? What tech upgrade will save me enough money that I should care? I think the product matters less than the person who’s buying it. Most people spend too much money to buy capacity they don’t actually value. If your photo gallery is mostly receipts and the occasional family snapshot, you don’t need an iPhone Pro; whereas, if you hike a lot or have long days out, then you should seriously consider phones with huge batteries, like the OnePlus 15 or Honor Power2, rather than just defaulting to a Samsung or iPhone. As a tech enthusiast, I’m happy to pay a premium for something fun —but most new devices aren’t. The iPhone 17 Pro is great, but it’s an iterative upgrade on the 16 Pro, 15 Pro, and 14 Pro. The devices I love are fun, unique ones, which usually sell poorly because they come with big, unappealing compromises. My daily phone is the iPhone Air, and I adore it because it’s so much lighter and thinner than anything else on the market—but it’s expensive, with a small battery and a single rear camera. The Sigma BF is my favorite camera—utterly gorgeous, with a cool, fast interface and incredible photos—but it’s outrageously expensive, and its minimal design means it lacks features you’d normally expect at that price. I love both because the compromises aren’t big deals for my lifestyle, and the benefits are huge. But that isn’t true for most shoppers. From Rob Hayes: Putting aside the idea of “men’s fashion essentials,” what items in your closet do you find yourself reaching for most often and why? I love fashion, and I love sneakers (I have a few hundred pairs), so I actually try to circle through my outfits a lot to force myself to wear more and feel different. But these are some of the items I’ve been wearing most over the past year or so: NN07 Gael Jacket in the black and gray check: beautifully made, extremely comfortable, and has the best pockets of any jacket. MKI Denim Jacket : I love denim jackets, and own far too many, but my favorite is this boxy one from MKI. You can never wear too much denim; I often wear this jacket with a denim shirt underneath, and jeans below. I even own a denim cowboy hat from a Levi’s Pride collection. Nomos Club Campus with the deep pink dial: a perfect little manual watch, from a factory I had the chance to visit. I buy watches to mark special anniversaries, and this marked my first full year in journalism. (Also, watches don’t need to be new or expensive or flashy to be cool; you just have to like them). Knitted beanies from my sibling: Buying beanies is a waste of money when you can make knitwear of higher quality for much less money by knitting them yourself. Or, in my case, by paying my sibling to make them for me. I have a stack of beanies in all sorts of colors and styles and I love them. Photo via Ross Anderson. From Howmanydiscs: How many belts does a man need? One black, one brown, and that’s it? I bought a solid blue belt a few years ago from Orvis and have been surprised by how often I wear it. And yet my black belt from Orvis, with a gold/yellow stitch, is surprisingly difficult to match. Maybe that’s because I struggle with how to match belts. I should know this, but do you match them to one’s socks? Shoes? Shirt/pants? I’m 55 years old and really need to figure this out! For putting together a great outfit, you generally want to set a base dark tone, which you build up from. That is usually either black or brown (or navy), and it can be set with a signature item—such as a jacket or coat—or with your shoes and belt. Once you have a base tone picked out and set, you can build a look from there; neutrals generally go well with black, colder tones fit navy, and warmer, creamier colors sit well with brown. The important part here is that this base tone is cohesive—you don’t want to wear a black jacket, with a blue belt, and brown shoes. If you want simple starting part, it’s hard to go wrong with: Black belt + black shoes + silver hardware + white shirt Brown belt + brown shoes + gold hardware + cream shirt You don’t need both gold and silver hardware options—most of my stuff is silver, as the gray suits my skin tone better—but if you’re just looking to buy belts, a plain black leather belt and a plain brown leather belt are usually enough for a great wardrobe. But once you understand the principles, go wild! Your blue belt probably sits great with the mid-tones of your outfits, and you set the dark tones with other elements of your look. Fantastic! You can even put black and brown together. I usually wear my dark brown leather jacket with black trousers, black boots, and a white t-shirt. From Richard Kennedy: I really enjoy distilled spirits for the particular spirit’s sake. ... What is the advantage of mixing/diluting these spirits with other stuff for cocktails, particularly the better brands of these spirits? I don’t mean an insult here. I love spirits too! For what it’s worth, Yellow Spot is probably my favorite Irish whiskey—though Method & Madness is very nice too—and Bruichladdich is my favorite Scotch. The answer is that they’re two different disciplines. Making cocktails is like cooking a dish, where you combine ingredients and techniques to get textures, flavors, colors, and experiences that you can’t with a single element. Meanwhile, sipping a great spirit is like trying a great black coffee, appreciating the subtleties of a pure thing. That also means that you shouldn’t use extremely refined spirits in cocktails. You want to use good spirits (I would rather use Chopin or Belvedere instead of Absolut or Smirnoff), but there’s a certain threshold where the nuances of quality spirits get washed out by other ingredients. Just as you wouldn’t make a caramel frappuccino with geisha beans, I would never make a margarita with Clase Azul. From Phillyex1: Favorite cocktail to make and also favorite cocktail to drink—with recipes, please. From SanM: What’s your favorite cocktail to drink, and what was (is) your favorite to make? Or are they the same? Also, not a question but I’m sure you have tons of stories from your bartending days, please feel free to share one. I think my favorites to make are cocktails that people usually have in a cheap, bad way, but done right. Long Island Iced Tea is a wonderful drink when made well, as are margaritas. Also, my chili-and-dark-chocolate margarita is phenomenal. I also really enjoy making espresso martinis, always with freshly brewed espresso, Mr. Black cold brew coffee liqueur, and a nice vodka. I don’t drink much anymore—for sleep and dieting, I mostly drink non-alcoholic Guinness and Lucky Saint —so when I do, I like to have something creative or novel, ordering whatever the cocktail special is, or asking the bartender to make something they like. Also, the strangest drink order I ever received was for a “non-alcoholic decaf Irish Coffee with oatmilk instead of cream.” The customer ordered it with a straight face, and it took me a solid 10 seconds to wrap my head around it. From Launerjennifer: I’d love to know about Teddy! Photo via Ross Anderson. Here is young Teddles, he’s a 2-year-old black mixed breed, and he’s the most lovely, handsome, wonderful cat. He’s not a lap cat, but he’s super affectionate, purring a lot, sitting on or beside my keyboard while I’m editing TMD , and generally bringing me an endless amount of joy. I’ve always been a dog person, but I adore my fluffy feline son. Pet’s Likes: Food; watching films, TV, and my video games; chirping at the local birds; flooping onto my keyboard while I’m trying to edit TMD in order to get cuddles. He also likes walking along the edge of the bath, for some reason. Pet’s Dislikes : Loud drumming outdoors. Being fed even slightly late, or just not early. Thanks for reading this month’s Mailbag ! Keep an eye out for next month’s introductory post, where you’ll be able to ask questions of … visuals editor Noah Hickey . Thanks for reading this month’s Mailbag ! To ensure you’re able to ask questions of visuals editor Noah Hickey next month, become a member today. Ross Anderson Ross Anderson is the Editor of The Morning Dispatch, based in London. Prior to joining the company in 2025, he was an editor at The Spectator, columnist at The New York Sun, and a Tablet fellow. When Ross isn’t working on TMD, he’s probably trying out new tech, lifting weights, or hanging out with his cat, Teddy.",
    "url": "https://thedispatch.com/article/mailbag-answers-ross-anderson/",
    "publication_date": "Sun, 22 Feb 2026 16:30:00 +0000",
    "date_gathered": "2026-02-24T04:09:52.790730",
    "country": "US",
    "organization": "The Dispatch"
  },
  {
    "title": "Lent Reminds Us That a Penitent Imagination Can Counter Evil",
    "content": "Dispatch Faith Lent Reminds Us That a Penitent Imagination Can Counter Evil What’s happening right now is unimaginable, and that’s a problem. Michael Reneau & Hannah Anderson / February 22, 2026 Audio Audio Turn any article into a podcast. Upgrade now to start listening. Text Size Premium Members can share articles with friends & family to bypass the paywall. Facebook Twitter LinkedIn Threads Email 0 Open and scroll to the comments section You’re reading Dispatch Faith , our weekly newsletter exploring the biggest stories in religion and faith. To unlock all of our stories, podcasts, and community benefits—as well as our newest feature, Dispatch Voiced , which allows you to listen to our written stories in your own podcast feed— join The Dispatch as a paying member . We’re hitting the road and heading to Dallas, Texas, for Dispatch Energy: The Current State , a symposium focused on the future of energy innovation. You can catch Jonah Goldberg, Steve Hayes, Kevin D. Williamson, and more of your favorite Dispatch authors as we bring our Dispatch Energy newsletter to life. Tickets are available here —but hurry, they’re almost sold out. Hi and happy Sunday. It’s become commonplace—at least for me—to question how Americans of different political, ideological, or religious points of view seem to interpret the same basic sets of facts so wildly differently from one another. One of my children recently told me about a classmate who said January 6 was both peaceful and good for the country. Competing narratives—call it “spin”—will always be a facet of free societies. But how did we come to a moment in which facts themselves seem to be as up for debate as what those facts mean? In this week’s Dispatch Faith essay, Dispatch Contributing Writer Hannah Anderson contends that what we suffer from is a failure of imagination. Though that phrase often connotes a failure to see the world better than its current state, Anderson points out that Lent might teach us that we’re fighting over facts because we’re failing to view certain situations as being dire as they really are. A Failure of Imagination Illustration by Noah Hickey/The Dispatch (Photos via Unsplash). By HANNAH ANDERSON These days, reacting to the events around us is like a continual Rorschach test. Someone posts a video on social media, and one person will see a virtuous display of patriotism while another will see the fall of democracy. I’ve always understood these differences as political tribalism and garden-variety confirmation bias but lately, I’m beginning to wonder whether they’re something more. I wonder if we’re actually facing a failure of imagination. When I use the language of imagination, I don’t mean a flight of fancy or escape from reality. I’m thinking of our ability to conceive of a reality beyond the one being currently delivered to us. It’s the distinction that 19 th -century author (and scientist) George MacDonald articulated when considering how a person could discover something new, how a person could “be carried beyond himself and the regions of his knowledge.” The answer for MacDonald was that things “must be foreseen ere they can be realized—apprehended ere they be comprehended.” Stories We Think You’ll Like Why New Atheism Crumbled Nick Pompella / February 16, 2026 And will the same thing happen to today’s ‘religious revival’? On ‘White Culture’ Jonah Goldberg / February 18, 2026 The latest poisonous example of horseshoe theory. The Lives That Bought the West Jonny Gartner / February 18, 2026 We cannot forget the sacrifices that gave the rules-based order its moral purpose. In 17 th -century Florence, as Europe sat at a crossroads of profound societal, theological, and even cosmological change, Galileo Galilei and other astronomers turned their telescopes to the moon. But Galileo had an advantage on them. He had been trained in perspective drawing so when he saw shadows on the moon, he saw what others couldn’t: mountains. The telescope was not yet powerful enough to provide unassailable visual proof but his mind’s eye could conceive of their possibility —and from there, he could work to prove their existence. Kerry Magruder , curator and chair of the History of Science Collections at the University of Oklahoma, calls this approach “imaginative realism.” He likens it to how “a man crossing a swollen river relies both on his feet and upon his staff as he extends it out to feel for the next stepping stone.” Rather than a reductionism that is satisfied with simply collecting, curating, and debating facts, imaginative realism calls reason and imagination to partner together to reveal the true nature of reality. Our ability to engage the current moment depends in large part on employing a similar imaginative realism. Not only do we select and curate the data points that serve our personal biases, we no longer even agree on what constitutes a fact. In such a post-factual culture, the question shifts away from what facts we can comprehend to what we can apprehend—what we can imagine to be possible. Right now, we’re forced to consider: Is it possible that the allegations of the Epstein files  actually are  worthy of investigation and prosecution ? Is it possible that married women’s ability to vote could actually be threatened ? Is it possible that history did warn us and that we are repeating its inhumanity by locking our neighbors in camps ? Is it possible that the Christian doctrine of human depravity is true? Those who have experienced such evil firsthand would be quick to say “yes” because they have had their imaginations fundamentally altered by it. They know in a way that the rest of us don’t. So when they warn us about conditions in detention centers or the reality of childhood sexual abuse , they are speaking to our imagination, not just our reason. In this way, “believing survivors” does not mean accepting everything as uncontested fact, but it does mean opening ourselves to the reality that their witness is true. We must take their claims seriously enough to give them a hearing through formal channels of justice, honestly investigate them, and bring charges against the accused should the evidence warrant—no matter who it might implicate. But such warnings are so chilling—so grief-inducing—that often we shut down in the face of them. We struggle to wrap our mind around that kind of evil, so we often just don’t. During COVID, psychologists and scientists warned that as the death toll rose, we would actually become detached from it because our minds could not comprehend the reality of such large, abstract numbers . We may have a vague, impending sense of 1 million deaths, but we’re more emotionally and psychologically affected by 12 discrete deaths that we can attach to particular names and stories. We live in a similar moment politically. In the realities that many people inhabit, it is unimaginable that the United States might already be functioning as a totalitarian state. It is unimaginable that underage girls were abused and trafficked through an elite, global syndicate—and that the man occupying the White House was in the thick of it. It is unimaginable that checks and balances have collapsed so far that Congress would be unlikely to consider impeachment, his involvement. But to riff off Flannery O’Connor, “ The truth does not change according to our ability to imagine it .” On Wednesday the Christian season of Lent began. These six weeks before Easter call the faithful to humility and repentance, “to remember that we are but dust.” And yet, Lenten remembrance is not simply a factual accounting of all the wrongs that we have done; it is also a call to imagine the ways we could have erred without knowing it—that we sin, as the General Confession of the Book of Common Prayer originally put  it, both “by what we have done and by what we have left undone.” This simple act of penitent imagination, of naming possibility, can break the grip of evil because it undermines its ability to hide in plain sight. Political theorist Hannah Arendt famously spoke of the “ banality of evil ,” But as Arendt understands it, the danger of evil is not simply that it is mundane but that it is: ‘thought-defying’… because thought tries to reach some depth, to go to the roots, and the moment it concerns itself with evil, it is frustrated because there is nothing. That is its ‘banality.’ Only the good has depth that can be radical. Put more simply, evil is both more pervasive and more boring than we imagine. And it feeds on our obliviousness. Imagination, then, may be one of the greatest forms of dissent in that it helps us see the possibilities of evil and unmask them. Imagination also allows us to enter into the plight of our neighbors who suffer under its brutality. And perhaps more than anything, imagination lets us conceive of a reality beyond the one we currently inhabit, showing us that things don’t have to be the way they are. If the world order as we know it is collapsing , as some say, we must find a way to imagine that possibility. But we must also find a way to imagine the radical possibilities of goodness and the world that we want to make on the other side. This will require us to exercise the vision of those who “ have a dream .” It will also require that we pray that God’s kingdom come and confess all the ways we resist earth being made as heaven. By this act of imaginative realism, we  begin  in some small way,  to apprehend its quiet, pervasive existence among us. Training our mind’s eye to see the Kingdom of God, we become people who can interpret its faint shadow as a magnificent mountain. To that end, I’ll leave you with a benediction that a friend of mine prays over her congregation: Friends, go now in peace. Imagine all that can be. Hope more than it makes sense to do so. Honor all and love all. Have courage. Know that this life of faith is risky, but you do not go it alone So get on with loving and serving the Lord. The grace of our God goes with you, this and every day. Amen. Elsewhere Illustration by Noah Hickey/The Dispatch (Photos via Getty Images). Two decades ago it seemed that organized religion was on the decline, and leading the charge against it were the Four Horsemen of New Atheism: Christopher Hitchens, Richard Dawkins, Sam Harris, and Daniel Dennett. But now—even as we know gauging what people believe is usually more nuanced than simple survey questions—we remember New Atheism is a cultural flash in the pan. Why? In this week’s Monday Essay , Nick Pompella talked to thinkers like Zachary Davis of the nonprofit Faith Matters (and a former New Atheist) to examine why New Atheism faded so quickly, and whether today’s religious believers should heed some lessons therein. For my part, my return to religion is totally mundane. At some point in college, I realized that one could construct an entirely rational view of the universe that still had God at the center; for now, it is the only way to answer the question “Why is there something rather than nothing?” that doesn’t resort to pseudoscientific babble like the multiverse theory . The Christian interpretation also didn’t summon up the immense anger that New Atheism seemed to use as its main fuel. Why did religion make Christopher Hitchens so heated? These supposed titans of capital-L Logic got moody, snide, and annoyed whenever they made their arguments about religion. Why do I feel like the level-headed one now, when I’m on the side of the supposed “ sky daddy ” worshippers? The closest thing to a resolution I have come to is that, basically, Davis is right. New Atheism was a kind of emotionally motivated rage against the idea of living in a world where one’s behavior was not fully liberated from all that came before us. If we’re enlightened denizens of the 21st century, it should be up to us to decide everything about our lives. Inheriting the family religion and all of its attendant communal duties cuts against all of that. There was a desire in New Atheism to insist upon the blank slate model of human behavior—that we get to make every single choice on our own from the word “go.” A lot of New Atheism began from this place of indignation, and then engaged in mental gymnastics to rationalize that feeling. The more conciliatory tone of the surviving crop of atheist influencers, and their openness to spirituality, seems to indicate that this was a losing strategy in the long term. I for one certainly grew out of it; “when I became a man, I put away childish things,” and all that. Kirk is doubtful that another push by secular-minded people will take the shape or size of New Atheism again. “It’s possible,” he told me. “But let’s remember that New Atheism was likely a response to 9/11.” In fact, Sam Harris’ first book, The End of Faith , was written explicitly because of 9/11. This was a no-holds-barred critique of all religious belief, which Harris said was originally “a long essay … produced in those first weeks of collective grief and stupefaction” following September 11, 2001. Read the whole thing . More Sunday Reads For The Pillar , Michelle La Rosa reports on the Dorothea Project , a network of local groups teaching and promoting Catholic social teaching. She talked to women like Alison McGrimley, who were alarmed at the treatment of immigrants. “She believes many Catholics have not learned the principles of the Church’s social teaching. Since so much information is presented through a political lens, that becomes the default way in which people – including Catholics – think about social issues, she said. ‘There becomes the “conservative Catholic” view and the “liberal Catholic” view. And there’s not really a Catholic view anymore. It’s very hard to parse out…how should I view this issue through my Catholic faith?’ McGrimley said she thinks much of the focus of Catholic action in the public sphere has been centered on abortion. While she believes it is right that abortion takes precedence as an issue of focus, she also thinks that ‘it’s sort of become this issue that overrides everything else and causes people to only look at that issue when they’re forming their conscience about how to take action on things.’ In her view, there are similarities in how rhetoric surrounding immigration and abortion both ignore human dignity. ‘It hurts my heart when I hear pro-choice activists refer to a baby as a “fetus”. And I think that’s intentional because it dehumanizes that baby. And in the same way we’re seeing that happen with immigrants, calling them “illegals,” calling them “aliens,” that really dehumanizes them,’ she said.” Religion in an Image A woman receives the sign of the cross in ashes on her forehead from a priest during Ash Wednesday services at El Calvario parish in San Salvador, El Salvador, on February 18, 2026. Ash Wednesday marks the beginning of the Christian period of Lent. (Photo by Marvin Recinos / AFP via Getty Images) Michael Reneau Michael Reneau is a managing editor at The Dispatch and is based in Greeneville, Tennessee. Prior to joining the company in 2022, he was editor of WORLD Magazine and for several years was editor of a daily newspaper in East Tennessee. When Michael isn’t editing, he stays plenty busy with his wife and four kids. Hannah Anderson Hannah Anderson lives with her family in the Blue Ridge Mountains of Virginia. Her works include \"All That's Good\" and \"Heaven and Nature Sing: 25 Advent Reflections to Bring Joy to the World.\" You find more of her writing at sometimesalight.com. Newsletter selected Click sign up to start receiving your newsletters. Sign up Submitting...",
    "url": "https://thedispatch.com/newsletter/dispatch-faith/lent-christianity-ash-wednesday/",
    "publication_date": "Sun, 22 Feb 2026 12:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:53.676954",
    "country": "US",
    "organization": "The Dispatch"
  }
]