[
  {
    "title": "Do solar panels work in cold or cloudy climates?",
    "content": "<figure><img alt=\"\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"535\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2024/04/Skeptical-Science.png?fit=1024%2C535&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> &lt; 1</span> <span class=\"rt-label rt-postfix\">minute</span></span>\n<div class=\"fact-brief-embed\">\n    \n    <h3 class=\"fact-brief-status\">YES</h3>\n\n            <div class=\"fact-brief-content\">\n            <p>Solar panels still generate electricity on cloudy days and in cold weather, albeit less.</p>\n<p>Clouds cut output as less sunlight reaches the panels, but they continue producing power from indirect light. Snow cover can temporarily block light, though it is typically not obstructed by thin layers of snow. Additionally, most solar panels in the U.S. run more efficiently in cooler weather, as heat lowers performance.</p>\n<p>Winter generation can be lower due to shorter days, notably at middle latitudes; cities like Denver receive nearly three times more solar energy in June than December. This mainly affects what share of a home’s electricity solar covers, especially where heating raises demand. Average winter electricity use of U.S. homes is estimated to be six times that of summer use.&nbsp;</p>\n<p>Despite seasonal dips, solar still displaces fossil fuel electricity over the year, delivering large net emissions reductions across a panel’s multi-decade lifespan.</p>\n        </div>\n    \n    \n            <div class=\"fact-brief-longform-article\">\n            <a href=\"https://skepticalscience.com/do-solar-panels-work-in-cold-or-cloudy-climates.htm\" rel=\"noopener noreferrer\" target=\"_blank\">See a full discussion of this at Gigafact.org</a>\n        </div>\n    \n            <div class=\"fact-brief-original-claim\">\n            <p>This fact brief is responsive to conversations such as <a href=\"https://perma.cc/KJ8T-RWWW\" rel=\"noopener noreferrer\" target=\"_blank\">this one</a>.</p>\n        </div>\n    \n            <div class=\"fact-brief-sources\">\n            <h3>Sources</h3>\n            <ul><li>Renewable Energy Journal <a href=\"https://doi.org/10.1016/j.renene.2016.07.063\" target=\"_blank\">On the investigation of photovoltaic output power reduction due to dust accumulation and weather conditions</a></li><li>Renewable Energy Journal <a href=\"https://doi.org/10.1016/j.renene.2011.11.046\" target=\"_blank\">Temperature and thermal annealing effects on different photovoltaic technologies</a></li><li>ACS Omega Journal <a href=\"https://doi.org/10.1021/acsomega.3c06442\" target=\"_blank\">Comprehensive Analysis of Solar Panel Performance and Correlations with Meteorological ParametersC</a></li><li>SEIA <a href=\"https://seia.org/what-happens-to-solar-panels-when-its-cloudy-or-raining/\" target=\"_blank\">What happens to solar panels when it’s cloudy or raining?</a></li><li>US Department of Energy <a href=\"https://perma.cc/8XYH-TP72\" target=\"_blank\">Solar Photovoltaics Supply Chain Deep Dive Assessment</a></li><li>US Department of Energy <a href=\"https://perma.cc/332L-WC5K\" target=\"_blank\">Let it Snow: How Solar Panels Can Thrive in Winter Weather</a></li><li>Columbia Law School Sabin Center for Climate Change Law <a href=\"https://scholarship.law.columbia.edu/sabin_climate_change/217/\" target=\"_blank\">Rebutting 33 False Claims About Solar, Wind, and Electric Vehicles</a></li></ul>        </div>\n        <hr />\n    <div class=\"fact-brief-org\">\n        This fact brief was originally published by <a href=\"https://gigafact.org/fact-briefs/do-solar-panels-work-in-cold-or-cloudy-climates/\" rel=\"noopener noreferrer\" target=\"_blank\">Skeptical Science</a> on February 19, 2026, and was authored by Sue Bin Park. Skeptical Science is a member of the <a href=\"https://gigafact.org\">Gigafact</a> network.    </div>\n</div>\n<p><a href=\"https://wisconsinwatch.org/2026/02/solar-panels-cold-cloudy-climate-energy-electricity-sun-weather/\">Do solar panels work in cold or cloudy climates?</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/solar-panels-cold-cloudy-climate-energy-electricity-sun-weather/",
    "publication_date": "Mon, 23 Feb 2026 18:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:57.060532",
    "country": "US",
    "organization": "Wisconsin Watch"
  },
  {
    "title": "Republicans are looking past the short-term pain of Trump’s tariffs",
    "content": "<figure><img alt=\"A red International tractor pulls green farm equipment across a field, with trees in the background and a person visible holding a steering wheel inside the tractor.\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"683\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse20250916-David-Hardtke-Kewaunee-Timmerman-007-scaled.jpg?fit=1024%2C683&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> 3</span> <span class=\"rt-label rt-postfix\">minutes</span></span>\n<p>Republican lawmakers have heard farmers’ concerns about President Donald Trump’s tariff agenda. Their response? Short-term pain, long-term gain.</p>\n\n\n\n<p>Farmers faced a shrunken export market and operating costs after Trump enforced steep tariffs on key trading partners and farm materials last year. In response, the Trump administration will begin disbursing a <a href=\"https://www.usda.gov/about-usda/news/press-releases/2025/12/08/trump-administration-announces-12-billion-farmer-bridge-payments-american-farmers-impacted-unfair\">$12 billion bailout</a> to farmers due to “unfair market disruptions” at the end of this month.</p>\n\n\n\n<p>Republican lawmakers from Wisconsin, a major agricultural producer, acknowledge the 2025 to 2026 crop season challenges, which resulted in an estimated $34.6 billion in losses for the industry, according to the American Farm Bureau Federation. But they’re arguing that the success of specialty crops and rosier-than-expected economic indicators are evidence farmers can withstand any turmoil the tariffs have caused.</p>\n\n\n\n<p>“Our farmers understand that we have to level the playing field. And how do you do that? You do that with these tariffs,” U.S. Rep. Derrick Van Orden said. “In order to get to the long term, you have to get through the short term, and that’s the reason that this money’s going back to people in the agriculture industry.”</p>\n\n\n\n<p>A bipartisan group of agricultural experts said the Trump administration’s policies have “significantly damaged” the American farm economy in <a href=\"https://static01.nyt.com/newsgraphics/documenttools/acb735649572767d/01cc68db-full.pdf\">a letter</a> to Senate Agriculture Committee leadership this month, as first reported by The New York Times.</p>\n\n\n\n<p>“It is clear that the current Administration’s actions, along with Congressional inaction, have increased costs for farm inputs, disrupted overseas and domestic markets, denied agriculture its reliable labor pool, and defunded critical ag research and staffing,” they wrote.</p>\n\n\n\n<p>Wisconsin agriculture experts told NOTUS the administration’s bailout is undesirable and insufficient to cover many farmers’ lost revenue this year.</p>\n\n\n\n<p>“They don’t solve the long-run problem of higher input costs and low prices; they are a Band-Aid to get us through this short-term problem,” said Paul Mitchell, the director of the Renk Agribusiness Institute at the University of Wisconsin-Madison.</p>\n\n\n\n<p>Agriculture professor and economist Steven Deller, also of the University of Wisconsin-Madison, had a similar view.</p>\n\n\n\n<p>“We’re hemorrhaging thousands and thousands and thousands of dollars, and they’re giving us pennies,” Deller said, adding that farmers want “fair markets” and a “level playing field.”</p>\n\n\n\n\n\n<p>Republicans in the state, however, are standing behind the president’s agenda, pointing to the administration’s stated goal to boost the manufacturing industry through baseline tariff rates for all countries, reciprocal tariffs and tariffs on goods from Canada and Mexico.</p>\n\n\n\n<p>“Wisconsin, at the end of the day, is going to benefit as we bring manufacturing back to the state,” said U.S. Rep. Tom Tiffany, the likely GOP nominee for governor.</p>\n\n\n\n<p>He blamed the North American Free Trade Agreement for sending manufacturing companies packing for cheaper operations in China. Trump replaced NAFTA during his first term in office with the United States-Mexico-Canada Agreement — a deal Tiffany applauded.</p>\n\n\n\n<p>Trump administration officials have defended tariffs in cable television appearances and in congressional hearings as key to transforming the American economy, even as some agricultural industries languish. At a Senate Banking Committee hearing earlier this month, Democratic Sen. Tina Smith of Minnesota pressed Treasury Secretary Scott Bessent on whether instability in the agricultural markets is a result of Trump’s tariff policies.</p>\n\n\n\n<p>“It has nothing to do with the tariffs,” Bessent said.</p>\n\n\n\n<p>Still, there are some signs the administration could be responsive to the backlash. The Trump administration is planning to roll back tariffs on some steel and aluminum goods due to concerns the tariffs are hurting consumers, the <a href=\"https://www.ft.com/content/f2eff736-12de-4c33-9826-847d2fdf8be3\">Financial Times</a> reported.</p>\n\n\n\n<p>The soybean industry is one of the hardest hit by tariffs, which temporarily cost farmers the U.S.’ largest soybean trading partner, China. Although China fulfilled its initial purchase agreement last month and has agreed to purchase tens of millions more metric tons over the next few years, American soybean producers withstood an unprecedented <a href=\"https://www.forbes.com/sites/kenroberts/2026/01/17/china-purchased-no-us-soybeans-an-unprecented-sixth-straight-month/\">five consecutive months</a> without purchases by China.</p>\n\n\n\n<p><em>This story was produced and originally published by Wisconsin Watch and </em><a href=\"https://www.notus.org/\"><em>NOTUS</em></a><em>, a publication from the nonprofit, nonpartisan </em><a href=\"https://aji.org/\"><em>Allbritton Journalism Institute</em></a><em>.</em></p>\n<p><a href=\"https://wisconsinwatch.org/2026/02/wisconsin-republican-trump-tariffs-agriculture-farmers-van-orden-tiffany/\">Republicans are looking past the short-term pain of Trump’s tariffs</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/wisconsin-republican-trump-tariffs-agriculture-farmers-van-orden-tiffany/",
    "publication_date": "Mon, 23 Feb 2026 12:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:57.060543",
    "country": "US",
    "organization": "Wisconsin Watch"
  },
  {
    "title": "Wisconsin Assembly is done legislating for the year. Here’s what lawmakers did and what’s unfinished.",
    "content": "<figure><img alt=\"A wide view of a legislative chamber shows people seated at desks facing a person at a podium beneath a large mural, with flags behind the podium and electronic voting boards on the walls.\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"683\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse20260217-State-of-the-State-Timmerman-008-scaled.jpg?fit=1024%2C683&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> 8</span> <span class=\"rt-label rt-postfix\">minutes</span></span>\n<p>The final days of the Wisconsin Legislature’s 2025-26 legislative session are near.</p>\n\n\n\n<p>The Assembly gaveled out for what could be the chamber’s final session day Friday preceded by a dramatic 24 hours that included longtime Assembly Speaker Robin Vos, R-Rochester, <a href=\"https://wisconsinwatch.org/2026/02/wisconsin-vos-republican-assembly-speaker-leaving-office-evers-democrat-trump-retire/\">announcing his retirement </a>and a concession from Vos to allow votes on bills to extend Medicaid funding for low-income mothers and require insurance companies to cover screenings for women at increased risk of breast cancer. The bills have stalled in the chamber for months.&nbsp;</p>\n\n\n\n<p>Lawmakers could still return for a special session on tax cuts as negotiations continue with Republican leaders and Gov. Tony Evers. Democratic lawmakers and Evers have called on Republicans to continue work at the Capitol in Madison instead of turning to the campaign trail ahead of elections later this year. Evers this week also said he plans to call <a href=\"https://content.govdelivery.com/accounts/WIGOV/bulletins/40a4789\">a special session</a> in the coming months for lawmakers to act on a constitutional amendment to ban partisan gerrymandering.&nbsp;&nbsp;</p>\n\n\n\n<p>The Senate will continue to meet in March.&nbsp;</p>\n\n\n\n<p>Here’s a rundown of what is still being debated, what is heading to the governor and some of the key items to get signed into law this session.&nbsp;</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is still being discussed?&nbsp;</strong></h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Tax cuts&nbsp;</strong></h3>\n\n\n\n<p><strong>The context:</strong> State leaders learned in January that Wisconsin has <a href=\"https://docs.legis.wisconsin.gov/misc/lfb/revenue_estimates/191_january_15_2026.pdf\">a projected $2.4 billion surplus</a>. Evers at the start of the year called for bipartisan action on property tax cuts for Wisconsinites. Republicans have agreed with the idea that those funds should be returned to taxpayers. But both sides have yet to officially agree on how.&nbsp;</p>\n\n\n\n<p><strong>Republican arguments:</strong> In a letter to Evers on Feb. 16, Vos and Senate Majority Leader Devin LeMahieu, R-Oostburg, said they would agree to Evers’ request for $200 million to boost the special education reimbursement rate and provide an additional $500 million to schools through the school levy tax credit. In return, Republican leaders wanted to see an income tax rebate in the form of $500 for individuals and $1,000 for married couples who filed their taxes in 2024, reducing state revenues by $1.5 billion. “We are trying to be bipartisan,” Vos told reporters after Evers said the proposal doesn’t balance what he wants to see for schools. “We accepted his number and actually went higher than he requested.”</p>\n\n\n\n<p><strong>Democratic arguments:</strong> Evers <a href=\"https://x.com/mattsmith_news/status/2024155460413042955\">told WISN-12</a> that he would not sign the Republican plan Vos and LeMahieu sent him. He wants to see more money for schools, specifically general equalization aid, which are dollars that schools can use without as many constraints. The 2025-27 budget Evers signed last summer kept that aid flat from the previous year, which coupled with fixed revenue limit increases under Evers’ previous 400-year veto gives school districts more latitude to raise property taxes.&nbsp;</p>\n\n\n\n<p><strong>Latest action:</strong> Assembly Majority Leader Rep. Tyler August, R-Walworth, said Republicans are still intent that Evers should take the deal that was offered. “It checks a lot of boxes, if not all the boxes on the things he had previously asked for,” he said.&nbsp;</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img alt=\"A person wearing a suit and a tie is surrounded by other people who are holding microphones iand cellphones n a wood-paneled room, with an American flag visible behind them.\" class=\"wp-image-1314502\" height=\"520\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse20260217-State-of-the-State-Timmerman-016.jpg?resize=780%2C520&#038;quality=100&#038;ssl=1\" width=\"780\" /><figcaption class=\"wp-element-caption\">Wisconsin Assembly Speaker Robin Vos, R-Rochester, takes questions from the press after Gov. Tony Evers&#8217; State of the State address at the Wisconsin State Capitol on Tuesday, Feb. 17, 2026, in Madison, Wis. (Joe Timmerman / Wisconsin Watch)</figcaption></figure>\n</div>\n\n\n<h3 class=\"wp-block-heading\"><strong>Knowles-Nelson Stewardship </strong>&nbsp;</h3>\n\n\n\n<p><strong>The context:</strong> In 2024, the Wisconsin Supreme Court ruled the Legislature’s top financial committee could not block the Department of Natural Resources spending for the <a href=\"https://dnr.wisconsin.gov/topic/Stewardship\">Knowles-Nelson Stewardship Fund</a> that was created in 1989 for land preservation. Republicans did not reauthorize funds to keep the program going in the 2025-27 budget, which puts the fund on track to expire this summer. Bills led by Rep. Tony Kurtz, R-Wonewoc, and Sen. Patrick Testin, R-Stevens Point, would extend the program until 2028, but also pause the majority of land conservation projects for two years and require the DNR to study and inventory government-owned land for nature activities.</p>\n\n\n\n\n\n<p><strong>Republican arguments:</strong> Republicans blame the court’s decision for limiting legislative authority over how the dollars are spent. During a public hearing earlier this month, Testin said he understood the bills were imperfect but action was necessary. “If we do nothing, Knowles-Nelson Stewardship is dead,” Testin said.&nbsp;</p>\n\n\n\n<p><strong>Democratic arguments:</strong> Senate Democrats on Wednesday said stopping money for land conservation projects would essentially kill the program. Democrats had been participating in negotiations on the future of the fund, but the Republican proposal had only gotten “significantly worse.” “We cannot and will not support a bill this bad,” said Senate Minority Leader Dianne Hesselbein, D-Middleton. In September, Democrats introduced a proposal to reauthorize the program until 2032.&nbsp;</p>\n\n\n\n<p><strong>Latest action:</strong> The Senate was scheduled to vote on the bills during a floor session on Feb. 18, but removed the bills from its calendar. The bills already passed the Assembly in January. After Senate Democrats said they would not support the current proposal, Testin <a href=\"https://x.com/jrrosswrites/status/2024179894163218913\">told WisPolitics</a> he would have to drum up support from Senate Republicans to determine the fate of the fund.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Toxic forever chemicals (aka PFAS)&nbsp;</strong></h3>\n\n\n\n<p><strong>The context:</strong> Republican lawmakers and Evers in January announced <a href=\"https://content.govdelivery.com/accounts/WIGOV/bulletins/4055b1a\">they were optimistic about a deal on legislation</a> about the cleanup of toxic forever chemicals referred to as PFAS. The 2023-25 state budget included $125 million for addressing PFAS contamination, but the Legislature’s finance committee has yet to release those funds to the Department of Natural Resources. In January, Evers and Republicans said bipartisan agreements so far included the release of the prior funds, protections for property owners who are not responsible for PFAS contamination and a grant program to help local governments with remediation projects.&nbsp;</p>\n\n\n\n<p><strong>Republican arguments:</strong> Republican Sen. Eric Wimberger, R-Gillett, has sought protections from the state’s spills law and financial penalties for “innocent landowners” who did not cause PFAS contaminations and seek help from the Department of Natural Resources.&nbsp;</p>\n\n\n\n<p><strong>Democratic arguments:</strong> The Environmental Protection Agency has previously issued health advisories on PFAS in drinking water. Evers in January argued that the state has a responsibility to provide safe and clean drinking water across Wisconsin.&nbsp;</p>\n\n\n\n<p><strong>Latest action:</strong> The Assembly passed the legislation, Assembly Bills 130 and 131, on 93-0 votes Friday evening. The Senate has yet to consider the bills, but Wimberger in a statement Thursday night said amendments in the Assembly “will help us get this vital legislation across the finish line in the Senate and signed into law by the Governor.”&nbsp;</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img alt=\"Several people sit at wooden desks in a marble-columned room decorated with red, white and blue bunting.\" class=\"wp-image-1314501\" height=\"520\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse20260217-State-of-the-State-Timmerman-023.jpg?resize=780%2C520&#038;quality=100&#038;ssl=1\" width=\"780\" /><figcaption class=\"wp-element-caption\">Lawmakers listen as Wisconsin Gov. Tony Evers delivers his final State of the State address at the Wisconsin State Capitol on Tuesday, Feb. 17, 2026, in Madison, Wis. (Joe Timmerman / Wisconsin Watch)</figcaption></figure>\n</div>\n\n\n<h3 class=\"wp-block-heading\"><strong>Online gambling</strong></h3>\n\n\n\n<p><strong>The context: </strong>Legal gambling in Wisconsin can only occur in-person on tribal properties, which means individuals who place online bets on mobile devices are technically violating the law. A proposal from August and Sen. Howard Marklein, R-Spring Green, would legalize online gambling if the server or device that a wager is placed on is located on tribal lands.&nbsp;</p>\n\n\n\n<p><strong>Supportive arguments: </strong>The bills from August and Marklein have bipartisan support. Lawmakers argue it provides clarity on what is legal in Wisconsin and protects consumers from unregulated websites.&nbsp;</p>\n\n\n\n<p><strong>Opposing arguments:</strong> The Wisconsin Institute for Law and Liberty in <a href=\"https://lobbying.wi.gov/Data/PositionFileUploads/11142025_113945_Memorandum-Final-Draft.pdf\">a November memo argued</a> that the bills would violate the Wisconsin Constitution and the federal Indian Gaming Act and provide a “race-based monopoly to Tribal gaming operations.”&nbsp;</p>\n\n\n\n<p><strong>Latest action: </strong>The Assembly passed the bill Thursday on a voice vote, meaning lawmakers didn’t record individual votes. It now heads to the Senate.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Funding for a public affairs network</strong></h3>\n\n\n\n<p><strong>The context:</strong> WisconsinEye, the nonprofit public affairs network that has filmed legislative proceedings since 2007, <a href=\"https://wisconsinwatch.org/2026/01/wisconsin-wisconsineye-video-recording-state-legislature-senate-assembly-capitol/\">went dark in mid-December</a> due to not raising the funds to operate this year. The Legislature previously approved a $10 million endowment that could only be accessed if WisconsinEye raised matching dollars equal to its request of state lawmakers. Legislative leaders approved $50,000 to bring WisconsinEye back in February, but the Assembly and Senate had opposing views of how to provide transparent viewing of legislative processes going forward.&nbsp;&nbsp;</p>\n\n\n\n<p><strong>Senate arguments:</strong> Senate Republicans specifically have been wary of providing funds to WisconsinEye and expressed frustrations at how the nonprofit spends its dollars. Senate Republicans proposed <a href=\"https://docs.legis.wisconsin.gov/2025/proposals/sb994\">a bill that would seek bids</a> for a potential public affairs network, which could go to WisconsinEye or another organization. “Maybe we are getting the best value currently with WisconsinEye, but we greatly don’t know,” LeMahieu told reporters this month.</p>\n\n\n\n<p><strong>Assembly arguments:</strong> Assembly Democrats and Republicans <a href=\"https://docs.legis.wisconsin.gov/2025/related/proposals/ab974\">proposed a bill </a>that would place the previously allocated matching dollars in a trust and direct earned interest to WisconsinEye. That could generate half a million dollars or more each year for an organization with a $900,000 annual budget. Assembly leaders said they wanted to ensure continued transparency at the Capitol.</p>\n\n\n\n<p><strong>Latest action:</strong> The Assembly earlier this month passed its bill 96-0 that would provide long-term funding support to WisconsinEye, but the Senate has yet to consider the bill. The Senate passed its bill on requesting bids for a public affairs network on Wednesday. The Assembly did not take up the Senate proposal before gaveling out for the year.&nbsp;</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is heading to Evers?&nbsp;</strong></h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Postpartum Medicaid&nbsp;</strong></h3>\n\n\n\n<p><strong>Lead authors:</strong> Sen. Jesse James, R-Thorp/Rep. Patrick Snyder, R-Weston</p>\n\n\n\n<p><strong>What it does:</strong> The bill extends postpartum Medicaid coverage in Wisconsin for new moms from current law at 60 days to a full 12 months after childbirth.</p>\n\n\n\n<p><strong>The context:</strong> Wisconsin is just one of two states that have yet to extend postpartum Medicaid for new mothers for up to one year. The proposal has been brought up in the Legislature for years, but <a href=\"https://wisconsinwatch.org/2025/11/wisconsin-abortion-medicaid-vos-assembly-bill-unborn-new-moms/\">Vos has long been the roadblock</a> for getting the bill across the finish line, often objecting to the idea as “expanding welfare.” “Anybody who’s in poverty in Wisconsin today already gets basically free health care through BadgerCare. If you are slightly above poverty level, you get basically free health care from the federal government through Obamacare,” Vos told reporters earlier this month. “So the idea of saying that we’re going to put more people onto the funding that the state pays for, as opposed to allowing them to stay on the funding that the federal government pays for, it doesn’t make any sense to me.”&nbsp;</p>\n\n\n\n\n\n<p><strong>How they voted:</strong> The Senate passed the bill on a 32-1 vote in April, with Sen. Chris Kapenga, R-Delafield, voting against. The Assembly voted 95-1 Thursday to send the bill to Evers’ desk, with Rep. Shae Sortwell, R-Two Rivers, as the lone vote against. Vos voted to pass the bill.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Dense breast cancer screenings&nbsp;</strong></h3>\n\n\n\n<p><strong>Lead authors:</strong> Sen. Rachael Cabral-Guevara, R-Fox Crossing/Rep. Cindi Duchow, R-town of Delafield</p>\n\n\n\n<p><strong>What it does:</strong> The bill requires health insurance policies to cover supplemental screenings for women who have dense breast tissue and are at an increased risk of breast cancer, eliminating out-of-pocket costs for things like MRIs and ultrasounds. The proposal has been referred to as “Gail’s Law,” after Gail Zeamer, a Wisconsin woman who regularly sought annual mammograms but was diagnosed with stage three breast cancer at age 47.&nbsp;</p>\n\n\n\n<p><strong>The context:</strong> The proposal has been stuck in the Assembly for months after near-unanimous passage in the Senate last year. Some Republicans had concerns about the bill being an insurance mandate. Vos <a href=\"https://isthmus.com/news/news/vos-says-breast-cancer-screening-bill-may-not-be-necessary/\">told Isthmus in January</a> that federal regulations might not make the bill necessary in Wisconsin, but ultimately allowed a vote on the Assembly floor.</p>\n\n\n\n<p><strong>How they voted:</strong> The Senate passed the bill in October on a 32-1 vote. The Assembly passed the bill Thursday on a 96-0 vote.&nbsp;</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Key bills signed into law (outside the state budget)</strong></h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Wisconsin Act 42 – Cellphone bans during school instructional time</strong></h3>\n\n\n\n<p><strong>Lead authors:</strong> Rep. Joel Kitchens, R-Sturgeon Bay/Cabral-Guevara</p>\n\n\n\n<p><strong>What it does: </strong>The law requires Wisconsin school boards to adopt policies that prohibit cellphone use during instructional time by July 1. By October districts must submit their policies to the Department of Public Instruction.&nbsp;</p>\n\n\n\n<p><strong>How they voted: </strong>The bill passed the Assembly along party lines in February 2025 and passed the Senate on a 29-4 vote in October.&nbsp;</p>\n\n\n\n<p><strong>When Evers signed the bill:</strong> October 2025.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Wisconsin Acts 11, 12 – Nuclear power summit and siting study</strong></h3>\n\n\n\n<p><strong>Lead authors: </strong>Sen. Julian Bradley, R-New Berlin/Rep. David Steffen, R-Howard</p>\n\n\n\n<p><strong>What it does:</strong> The laws created a board tasked with organizing a nuclear power summit in Madison and directed the Public Service Commission, which regulates utilities, to study new and existing locations for nuclear power and fusion generation in the state. In January, the Public Service Commission <a href=\"https://psc.wi.gov/Documents/PressReleases/2026.02.18PressRelease.PDF\">signed an agreement</a> with UW-Madison’s Department of Nuclear Engineering and Engineering Physics to complete the siting study.&nbsp;</p>\n\n\n\n<p><strong>How they voted:</strong> The Senate passed and the Assembly passed the bill in June 2025 on a voice vote.&nbsp;</p>\n\n\n\n<p><strong>When Evers signed the bills:</strong> July 2025</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Wisconsin Act 43 – Candidacy withdrawals for elections&nbsp;</strong></h3>\n\n\n\n<p><strong>Lead authors: </strong>Steffen/Sen. Van Wanggaard, R-Racine</p>\n\n\n\n<p><strong>What it does:</strong> The law gives Wisconsin candidates a path other than death to withdraw their name from election ballots. The bill was proposed in the wake of <a href=\"https://www.votebeat.org/wisconsin/2025/11/03/law-gives-candidates-path-off-ballot-besides-death/\">Robert F. Kennedy Jr.’s effort</a> to withdraw his name from the ballot in Wisconsin after he exited the presidential race in 2024 and endorsed President Donald Trump.&nbsp;</p>\n\n\n\n<p><strong>How they voted:</strong> The Assembly passed the bill in June. The Senate approved the bill on a 19-14 vote in October.</p>\n\n\n\n<p><strong>When Evers signed the bill:</strong> October 2025</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Wisconsin Act 48 – Making sextortion a crime&nbsp;</strong></h3>\n\n\n\n<p><strong>Lead authors: </strong>Snyder/James</p>\n\n\n\n<p><strong>What it does:</strong> The law makes sexual extortion a crime that bans threatening to injure another person’s property or reputation or threatening violence against someone to get them to participate in sexual conduct or share an intimate image of themselves. Lawmakers named the bill “Bradyn’s Law” after a 15-year-old in the D.C. Everest School District who became a victim of sextortion and died by suicide.</p>\n\n\n\n<p><strong>How they voted:</strong> The Senate passed and the Assembly passed the bill on a voice vote.&nbsp;</p>\n\n\n\n<p><strong>When Evers signed the bill:</strong> December 2025</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Wisconsin Act 22 – Informed consent for pelvic exams for unconscious patients</strong></h3>\n\n\n\n<p><strong>Lead authors: </strong>Sen. Andre Jacque, R-New Franken/Rep. Joy Goeben, R-Hobart</p>\n\n\n\n<p><strong>What it does:</strong> The bill requires that written consent is obtained from a patient before medical professionals at a hospital perform a pelvic exam while that person is unconscious or under general anesthesia.</p>\n\n\n\n<p><strong>How they voted:</strong> The Senate and the Assembly passed the bill on a voice vote. </p>\n\n\n\n<p><strong>When Evers signed the bill:</strong> August 2025</p>\n\n\n\n<div class=\"wp-block-media-text\"><figure class=\"wp-block-media-text__media\"><img alt=\"\" class=\"wp-image-1279368 size-full\" height=\"644\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2023/05/WCIJ_Logo_Stacked_FullColor_RGB-1.png?resize=780%2C644&#038;quality=100&#038;ssl=1\" width=\"780\" /></figure><div class=\"wp-block-media-text__content\">\n<p><em><strong><a href=\"https://www.wisconsinwatch.org/\">Wisconsin Watch</a></strong> is a nonprofit, nonpartisan newsroom. Subscribe to our <a href=\"https://www.wisconsinwatch.org/subscribe\">newsletters</a> for original stories and our Friday news roundup. </em></p>\n</div></div>\n<p><a href=\"https://wisconsinwatch.org/2026/02/wisconsin-assembly-legislature-what-lawmakers-did-and-what-is-unfinished/\">Wisconsin Assembly is done legislating for the year. Here’s what lawmakers did and what’s unfinished.</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/wisconsin-assembly-legislature-what-lawmakers-did-and-what-is-unfinished/",
    "publication_date": "Sat, 21 Feb 2026 15:54:22 +0000",
    "date_gathered": "2026-02-24T04:09:57.060549",
    "country": "US",
    "organization": "Wisconsin Watch"
  },
  {
    "title": "Air Wisconsin turns to ICE (static version)",
    "content": "<figure><img alt=\"A small plane flies over a barbed wire fence\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"683\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse6495279-scaled.jpg?fit=1024%2C683&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> 4</span> <span class=\"rt-label rt-postfix\">minutes</span></span>\n<p><em>Editor&#8217;s note: This is a static version of the interactive story <a href=\"https://wisconsinwatch.org/2026/02/air-wisconsin-turns-to-ice/\">found at this link</a>.</em></p>\n\n\n\n<figure class=\"wp-block-image alignwide size-large\"><img alt=\"Map of the United States with blue flight paths connecting cities labeled CIU, ATW, MSN, MKE, LAN, ORD, SBN, CMH, BMG, and LNK, radiating across the Midwest, South, and East Coast\" class=\"wp-image-1314511\" height=\"309\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/Screenshot-2026-02-20-at-1.20.12-PM.png?resize=780%2C309&#038;quality=100&#038;ssl=1\" width=\"780\" /></figure>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Part 1: A struggling regional carrier</h2>\n\n\n\n<h3 class=\"wp-block-heading\">The legacy network</h3>\n\n\n\n<p>Air Wisconsin Airlines has not been spared by the&nbsp;<a href=\"https://airlineweekly.skift.com/2023/05/small-cities-lose-air-service-as-large-airlines-exit/\">nationwide decline of regional air service.</a>&nbsp;The 60-year-old carrier&nbsp;<a href=\"https://www.wpr.org/news/air-wisconsin-another-round-layoffs-over-100-people\">laid off hundreds of employees</a>&nbsp;in Appleton and Milwaukee last year after&nbsp;<a href=\"https://www.prnewswire.com/news-releases/air-wisconsin-announces-strategic-shift-toward-essential-air-service-and-charter-operations-302348203.html\">terminating a contract</a>&nbsp;to provide aircraft, crews and services to American Airlines in January 2025. The airline’s&nbsp;<a href=\"https://www.wpr.org/news/air-wisconsin-another-round-layoffs-over-100-people\">planned pivot to charter service and federally subsidized connections to underserved airports didn’t pan out</a>, prompting another round of layoffs by the spring.</p>\n\n\n\n<p>But the company’s troubles didn’t entirely ground its fleet. Flight tracking data indicate that Air Wisconsin continued to provide regional air service through the end of 2025, primarily connecting its Wisconsin hubs to mid-sized Midwestern airports as it had for decades.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The sale</h3>\n\n\n\n<p>In January, Harbor Diversified Inc., the Appleton-based parent company of Air Wisconsin,&nbsp;<a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0000899394/000119312526014391/d23873d8k.htm\">sold the company’s operations and 13 of its jets to CSI Aviation</a>, a New Mexico-based air charter company and longtime federal contractor&nbsp;<a href=\"https://ig.ft.com/us-deportation-flights/\">owned by former New Mexico Republican Party chair Allen Weh.</a></p>\n\n\n\n<p>Air Wisconsin sent recall notices to the company’s furloughed flight attendants after the sale to CSI Aviation, and the Association of Flight Attendants — the union representing the furloughed workers — negotiated an immediate raise for returning members. In a January press release announcing the recall notices, the union noted that only a third of the furloughed flight attendants opted to return.</p>\n\n\n\n<p>Neither CSI nor Harbor Diversified responded to requests for comment.</p>\n\n\n\n<p>CSI is central to the Trump administration’s ongoing immigration crackdown.</p>\n\n\n\n<p>It has provided charter services for ICE since 2024, transporting detainees and deportees both directly and through subcontractors.</p>\n\n\n\n<p>The company entered its current&nbsp;<a href=\"https://wisconsin-watch.github.io/air_wisconsin_analysis/?v=2\">$1.5 billion contract</a>&nbsp;with the Department of Homeland Security in November of last year.</p>\n\n\n\n<p>Demand for private charters surged after 2010, when the Obama administration moved away from relying solely on the U.S. Marshals Service.</p>\n\n\n\n<p>Air Wisconsin isn&#8217;t alone. Avelo Airlines began deportation flights last spring, but <a href=\"https://www.cnbc.com/2026/01/07/avelo-airlines-ice-deportation-flights-job-cuts.html\">backed out last month</a> following intense public backlash.</p>\n\n\n\n<h3 class=\"wp-block-heading\">A transformed network </h3>\n\n\n\n<figure class=\"wp-block-image alignwide size-large\"><img alt=\"Map of the United States with orange and blue flight paths connecting cities labeled MSP, MKE, MSN, ATW, BWI, RIC, TCL, AEX, GRK, and ELP; legend reads &quot;PRE-SALE FLIGHTS&quot; and &quot;POST-SALE FLIGHTS&quot;\" class=\"wp-image-1314510\" height=\"308\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/Screenshot-2026-02-20-at-1.17.24-PM.png?resize=780%2C308&#038;quality=100&#038;ssl=1\" width=\"780\" /></figure>\n\n\n\n<p>CSI’s acquisition of Air Wisconsin transformed the airline’s flight patterns within a matter of weeks. The airline’s website&nbsp;<a href=\"https://www.airwis.com/Travel/Routes#routes\">no longer</a>&nbsp;lists&nbsp;<a href=\"https://web.archive.org/web/20250410000516/https://www.airwis.com/Travel/Routes#routes\">passenger routes</a>, but flight data collected between Jan. 9 and mid-February indicates that the airline has largely ceded its role as a Midwestern regional carrier.</p>\n\n\n\n<p>Instead, the airline increasingly looks south: Destinations in Louisiana and Texas replaced the mid-sized Midwestern airports that were, until recently, the airline’s most frequent destinations.</p>\n\n\n\n<p>Flight data indicates Air Wisconsin planes made at least 125 trips in January 2026, up from roughly 60 in December 2025. Thicker lines on the map indicate more frequent routes.</p>\n\n\n\n<h2 class=\"wp-block-heading has-text-align-center\">Part 2: Air ICE </h2>\n\n\n\n<p>Many of Air Wisconsin’s new destinations are within easy reach of ICE detention facilities in Texas and Louisiana, including some of the agency’s largest.</p>\n\n\n\n<h3 class=\"wp-block-heading\">The Minnesota operation</h3>\n\n\n\n<figure class=\"wp-block-image alignwide size-large\"><img alt=\"Map of Minnesota and surrounding states showing six small dots representing ICE facilities and yellow lines extending from the Twin Cities representing flight patterns. \" class=\"wp-image-1314509\" height=\"306\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/Screenshot-2026-02-20-at-1.15.19-PM.png?resize=780%2C306&#038;quality=100&#038;ssl=1\" width=\"780\" /></figure>\n\n\n\n<p>Minneapolis-St. Paul International Airport is among the busiest in the country, but Air Wisconsin rarely provided service to the Twin Cities in the final months of 2025.</p>\n\n\n\n<p>That changed in January, just weeks after the Trump administration dispatched thousands of federal agents to Minnesota for an immigration enforcement offensive dubbed Operation Metro Surge.</p>\n\n\n\n<p><a href=\"https://www.npr.org/2026/02/06/nx-s1-5701432/minneapolis-ice-air-deportation-flights\">Hundreds of immigrants detained in the operation have since departed the airport in shackles</a>, loaded onto <a href=\"https://gillianbrockell.ghost.io/air-wisconsin-has-done-60-ice-flights-since-mid-january/\">charter flights bound for ICE detention facilities farther south.</a></p>\n\n\n\n<h3 class=\"wp-block-heading\">Alexandria </h3>\n\n\n\n<figure class=\"wp-block-image alignwide size-large\"><img alt=\"Map of Louisiana and surrounding states with more than 20 red dots of various sizes representing detention centers, with yellow lines representing flight routes\" class=\"wp-image-1314508\" height=\"308\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/Screenshot-2026-02-20-at-1.12.54-PM.png?resize=780%2C308&#038;quality=100&#038;ssl=1\" width=\"780\" /></figure>\n\n\n\n<p>The modest airport in Alexandria, Louisiana, is now the&nbsp;<a href=\"https://www.nytimes.com/interactive/2025/07/31/us/ice-deportation-hub-alexandria-louisiana.html\">epicenter of ICE’s deportation flight operations.</a>&nbsp;Air Wisconsin has flown to or from Alexandria at least 30 times since the airline’s acquisition by CSI, on par with the airline’s service to Madison and outpacing service to Appleton, home to the airline’s corporate headquarters.</p>\n\n\n\n<p>The GEO Group, an international private prison operator, runs an ICE detention facility on the airport’s tarmac. A dozen other ICE facilities sit within easy reach. Among them is the Adams County Correctional Center in Natchez, Mississippi, where Delvin Francisco Rodriguez, a 39-year-old Nicaraguan national, died in custody on Dec. 14, 2025. ICE acknowledged the incident in <a href=\"https://www.ice.gov/news/releases/illegal-alien-nicaragua-passes-away-hospital-natchez\">a press release</a> four days later, though the agency did not specify the cause of Rodriguez’s death.</p>\n\n\n\n<h3 class=\"wp-block-heading\">El Paso </h3>\n\n\n\n<figure class=\"wp-block-image alignwide size-large\"><img alt=\"Map of the El Paso area shows yellow lines representing flight routes in the area and two large dots representing detention centers. \" class=\"wp-image-1314507\" height=\"307\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/Screenshot-2026-02-20-at-1.09.09-PM.png?resize=780%2C307&#038;quality=100&#038;ssl=1\" width=\"780\" /></figure>\n\n\n\n<p>Camp East Montana, ICE&#8217;s largest detention facility, sits just east of El Paso International Airport. Air Wisconsin flights took off from or landed in El Paso at least 32 times in January and early February, second only to Milwaukee’s Mitchell International Airport.</p>\n\n\n\n<p>The camp drew national attention in early January after Geraldo Lunas Campos, a 55-year-old Cuban national,&nbsp;<a href=\"https://www.pbs.org/newshour/nation/cuban-immigrant-in-ice-custody-died-of-homicide-due-to-asphyxia-autopsy-finds\">died by asphyxiation after guards pinned him to the floor of a cell.</a>&nbsp;The El Paso County Medical Examiner’s Office later ruled the death a homicide.</p>\n\n\n\n<p>Lunas Campos’ death came a month after Francisco Gaspar-Andres, a 48-year-old from Guatemala and detained at Camp East Montana,&nbsp;<a href=\"https://elpasomatters.org/2025/12/09/ice-detainee-death-immigrant-camp-east-montana-fort-bliss-el-paso-texas/\">died in an El Paso hospital</a>; ICE attributed Gaspar-Andres’ death to liver and kidney failure.</p>\n\n\n\n<p>Another detainee, 36-year-old Victor Manuel Diaz of Nicaragua, died at the camp on Jan. 14 in what ICE described as a “presumed suicide” — <a href=\"https://sahanjournal.com/immigration/nicaraguan-family-minnesota-ice-custody-death-texas-detainee/\">an explanation his family questions.</a> ICE agents detained Diaz in Minneapolis only days before his death.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Back at home</h3>\n\n\n\n<p>Air Wisconsin hasn’t entirely withdrawn from its home state hubs. Many of the airline’s remaining pilots, flight attendants and ground crew are still Wisconsin-based, and Milwaukee remains the airline’s primary hub.</p>\n\n\n\n<p>The airline is now hiring for more than a dozen Wisconsin-based positions — including legal counsel.</p>\n\n\n\n<h3 class=\"wp-block-heading\">About the data </h3>\n\n\n\n<p>Wisconsin Watch used FlightAware AeroAPI data (Sept 2025 – Feb 2026) to reconstruct patterns before and after the Jan. 9 sale to CSI Aviation.</p>\n\n\n\n<p>Hubs on these maps represent the 10 airports most frequently used. While the routes align with ICE operations, the data does not confirm if specific flights carried detainees.</p>\n\n\n<p><a href=\"https://wisconsinwatch.org/2026/02/air-wisconsin-turns-to-ice-static-version/\">Air Wisconsin turns to ICE (static version)</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/air-wisconsin-turns-to-ice-static-version/",
    "publication_date": "Fri, 20 Feb 2026 20:49:53 +0000",
    "date_gathered": "2026-02-24T04:09:57.060553",
    "country": "US",
    "organization": "Wisconsin Watch"
  },
  {
    "title": "Air Wisconsin turns to ICE",
    "content": "<figure><img alt=\"A small plane flies over a barbed wire fence\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"683\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse6495279-scaled.jpg?fit=1024%2C683&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> &lt; 1</span> <span class=\"rt-label rt-postfix\">minute</span></span>\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-9d6595d7 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\"></div>\n</div>\n\n\n\n<div class=\"iframe-box\">\n    \n    \n\n    <a class=\"back-link\" href=\"https://wisconsinwatch.org\">\n        <span style=\"font-size: 16px; line-height: 0; vertical-align: middle; margin-right: 4px;\">&larr;</span> Back to Wisconsin Watch\n    </a>\n</div>\n\n\n<p><a href=\"https://wisconsinwatch.org/2026/02/air-wisconsin-turns-to-ice/\">Air Wisconsin turns to ICE</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/air-wisconsin-turns-to-ice/",
    "publication_date": "Fri, 20 Feb 2026 12:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:57.060557",
    "country": "US",
    "organization": "Wisconsin Watch"
  },
  {
    "title": "Who you gonna call? Wisconsin 911 dispatchers discuss fixes to national, statewide shortage",
    "content": "<figure><img alt=\"Marked police vehicles are parked in a line in a parking lot along a residential street as a person walks to the left.\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"683\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse20250812-Police-Dispatch-911-Timmerman-002-scaled.jpg?fit=1024%2C683&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> 6</span> <span class=\"rt-label rt-postfix\">minutes</span></span>\n<details class=\"wp-block-details is-layout-flow wp-block-details-is-layout-flow\">Click here to read highlights from the event\n<ul class=\"wp-block-list\">\n<li>911 centers across the country are experiencing a shortage of dispatchers. It’s affecting many Wisconsin communities, regardless of size or location.</li>\n\n\n\n<li>These shortages make a difficult job harder and shifts even longer. The work is mentally taxing, and that’s amplified when there are fewer people on staff. </li>\n\n\n\n<li>Who is a good fit for the job? People who can multi-task, stay calm under pressure, talk to strangers easily and handle high emotions.</li>\n\n\n\n<li>Some counties have eased their shortages by boosting pay, focusing on mental health and opening up part-time positions. </li>\n\n\n\n<li>AI is helping tackle some problems, but it’s not replacing dispatchers.</li>\n\n\n\n<li>A college education isn’t necessary for the job, but Wisconsin’s tech colleges are adding emergency dispatch programs that help people see if the job is for them.</li>\n</ul>\n</details>\n\n\n\n<p>Children love to dress up as firefighters and police officers. They imagine themselves rushing into danger, answering the call when people are in need.&nbsp;</p>\n\n\n\n<p>But how many of them realize they could literally be the one to answer those calls — as a 911 dispatcher?</p>\n\n\n\n<p>&nbsp;“Not many people know about this as a career field,” said Gail Goodchild, emergency preparedness director for Waukesha County, at a Wisconsin Watch <a href=\"https://www.youtube.com/watch?v=PAcQda6Us94\">virtual panel discussion</a> on Wednesday. “I think about trick or treaters … Nobody walks around with a headset and says, ‘I&#8217;m going to be a dispatcher someday.’”</p>\n\n\n\n<p>The panel of emergency telecommunications professionals and educators said the low profile of emergency dispatch is one of many reasons that 911 centers across the country struggle to fill openings.</p>\n\n\n\n<p>In Wisconsin, rural and urban communities alike are regularly short of dispatchers. Wisconsin Watch reported last year on Brown County’s <a href=\"https://wisconsinwatch.org/2025/08/wisconsin-brown-county-911-dispatcher-shortage-green-bay-waukesha-public-safety/\">“relentless” shortage</a> and what the city can learn from successful changes in Waukesha County. This panel, moderated by reporter Miranda Dunlap, continues that conversation by highlighting perspectives and solutions from experts across the state.</p>\n\n\n\n<p>“We have a critical, nationwide shortage of 911 professionals,” said Chippewa County Emergency Communications Center Director and longtime dispatcher Tamee Thom, who is also president of <a href=\"https://www.wipscom.com/\">WIPSCOM</a>, a board representing 911 professionals across Wisconsin.</p>\n\n\n\n<p>Solving the problem, panelists agreed, will require both attracting new dispatchers and supporting those already on the job. They recommend raising awareness about the career, improving pay and working conditions, providing mental health support and technology to reduce burnout, and officially designating these professionals as first responders, in the same category as paramedics, firefighters and police.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n\n</div></figure>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Lives on the line</strong></h2>\n\n\n\n<p>Emergency dispatch work is mentally and emotionally taxing, panelists said. At any moment, a dispatcher must be prepared for everything from talking someone through delivering a baby to responding to an act of violence.&nbsp;</p>\n\n\n\n<p>“It can go from zero to 90 in seconds,” Goodchild said. “One minute you’re talking with your podmate, and then the (phones) are ringing off the hook for … a car accident or, God forbid, an active shooter at the local school.”</p>\n\n\n\n<p>Dispatchers must remain calm to gather necessary information, relay instructions —&nbsp; say, how to perform CPR or deliver a baby — and de-escalate tension if needed. Meanwhile, they’re doing multiple other tasks, including taking notes, using mapping tools to better locate the caller, and talking with law enforcement dispatchers.&nbsp;</p>\n\n\n\n<p>When a call ends, the dispatcher might never find out what happened afterward. Sometimes, they finish a life-or-death call and then pick up a mundane call about trash pickup or parking tickets, sending them on an emotional rollercoaster.</p>\n\n\n\n\n\n<p>The job only gets harder when 911 centers are shortstaffed. Staff who typically work 8- or 12-hour shifts could have to work 16, Goodchild said. In some cases, they leave work only to clock back in eight hours later.&nbsp;</p>\n\n\n\n<p>“You might have time to go home, maybe tuck in your kids at night. You’re getting a couple hours of sleep … pack your lunch … then get back to work,” Goodchild said.&nbsp;</p>\n\n\n\n<p>But despite the challenges, veteran dispatchers say there’s a reason they’ve stayed in the field for decades.&nbsp;</p>\n\n\n\n<p>Billi Jo Baneck, communications coordinator at the Shawano County Sheriff&#8217;s Office, once quit dispatch work to direct events at a wedding venue.&nbsp;</p>\n\n\n\n<p>“I tried to leave … and I came right back,” Baneck said. “It just consumes you.”</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What’s working</strong></h2>\n\n\n\n<p>Waukesha County offers some clues about how to fix the shortage. In 2023, the department had 20 vacancies. By July 2025, it had just two.&nbsp;</p>\n\n\n\n<p>One of the most important changes was to start hiring candidates based on personality rather than specific skills, said Goodchild, who took over as director a year ago.&nbsp;</p>\n\n\n\n<p>“We can teach customer service. We can teach them how to read a protocol, but if they&#8217;re coming in with a bad attitude, it really messes up the culture in that environment and adds to the stress.”</p>\n\n\n\n<p>The department also conducted a compensation study, which led it to raise the starting wage for dispatchers from around $27 to almost $29.50 to compete with other employers.&nbsp;</p>\n\n\n\n<p>“People were leaving for less stressful jobs … They were going into the private industry because they could get paid better to do less,” Goodchild said.&nbsp;</p>\n\n\n\n<p>Waukesha’s success has caught the attention of emergency telecommunications leaders across the state. Still, Goodchild said, the county’s work isn’t done.</p>\n\n\n\n<p>“While we’ve made changes and we’ve seen improvements,” Goodchild said, “we’re still not at full staffing … We have to continue to stay vigilant and identify those gaps and issues before they get to be bigger problems, and remain adaptable in meeting the needs of the center and certainly the communities that we serve.”</p>\n\n\n\n<p>Thom agrees. In Chippewa County, her department has created part-time positions for dispatchers who wanted to cut back their schedules, and it’s passed some administrative and training duties to once-retired dispatchers who don’t want the stress of taking calls.&nbsp;</p>\n\n\n\n<p>That kind of “innovative” scheduling is essential, she said.&nbsp;</p>\n\n\n\n<p>“These days, people are really looking for that work-life balance … so I think any way that we can help add to that … I think we’re going to retain staff,” Thom said.</p>\n\n\n\n<p>To support dispatchers’ mental health, some departments have created peer support programs for dispatchers and other first responders to supplement existing mental health services.&nbsp;</p>\n\n\n\n<p>Meanwhile, Waukesha County has hired a specialized therapy contractor called <a href=\"https://www.firstresponderpsych.com/\">First Responder Psychological Services</a> to meet with new hires and check in once or twice a year with every employee. All the company’s staff have worked in public safety, so they understand the specific stresses of the job, Goodchild said.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>A role for AI?</strong></h2>\n\n\n\n<p>Another way departments are easing the burden on overworked dispatchers: artificial intelligence. Waukesha is <a href=\"https://www.wpr.org/news/wisconsin-counties-ai-non-emergency-calls-waukesha-la-crosse\">among the Wisconsin departments</a> that now use an AI agent to answer non-emergency calls. That could include questions about how to pay a parking ticket, or what time the local fireworks show starts.&nbsp;</p>\n\n\n\n<p>“I just want to be clear, because I know everybody’s fear is that you’re going to get an AI agent (when you’re) calling 911: That’s not the case,” Goodchild said.&nbsp;</p>\n\n\n\n<p>That change, Goodchild said, means dispatchers get a little more down time and don’t experience so much of an emotional rollercoaster.</p>\n\n\n\n<p>“You’re not going to send a law enforcement tactical team to go get a kitten out of a tree, right?” Goodchild said. “We train our 911 dispatchers at such a high level to provide CPR instructions, childbirth instructions, the de-escalating skills, multitasking skills. Why are you having them focus on a caller that’s calling in about when the fireworks are?”</p>\n\n\n\n<p>Some schools and 911 centers are also using AI to train new dispatchers, said Shawano County’s Baneck, who also teaches emergency telecommunications at Northeast Wisconsin Technical College.&nbsp;</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Tech colleges step in</strong></h2>\n\n\n\n<p>Wisconsin’s tech colleges can play an important role in fixing the shortage by raising awareness about the field and helping potential dispatchers figure out whether the job is right for them, panelists said.</p>\n\n\n\n<p>Andrew Baus, associate dean of human services at Moraine Park Technical College, helped create the college’s new emergency dispatch certificate program. Baus worked for years as a paramedic, the third generation in his family to work as a first responder.&nbsp;</p>\n\n\n\n<p>“Growing up, the options were always fire or criminal justice. It really never dawned that dispatching was right there with them,” Baus said. Now, he said, he’s trying to show students that dispatch is another “great option.”</p>\n\n\n\n<p>To excel in dispatch, a person must multitask and be friendly with strangers, Baneck said. Those people can be hard to find.</p>\n\n\n\n<p>“People with customer service experience that are used to angry customers, angry shoppers, (and) people that have been in the food service industry that are used to running back and forth, taking multiple orders … they do really well in this kind of job.”</p>\n\n\n\n<p>You don’t typically need certifications to get a job as a dispatcher, Baneck said, noting that departments usually offer a 40-hour basic training in-house or send new hires for training elsewhere.&nbsp;</p>\n\n\n\n<p>But taking those classes in advance can help a person figure out whether dispatch work is right for them, before they ever apply for a job. That, in turn, can reduce turnover.</p>\n\n\n\n<p>“Your heart’s got to be all-in to be able to work nights, holidays, weekends, around the clock, serving your community,” said Baneck, who also urges students considering dispatch to contact a 911 center and ask to shadow a dispatcher at work. “This is a good way of knowing whether their heart’s going to be in it or not, or whether they’re going to be capable of doing it.”</p>\n\n\n\n<p>Thom agrees. “They see what it’s really like, and not what it looks like on TV,” Thom said.&nbsp;</p>\n\n\n\n<p>Meanwhile, Thom said WIPSCOM is still pushing Wisconsin lawmakers to include dispatchers in <a href=\"https://docs.legis.wisconsin.gov/2025/proposals/ab158\">newly adopted legislation</a> that lets first responders diagnosed with post-traumatic stress disorder apply for worker’s compensation benefits. Some states have <a href=\"https://www.stlpr.org/government-politics-issues/2023-09-15/missouri-911-dispatchers-now-qualify-as-first-responders-heres-why-that-matters\">officially reclassified dispatchers as first responders</a>. Such a change can mean dispatchers qualify for&nbsp; higher pay, better benefits and even the chance to retire earlier.</p>\n\n\n\n<p>“There’s a difference between what we do every day and being a clerical worker. We are part of the emergency services world and are, honestly, the first first responder there,” Thom said. “We will continue to be a thorn in their side … speaking on behalf of our 911 professionals across the state.”</p>\n\n\n\n<div class=\"wp-block-media-text\"><figure class=\"wp-block-media-text__media\"><img alt=\"\" class=\"wp-image-1279368 size-full\" height=\"644\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2023/05/WCIJ_Logo_Stacked_FullColor_RGB-1.png?resize=780%2C644&#038;quality=100&#038;ssl=1\" width=\"780\" /></figure><div class=\"wp-block-media-text__content\">\n<p><em><strong><a href=\"https://www.wisconsinwatch.org/\">Wisconsin Watch</a></strong> is a nonprofit, nonpartisan newsroom. Subscribe to our <a href=\"https://www.wisconsinwatch.org/subscribe\">newsletters</a> for original stories and our Friday news roundup. </em></p>\n</div></div>\n<p><a href=\"https://wisconsinwatch.org/2026/02/who-you-gonna-call-wisconsin-911-dispatchers-discuss-fixes-to-national-statewide-shortage/\">Who you gonna call? Wisconsin 911 dispatchers discuss fixes to national, statewide shortage</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/who-you-gonna-call-wisconsin-911-dispatchers-discuss-fixes-to-national-statewide-shortage/",
    "publication_date": "Thu, 19 Feb 2026 22:31:31 +0000",
    "date_gathered": "2026-02-24T04:09:57.060562",
    "country": "US",
    "organization": "Wisconsin Watch"
  },
  {
    "title": "Wisconsin Republican Assembly Speaker Robin Vos leaving office at end of the year",
    "content": "<figure><img alt=\"A person in a suit raises a hand to the forehead while standing between two other people in a wood-paneled room with a blue flag in the background.\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"683\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse20250122-State-of-the-State-Timmerman-19-scaled.jpg?fit=1024%2C683&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> 3</span> <span class=\"rt-label rt-postfix\">minutes</span></span>\n<p><a href=\"https://apnews.com/article/wisconsin-assembly-republican-robin-vos-08d64489a15eeb1f50b0959b12e86fa9\">Robin Vos</a>, who has led the Republican charge in Wisconsin during his record-long stint as state Assembly speaker and blocked much of the Democratic governor&#8217;s agenda, announced Thursday that he will retire at the end of the year.</p>\n\n\n\n<p>Vos, who also drew President Donald Trump&#8217;s ire for not aggressively challenging Trump’s loss in the battleground state in 2020, made the announcement from the floor of the Assembly. Vos is in his 22nd year in the Assembly and 14th year as speaker.</p>\n\n\n\n<p>Vos has served during a tumultuous time in&nbsp;<a href=\"https://apnews.com/events-general-news-united-states-presidential-election-77bafb7879544f11b494f405386375c1\">Wisconsin politics</a>, in which the swing state became a national leader in&nbsp;<a href=\"https://apnews.com/article/wisconsin-union-lawsuit-collective-bargainin-75faef922860f9a7d1dc06ae1dc783d1\">curbing union powers</a>, was a&nbsp;<a href=\"https://apnews.com/article/trump-wisconsin-election-2024-harris-blue-wall-b22c2042c9e68115c3de71794dc9c985\">key battleground</a>&nbsp;in presidential elections and was at the center of redistricting fights over&nbsp;<a href=\"https://apnews.com/3e32af2721bc4df7a46bbdaffaaeb25b\">Republican-friendly maps</a>&nbsp;championed by Vos.</p>\n\n\n\n<p>To his political opponents, Vos has been a shadow governor who shrewdly used his legislative majority to create a dysfunctional state government focused on advancing the conservative agenda and denying Democrats any victories they could tout.</p>\n\n\n\n<p>To his supporters, Vos has been a shrewd tactician who outmaneuvered his political foes, sometimes within his own party, to become one of the state&#8217;s most influential Republicans in a generation.</p>\n\n\n\n<p>Vos told The Associated Press that he suspects Democrats will be “happy that I&#8217;m gone.” But he had a message for his conservative detractors: “You&#8217;re going to miss me.&#8221;</p>\n\n\n\n<h2 class=\"wp-block-heading\">Vos worked to curb union power, fight Democrats</h2>\n\n\n\n<p>Vos was a close ally of former Republican Gov. Scott Walker and helped pass key parts of his agenda, including the 2011 law known as Act 10 that effectively ended collective bargaining for most public workers. Vos also led the fight to pass several&nbsp;<a href=\"https://apnews.com/article/wisconsin-budget-university-cut-income-tax-9d37d68e8f312d6721b9f6d00d4d9fef\">tax cuts</a>, a “&nbsp;<a href=\"https://apnews.com/article/business-wisconsin-united-states-congress-united-states-government-261068d6395745b9a2f6a7dd3aa9bc7b\">right to work</a>&nbsp;” law and a voter ID requirement — legislation strongly opposed by Democrats.</p>\n\n\n\n<p>When Democrat Tony&nbsp;<a href=\"https://apnews.com/gubernatorial-elections-8ba8b7cd0cf14082a11741b74ae752d6\">Evers defeated Walker</a>&nbsp;in 2018, and after the top Republican in the Senate won election to Congress two years later, Vos emerged as the leader of Republicans in state government and the top target for those on the left.</p>\n\n\n\n<p>Vos successfully thwarted much of Evers’ policy agenda the past seven years. He&nbsp;<a href=\"https://apnews.com/wi-state-wire-46ef0eb6adaf4507a47c86ffdd64fa5b\">kneecapped</a>&nbsp;Evers even before Evers took office in 2019 by passing a series of bills in a&nbsp;<a href=\"https://apnews.com/article/7f4d0febeebae77e13f07b8d1effec5d\">lame duck session</a>&nbsp;that weakened the governor’s powers.</p>\n\n\n\n\n\n\n\n<p>“I&#8217;ve been tenacious and I&#8217;ve fought for what our caucus wants,” Vos said.</p>\n\n\n\n<p>Vos and fellow Republicans&nbsp;<a href=\"https://apnews.com/article/wisconsin-evers-legislature-child-care-special-session-3df1f2fbf34b5c7411d35b775d50c791\">ignored special sessions</a>&nbsp;Evers called and successfully&nbsp;<a href=\"https://apnews.com/article/5e0c77de5d0802ae1f9763b2200fe537\">fought to limit</a>&nbsp;his powers during the COVID-19 pandemic in 2020. Vos&nbsp;<a href=\"https://apnews.com/article/9d7761ad4fdd9fe0d0b55b5b80f09cf9\">led the lawsuit</a>&nbsp;to overturn Evers’ stay-at-home order, resulting in Wisconsin becoming the first state where a court invalidated a governor’s coronavirus restrictions.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Vos angered some fellow Republicans</h2>\n\n\n\n<p>Vos angered some within his own party, most notably Trump, who criticized him for not doing enough to investigate his 2020 loss in Wisconsin.&nbsp;<a href=\"https://apnews.com/article/joe-biden-elections-wisconsin-election-2020-d59426b14d870a5722f574ed246b6f79\">Vos eventually hired</a>&nbsp;a former conservative Wisconsin Supreme Court justice to look into the election, but later fired him amid&nbsp;<a href=\"https://apnews.com/article/joe-biden-wisconsin-elections-racial-injustice-election-2020-9f9ce4a95e3d21bebb4ef7bd9543146f\">bipartisan criticism</a>&nbsp;over his effort that put forward discounted conspiracy theories and found no evidence of widespread fraud or abuse.</p>\n\n\n\n<p>The episode amounted to a rare misstep for Vos, who is now advocating for revoking the former justice’s&nbsp;<a href=\"https://apnews.com/article/gableman-wisconsin-election-conspiracies-law-license-b5000cc36f3ceac8b0ea0fda89dc9de8\">law license</a>. Vos has repeatedly said that hiring Gableman was the biggest mistake he ever made.</p>\n\n\n\n<p>Trump endorsed Vos&#8217; primary challenger in 2022, and his supporters mounted multiple unsuccessful efforts to recall Vos from office. Vos decried those targeting him as <a href=\"https://apnews.com/37907ea578f1bc5b0915c30e1b3c5b28\">“whack jobs and morons,&#8221;</a> and he held on to extend his run as Wisconsin&#8217;s longest-serving speaker, eclipsing Democrat Tom Loftus, who held the position from 1983 to 1991.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Democrats eyeing a majority</h2>\n\n\n\n<p>Vos grew the GOP majority under Republican-drawn legislative maps before the state Supreme Court ordered&nbsp;<a href=\"https://apnews.com/article/wisconsin-supreme-court-redistricting-eccbcfee414d1943073a9fb949743860\">new ones</a>&nbsp;in 2023, resulting in Democratic gains in the last election. The Republicans held as many as 64 seats under Vos, but that dropped to 54 in what will be Vos’s final year.</p>\n\n\n\n<p>Democrats are optimistic they can take the majority this year, while Vos said he remains confident that Republicans will remain in control even without him as speaker.</p>\n\n\n\n<p>Vos, 57, was first elected to the Assembly in 2004 and was chosen by his colleagues as speaker in 2013. He became Wisconsin’s longest-serving speaker in 2021.</p>\n\n\n\n<p>Vos said he had a mild heart attack in November that he didn&#8217;t reveal publicly until Thursday, but that&#8217;s not why he&#8217;s leaving.</p>\n\n\n\n<p>“It was the tap on the shoulder that I needed to make sure that my decision is right,” he said.</p>\n\n\n\n<p>Vos said it was “unlikely” he would run for office again, but he didn&#8217;t rule it out.</p>\n\n\n\n<p>Vos was college roommates with&nbsp;<a href=\"https://apnews.com/article/donald-trump-susie-wiles-chief-of-staff-white-house-0ee52de915484312128ac1cac59d78af\">Reince Priebus</a>, who was chair of the Republican National Committee in 2016 and served as Trump’s first White House chief of staff.</p>\n\n\n\n<h2 class=\"wp-block-heading\">End of an era</h2>\n\n\n\n<p>The governor, who had a sometimes contentious relationship with Vos, said his retirement “marks the end of an era in Wisconsin politics.”</p>\n\n\n\n<p>“Although we’ve disagreed more often than we didn’t, I respect his candor, his ability to navigate complex policies and conversations, and his unrivaled passion for politics,” Evers said.</p>\n\n\n\n<p>Democratic U.S. Rep. Mark Pocan, who served with Vos in the Legislature and remained friends with him even though they’re political opposites, called him a “formidable opponent” and “probably the most intelligent and strategic Assembly speaker I have seen.”</p>\n\n\n\n<p><em><strong><a href=\"https://www.wisconsinwatch.org/\">Wisconsin Watch</a></strong> is a nonprofit and nonpartisan newsroom. Subscribe to our <a href=\"https://www.wisconsinwatch.org/subscribe\">newsletters</a> to get our investigative stories and Friday news roundup.</em> <em>This story is published in partnership with The Associated Press.</em></p>\n<p><a href=\"https://wisconsinwatch.org/2026/02/wisconsin-vos-republican-assembly-speaker-leaving-office-evers-democrat-trump-retire/\">Wisconsin Republican Assembly Speaker Robin Vos leaving office at end of the year</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/wisconsin-vos-republican-assembly-speaker-leaving-office-evers-democrat-trump-retire/",
    "publication_date": "Thu, 19 Feb 2026 21:05:05 +0000",
    "date_gathered": "2026-02-24T04:09:57.060566",
    "country": "US",
    "organization": "Wisconsin Watch"
  },
  {
    "title": "Do 80% of Americans support voter ID?",
    "content": "<figure><img alt=\"\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"537\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2024/11/Gigafact-voting.jpg?fit=1024%2C537&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> &lt; 1</span> <span class=\"rt-label rt-postfix\">minute</span></span>\n<div class=\"wp-block-media-text is-stacked-on-mobile\"><figure class=\"wp-block-media-text__media\"><img alt=\"\" class=\"wp-image-1278996 size-full\" height=\"408\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2023/05/Wisconsin_Watch_fact_brief.jpg?resize=780%2C408&#038;quality=100&#038;ssl=1\" width=\"780\" /></figure><div class=\"wp-block-media-text__content\">\n<p><em><em><a href=\"https://www.wisconsinwatch.org/\">Wisconsin Watch</a></em> partners with&nbsp;<a href=\"https://gigafact.org/\">Gigafact</a>&nbsp;to produce fact briefs — bite-sized fact checks of trending claims. <a href=\"https://wisconsinwatch.org/2023/05/how-wisconsin-watch-checks-claims-for-its-gigafact-fact-briefs/\">Read our methodology</a> to learn how we check claims.</em></p>\n</div></div>\n\n\n\n\n<div class=\"wp-block-group is-content-justification-space-between is-nowrap is-layout-flex wp-container-core-group-is-layout-0dfbf163 wp-block-group-is-layout-flex\">\n\n<h2 class=\"wp-block-heading\">Yes.</h2>\n\n\n\n\n<figure class=\"wp-block-image size-large is-resized wp-container-content-88a6062c\"><img alt=\"\" src=\"https://i0.wp.com/gigafact-app-images.s3.us-east-2.amazonaws.com/factBriefImage.jpeg?w=780&#038;quality=100&#038;ssl=1\" style=\"width: 150px;\" /></figure>\n</div>\n\n\n\n\n<p>Polls show roughly 80% of Americans support requiring photo identification to vote.</p>\n\n\n\n<p><a href=\"https://www.pewresearch.org/wp-content/uploads/sites/20/2025/08/PP_2025.8.22_voting-policy_topline.pdf\">Pew Research Center</a> (August 2025): 83% of U.S. adults strongly favored or favored “requiring all voters to show government-issued photo identification to vote.”&nbsp;</p>\n\n\n\n<p><a href=\"https://www.rasmussenreports.com/public_content/politics/questions/questions/february_2025/questions_voter_id_january_26_28_2025\">Rasmussen Reports</a> (January 2025): Asked if requiring photo ID to vote is “a reasonable measure to protect the integrity of elections,” 77% of likely voters said yes.</p>\n\n\n\n<p><a href=\"https://news.gallup.com/poll/652523/americans-endorse-early-voting-voter-verification.aspx\">Gallup</a> (October 2024): 84% of U.S. adults favored “requiring all voters to provide photo identification at their voting place.” Also, 83% favored “requiring people who are registering to vote for the first time to provide proof of citizenship.”</p>\n\n\n\n<p>The House-passed <a href=\"https://bipartisanpolicy.org/article/five-things-to-know-about-the-save-act/\">SAVE America Act</a>, supported by President Donald Trump, is <a href=\"https://www.nbcnews.com/politics/congress/trumps-election-bill-save-america-act-50-senate-votes-democrats-block-rcna259351\">awaiting</a> a Senate vote. It would require voter ID and proof of citizenship at the time of registration.</p>\n\n\n\n<p><a href=\"https://www.ncsl.org/elections-and-campaigns/voter-id\">Thirty-six states</a> request or require identification for in-person voting. <a href=\"https://wisconsinwatch.org/tag/voter-id/\">Wisconsin</a> requires it.</p>\n\n\n\n<p><em>This fact brief is responsive to conversations such as <a href=\"https://www.youtube.com/watch?v=VZcj8aSrYRY&#038;t=188s\">this one</a>.</em></p>\n\n\n<h2 class=\"wp-block-heading\">Sources</h2>\n\n\n<ul><li>Pew Research Center: <a href=\"https://www.pewresearch.org/wp-content/uploads/sites/20/2025/08/PP_2025.8.22_voting-policy_topline.pdf\" target=\"_blank\">2025 Pew Research Center&#039;s American Trends Panel</a></li><li>Rasmussen Reports: <a href=\"https://www.rasmussenreports.com/public_content/politics/questions/questions/february_2025/questions_voter_id_january_26_28_2025\" target=\"_blank\">Questions &#8211; Voter ID &#8211; January 26-28, 2025</a></li><li>Gallup: <a href=\"https://news.gallup.com/poll/652523/americans-endorse-early-voting-voter-verification.aspx\" target=\"_blank\">Americans Endorse Both Early Voting and Voter Verification</a></li><li>Bipartisan Policy Center: <a href=\"https://bipartisanpolicy.org/article/five-things-to-know-about-the-save-act/\" target=\"_blank\">Five Things to Know About the SAVE Act</a></li><li>NBC News: <a href=\"https://www.nbcnews.com/politics/congress/trumps-election-bill-save-america-act-50-senate-votes-democrats-block-rcna259351\" target=\"_blank\">Trump&#039;s election bill tops 50 Senate votes, but Democrats could still block it</a></li><li>PolitiFact: <a href=\"https://www.politifact.com/truth-o-meter/promises/maga-meter-tracking-donald-trumps-2024-promises/promise/1663/require-voter-id-at-the-polls/article/3238/\" target=\"_blank\">House passes Trump-supported voter ID law, Senate passage unlikely</a></li><li>National Conference of State Legislatures: <a href=\"https://www.ncsl.org/elections-and-campaigns/voter-id\" target=\"_blank\">Voter ID Laws</a></li><li>Wisconsin Watch: <a href=\"https://wisconsinwatch.org/tag/voter-id/\" target=\"_blank\">Voter ID</a></li></ul>\n\n\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://gigafact.org/fact-brief-quiz/wisconsinwatch\"><img alt=\"Think you know the facts? Put your knowledge to the test. Take the Fact Brief quiz\" class=\"wp-image-1300309\" height=\"439\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2024/11/take_fact_brief_quiz.ea0075f4-1.jpg?resize=780%2C439&#038;quality=100&#038;ssl=1\" width=\"780\" /></a></figure>\n\n\n\n<p></p>\n<p><a href=\"https://wisconsinwatch.org/2026/02/voter-id-americans-support-wisconsin-poll-photo-identification/\">Do 80% of Americans support voter ID?</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/voter-id-americans-support-wisconsin-poll-photo-identification/",
    "publication_date": "Thu, 19 Feb 2026 19:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:57.060571",
    "country": "US",
    "organization": "Wisconsin Watch"
  },
  {
    "title": "This little-known FEMA rule may be making flooding worse in rural Wisconsin",
    "content": "<figure><img alt=\"A narrow creek flows between snow-covered banks lined with leafless trees and fallen branches in a wooded area.\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"683\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/image-1.jpg?fit=1024%2C683&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> 7</span> <span class=\"rt-label rt-postfix\">minutes</span></span>\n<p><em>This story was originally published by <a href=\"https://www.circleofblue.org/2026/water-policy-politics/an-obscure-provision-in-femas-program-to-prevent-disaster-is-making-serious-flooding-worse/\">Circle of Blue</a>.</em></p>\n\n\n\n<p>Since its creation in 1979, the Federal Emergency Management Agency has been charged with protecting communities from natural disasters. Central to that mission is curtailing serious flooding, the <a href=\"https://www.nssl.noaa.gov/education/svrwx101/floods/\">most prevalent and severe</a> weather threat to people and property across all 50 states.</p>\n\n\n\n<p>That objective, though, is impeded by an old and obscure federal regulation — overseen and enforced by FEMA itself — that is actually making flooding worse.</p>\n\n\n\n<p>That result was felt in December, when a powerful storm hit the Pacific Northwest. Flooding along Washington’s&nbsp;<a href=\"https://www.cascadiadaily.com/2025/dec/17/governor-does-sobering-tour-of-sumas-everson-and-nooksack-in-damage-review/\">Nooksack</a>&nbsp;and&nbsp;<a href=\"https://www.fox13seattle.com/news/skokomish-river-valley-submerged-by-flooding\">Skokomish</a>&nbsp;rivers destroyed homes and inundated roads, prompting evacuations and the declaration of&nbsp;<a href=\"https://www.fema.gov/press-release/20251212/president-donald-j-trump-approves-emergency-declaration-state-washington\">a state of emergency</a>. Some losses may have been alleviated, experts assert, had planned flood mitigation work along these same rivers’ banks not experienced significant&nbsp;<a href=\"https://storymaps.arcgis.com/stories/72d12b54dc054748a786561f0949bccb\">delays and cancellations</a>&nbsp;as a direct result of the rule’s powerful reach, which extends nationwide.</p>\n\n\n\n<p>Here in Wisconsin in the past year, watershed conservationists in Walworth and Ashland counties — located in the state’s south-central and northern regions — were forced to abandon two water quality and flood mitigation projects in local streams after discovering they would be subject to the regulation.</p>\n\n\n\n<p>Known within FEMA as the “no-rise” rule, the directive prohibits any earth-moving activity in low-lying, flood-prone areas if water levels during a storm would rise above what was present before the construction started. In other words, any project — defined as “development” by the agency — must not increase the volume of water in flood-prone areas by any amount.</p>\n\n\n\n<p>The rule, written in 1976 as a feature of the National Flood Insurance Program (NFIP), and described in detail for the first time by Circle of Blue, was enacted with good intentions to restrict development in floodplains. Its initial focus was population centers: Even an incremental increase in the volume of water that might overflow into a street or neighborhood can have perilous effects on basements, utilities, infrastructure, and human lives.</p>\n\n\n\n<p>At the time it was enacted, restoring floodplains and watersheds was a novel pursuit. A half century later, these efforts are recognized for their environmental and human benefits. But as the no-rise rule is currently written and interpreted, “development” is an all-encompassing term that pertains equally to the paving of a new downtown road, as it does to the restoration of wetlands in a remote field. In the eyes of FEMA, a project to address pollution or flooding in a stream is held to the same “no-rise” standards as the construction of a new building.</p>\n\n\n\n\n\n<p>FEMA’s enforcement of the rule is producing unintended effects. Meeting the “no-rise” standards, project managers say, adds tens of thousands of dollars to project costs and causes years of delay. As a result, land planners — from small nonprofits to federal agencies — routinely abandon efforts to improve water quality and restore watersheds before they even hit the ground.</p>\n\n\n\n<p>By barring “development” in floodplains, the no-rise rule allows for the degradation of habitat, lowering of water quality and flooding to persist and worsen.</p>\n\n\n\n<p>Viewed broadly, the rule’s compounding outcomes could not be felt at a more consequential time for the nation’s waters. The Trump administration is eliminating environmental safeguards, scaling back protections for the majority of the&nbsp;<a href=\"https://www.circleofblue.org/2025/water-policy-politics/three-great-lakes-states-at-greatest-risk-as-epa-rolls-back-wetland-protections/\">country’s wetlands</a> and proposing&nbsp;<a href=\"https://www.epa.gov/newsreleases/epa-proposes-cwa-section-401-rule-streamline-permitting-unleash-economic-growth-and\">limits on states’ power</a>&nbsp;to issue water quality reviews.</p>\n\n\n\n<p>Bipartisan lawmakers&nbsp;<a href=\"https://www.congress.gov/bill/119th-congress/senate-bill/1564/text\">have developed legislation</a>&nbsp;in both the U.S. House and Senate to amend FEMA’s no-rise rule in order to remove barriers to restore floodplains and watersheds. The agency has worked with legislators in writing these proposed policies, but did not respond to Circle of Blue when asked for a comment.</p>\n\n\n\n<p>“It was never an NFIP goal to see rivers and floodplains restored, which might be why these policies are so antiquated,” says Jennifer Western Hauser, a policy liaison at Wisconsin Wetlands Association. “We understand now that restoring floodplains can reduce flood risks and damage, so it&#8217;s long overdue to restore common sense.”</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img alt=\"An overlook sign reading &quot;The Driftless Area of Wisconsin&quot; stands in front of snow-covered wooded hills and a valley.\" class=\"wp-image-1314368\" height=\"520\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/Barre-Mills.jpg?resize=780%2C520&#038;quality=100&#038;ssl=1\" width=\"780\" /><figcaption class=\"wp-element-caption\">Tall bluffs extend over Barre Mills, Wisconsin, where the “no-rise” rule is impeding water restoration efforts. (Christian Thorsberg / Circle of Blue)</figcaption></figure>\n</div>\n\n\n<h2 class=\"wp-block-heading\">A case in point in Wisconsin’s Driftless Area</h2>\n\n\n\n<p>Addressing risks and recovery in flood-prone areas is an exhaustive undertaking. FEMA invests tens of millions of dollars each year in projects to reduce threats where storms are likely to hit.</p>\n\n\n\n<p>But the agency spends significantly more in their aftermath. Since its launch in 1968, the agency’s National Flood Insurance Program has fulfilled&nbsp;<a href=\"https://www.floodsmart.gov/historical-nfip-claims-information-and-trends?map=countries/us/custom/us-all-territories&amp;region=us&amp;miny=all&amp;maxy=all&amp;county=&amp;gtype=country\">north of $88 billion</a>&nbsp;in property damage claims.</p>\n\n\n\n<p>The economic realities and the extreme human cost of floods mean that flood control remains a&nbsp;<a href=\"https://www.fema.gov/flood-insurance/rules-legislation/laws?utm_source=chatgpt.com\">heavily regulated effort</a>&nbsp;codified within dozens of federal statutes, mandates and supplemental acts.&nbsp;Among this tangle of federal regulation is the no-rise rule that is producing unwelcome effects in rural regions, where efforts to reduce flood risks and improve the quality of long-polluted waters are routinely stymied. The dairy farms and modest homesteads that mark the snowy fields of Barre Mills, Wisconsin, offer a case in point.</p>\n\n\n\n<p>The small unincorporated community recalls a typical Midwestern landscape, save for the towering bluffs and rocky cliffs that wreathe around it, rising hundreds of feet. This unique stretch of southwestern Wisconsin, part of a wider region known as the Driftless Area, was left untouched by heavy ice sheets and retreating glaciers during the most recent Ice Age. Cold-water streams, waterfalls and deeply carved river valleys abound as a result. Both the Mississippi and Wisconsin rivers flow through La Crosse County.</p>\n\n\n\n<p>But when managed unsustainably, this steep terrain can accelerate watershed degradation. In rural Barre Mills, a legacy of tilling, deforestation and livestock grazing atop tall bluffs has left the town’s low-lying areas with floodwaters polluted with fast-moving farm runoff.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large\"><img alt=\"A narrow creek winds between snow-covered banks and leafless trees, with patches of ice along the water in a wooded area.\" class=\"wp-image-1314369\" height=\"1170\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/Bostwick-Creek.jpg?resize=780%2C1170&#038;quality=100&#038;ssl=1\" width=\"780\" /><figcaption class=\"wp-element-caption\">Bostwick Creek. (Christian Thorsberg / Circle of Blue)</figcaption></figure>\n</div>\n\n\n<p>Bostwick Creek, which stretches for 13 miles through 30,000 acres of woods and farms, is one prime example.</p>\n\n\n\n<p>The creek’s final four miles are severely impaired. Destructive storms and flooding, fueled by a changing climate, have exacerbated the erosion of its vulnerable banks. Non-point pollution from local farms has poured into the channel. Since 2014, the waterway has held&nbsp;<a href=\"https://bostwick-creek-1-lacrossecounty.hub.arcgis.com/\">unsafe concentrations</a>&nbsp;of phosphorus, fecal matter and suspended solids.</p>\n\n\n\n<p>These unwanted pollutants are not contained to just the creek. The Wisconsin DNR has issued&nbsp;<a href=\"https://lacrosseeagle.com/news/2024/02/06/dnr-safe-fish-consumption-la-crosse-river\">fish consumption advisories</a>&nbsp;after detecting high concentrations of&nbsp;<a href=\"https://datcp.wi.gov/Documents/LWCBOctober2019LaCrosseCountyLWRMPlan.pdf\">forever chemicals</a>&nbsp;in the La Crosse River, into which Bostwick flows. Duckweed and green algae, a side effect of nutrient spillage,&nbsp;<a href=\"https://www.friendsofthelacrosserivermarsh.com/post/water-quality-report-in-the-la-crosse-marsh-october-2023\">has inundated</a>&nbsp;downriver marshlands.</p>\n\n\n\n<p>The county has identified the creek’s water quality woes as a&nbsp;<a href=\"https://datcp.wi.gov/Documents/LWCBOctober2019LaCrosseCountyLWRMPlan.pdf\">high-priority issue</a>. From a conservation approach, its restoration portends to follow a straightforward plan of soil stabilization and the addition of new vegetation, which will make its floodplain more durable. Local farmers have even pledged crucial support for the effort, agreeing to give up precious land and private fishing access and commit to no-tilling practices near its banks.</p>\n\n\n\n<p>But FEMA’s “no-rise” rule is throwing a wrench in the entire operation. Creek restoration requires navigating a mountain of costly and time-consuming engineering, modeling, mapping, and permitting requirements that “seems to end up in a drawer, if anyone even looks at them at all,” says Jacob Schweitzer, La Crosse County’s lead watershed planner.</p>\n\n\n\n<p>The rule has delayed the creek’s restoration by months and added roughly $8,000 in expenses so far.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img alt=\"A person wearing sunglasses, a brown coat and blue jeans stands in snow beside a narrow creek with snow-covered banks and leafless shrubs, gesturing with one hand while facing the camera.\" class=\"wp-image-1314371\" height=\"520\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/Jacob-Schweitzer.jpg?resize=780%2C520&#038;quality=100&#038;ssl=1\" width=\"780\" /><figcaption class=\"wp-element-caption\">Jacob Schweitzer, La Crosse County’s lead watershed planner, stands along the banks of Bostwick Creek. (Christian Thorsberg / Circle of Blue)</figcaption></figure>\n</div>\n\n\n<h2 class=\"wp-block-heading\">Floodzones AE, floodways and maps</h2>\n\n\n\n<p>FEMA reaches its conclusions about development projects in rural valleys, like the one drained by Bostwick Creek, after three stages of formal consideration.</p>\n\n\n\n<p>First, the agency defines the valley as a floodplain, which is broadly defined as an area that is susceptible to being inundated by water during a storm. Second, FEMA designates land directly adjacent to Bostwick Creek with the more specific distinction of being a “Floodzone AE,” which is identified as a “high-risk” area within a floodplain. And third, within Floodzones AE are other pockets of land called&nbsp;<a href=\"https://www.fema.gov/about/glossary/floodway\">regulatory floodways</a>&nbsp;— the highest-risk area within a floodplain to flooding.</p>\n\n\n\n<p>Herein lies the culprit and its burdensome penalty.</p>\n\n\n\n<p>All “development” done inside regulatory floodways, whether related to construction or conservation, is subject to the “no-rise” rule. Failure to comply with the regulation, Schweitzer says, would result in the entire county’s population losing access to federal flood insurance.</p>\n\n\n\n<p>Adding to the frustration is the agency’s lethargy in upkeeping current records. Most flood zones were set decades ago when FEMA drew its inaugural set of flood maps for the NFIP. But these landscapes have changed vastly over the past half-century, and most of these maps and designations no longer reflect today’s terrain. Despite this, the agency does not systematically work to ensure its digital records match the risks or non-risks present on the ground.</p>\n\n\n\n<p>“It’s a long, complicated and political process,” says Brandon Parsons, director of river restoration at American Rivers. “Landowners and farmers living on thousand-acre ranches, with nobody in sight, might have to pay $50,000 to go through this conditional process with FEMA to restore banks on their own land.”</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img alt=\"A creek flows between snow-covered banks lined with leafless trees and brush, with patches of ice along the water’s edge and houses and other buildings in the background.\" class=\"wp-image-1314373\" height=\"520\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/Downstream-stretch-of-Bostwick-Creek.jpg?resize=780%2C520&#038;quality=100&#038;ssl=1\" width=\"780\" /><figcaption class=\"wp-element-caption\">The final downstream stretch of Bostwick Creek. (Christian Thorsberg / Circle of Blue)</figcaption></figure>\n</div>\n\n\n<p>The responsibility of updating maps thus falls on project planners, who must demonstrate that their work will follow the “no-rise” requirements. At Bostwick Creek, original flood maps have not been touched since 1982. Months of work to bring these maps up to date, Schweitzer says, has cost thousands of dollars, all to prove that the water level will remain unchanged.</p>\n\n\n\n<p>“Restoration work in zone AEs is frequently avoided,” Western Hauser adds. “That can only lead us to untenable conclusions. If zone AEs are degraded, they&#8217;ll remain degraded, or get worse because no one will work on them.”</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Floodplain Enhancement and Recovery Act</h2>\n\n\n\n<p>On a blustery December afternoon, Jacob Schweitzer navigates shin-deep snow near a chicken farm along the Bostwick, where more than 50 feet of sediment has fallen into the creek in just the past few years. Further downstream, fallen trees zig-zag and soils slump into the channel.</p>\n\n\n\n<p>Hardly a dozen farmhouses fill the view, and yet the project is held to the same standards as the construction of a new office building along the Milwaukee River in downtown Milwaukee.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img alt=\"A farm sits in a snow-covered valley with a red barn, three tall silos and outbuildings near a wooded hillside.\" class=\"wp-image-1314374\" height=\"520\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/Bostwick-valley.jpg?resize=780%2C520&#038;quality=100&#038;ssl=1\" width=\"780\" /><figcaption class=\"wp-element-caption\">The valley through which the Bostwick flows is dotted with few buildings. (Christian Thorsberg / Circle of Blue)</figcaption></figure>\n</div>\n\n\n<p>Policy experts agree that a significant amount of restoration work can be unlocked if FEMA regulations are updated with more nuance. This winter, a pair of bipartisan bills have been introduced on Capitol Hill to remedy this sticking point.</p>\n\n\n\n<p><a href=\"https://www.congress.gov/bill/119th-congress/senate-bill/1564\">Senate Bill 1564</a>&nbsp;— the Floodplain Enhancement and Recovery Act, authored by Sens. Patty Murray, D-Washington, and Steve Daines, R-Montana — and a companion&nbsp;<a href=\"https://downing.house.gov/sites/evo-subsites/downing.house.gov/files/evo-media-document/floodplain-enhancement-and-recovery-act.pdf\">House bill</a>, co-authored by Wisconsin Rep. Bryan Steil, a Republican, would add a definition of “ecosystem restoration” to the NFIP, differentiating it from other forms of development. States and communities would have the flexibility to allow up to a one-foot rise in a regulatory floodway’s water level, so long as no nearby insurable infrastructure is affected.</p>\n\n\n\n<p>“In other words, we’re talking about less-developed areas,” Western Hauser says. “We’re talking about areas upstream of development, where you might want to get your river working in tandem with your floodway.”</p>\n\n\n\n<p>Barre Mills is the exact kind of community where this legal nuance could make a big difference for water quality. If the act becomes a law, FEMA would have 180 days to develop guidance for how communities can work in compliance with this new rule. The agency would also be obligated to collaborate with natural resources agencies when drafting these directions.</p>\n\n\n\n<p>Floodplain managers, conservation groups, insurers, and tribes across the country continue to&nbsp;<a href=\"https://www.murray.senate.gov/murray-daines-introduce-bill-to-cut-red-tape-create-simplified-pathway-for-ecosystem-restoration-in-regulated-floodplains/\">voice their support</a>&nbsp;for the legislation. Supporters say its passage is most likely if it is attached to a larger congressional package.</p>\n\n\n\n<p>“Bureaucratic red tape should not stall common sense restoration projects,” Rep. Steil said in a <a href=\"https://downing.house.gov/media/press-releases/downing-bill-right-sizes-regulation-american-conservation\">statement</a>. “The Floodplain Enhancement and Recovery Act eases administrative burdens and empowers Wisconsin communities to make our waterways healthier, strengthen our resilience to floods, and enhance ecosystems across the nation.”</p>\n\n\n\n<p><em>This <a href=\"https://www.circleofblue.org/2026/water-policy-politics/an-obscure-provision-in-femas-program-to-prevent-disaster-is-making-serious-flooding-worse/\">article</a> first appeared on <a href=\"https://www.circleofblue.org/\">Circle of Blue</a> and is republished here under a <a href=\"https://creativecommons.org/licenses/by-nc-nd/4.0\">Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License</a>.</em></p>\n<p><a href=\"https://wisconsinwatch.org/2026/02/wisconsin-flooding-fema-no-rise-rule-rural-water-quality-erosion-environment/\">This little-known FEMA rule may be making flooding worse in rural Wisconsin</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/wisconsin-flooding-fema-no-rise-rule-rural-water-quality-erosion-environment/",
    "publication_date": "Thu, 19 Feb 2026 12:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:57.060575",
    "country": "US",
    "organization": "Wisconsin Watch"
  },
  {
    "title": "As the Tony Evers chapter of Wisconsin history draws to a close, a new chapter is just beginning",
    "content": "<figure><img alt=\"A person stands and raises a hand at a podium with a microphone in a marble-walled room, with other people sitting in the foreground.\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"683\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse20260217-State-of-the-State-Timmerman-003-scaled.jpg?fit=1024%2C683&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> 3</span> <span class=\"rt-label rt-postfix\">minutes</span></span>\n<p>As Wisconsin Gov. Tony Evers gave his final State of the State address at the Capitol on Tuesday, I was struck by how many of the people I’ve met or covered over the past nearly six months were all in the same room.&nbsp;</p>\n\n\n\n<p>Evers, who is not seeking reelection this year, entered the Assembly chambers shortly after 7 p.m. and spoke of his accomplishments over the past seven years with longtime Assembly Speaker Robin Vos, R-Rochester, and Senate President Mary Felzkowski, R-Tomahawk, seated right behind him. All seven members of the Wisconsin Supreme Court, who have frequently been deciding factors in conflicts between Evers and Republican lawmakers, were in the audience. Statewide elected officials, including Attorney General Josh Kaul and Superintendent of Public Instruction Jill Underly, were there. Both Democratic and Republican representatives and senators sat underneath the glass skylight to listen to Evers.&nbsp;</p>\n\n\n\n<p>In his <a href=\"https://www.youtube.com/watch?v=kOvwM4s3TNg\">hour-long speech</a>, Evers called on the Republican Legislature to take bipartisan action on issues such as tax cuts, special education school funding and corrections reform before lawmakers leave Madison and turn to the campaign trail for elections later this year. He also announced plans to call a special session for lawmakers to address a constitutional amendment to ban partisan gerrymandering. Republicans criticized Evers’ remarks as a partisan speech. </p>\n\n\n\n<p>The governor’s address Tuesday night came as Wisconsin stands on the precipice of significant change. A new governor will be elected later this year. New legislative maps and Democratic gains in 2024 set up real competition for control of the Legislature.</p>\n\n\n\n<p>It’s been almost six months <a href=\"https://wisconsinwatch.org/2025/09/wisconsin-watch-government-politics-brittany-carloni-reporter/\">since I began my role</a> as the state government and politics reporter at Wisconsin Watch. I returned to Wisconsin, where I was born and raised, in September after starting my journalism career reporting in Florida and Indiana.</p>\n\n\n\n\n\n<p>These initial months at Wisconsin Watch have been an exciting whirlwind as I’ve immersed myself into the debates and issues facing our state. Eight years away left me with much to catch up on.&nbsp;</p>\n\n\n\n<p>I’ve had a lot of coffee — maybe too much — as I’ve met people inside and outside of the Capitol who can help me understand the deeper issues beyond press releases and social media posts. I’ve attended many committee meetings, hearings and press conferences. I’ve made phone calls and sent text messages when I needed explanations about the recent state budget or legislative procedures. I’ve stopped by a host of Assembly and Senate offices to introduce myself, ask questions and learn what lawmakers are working on.&nbsp;</p>\n\n\n\n<p>And if you read all the way through Forward, Wisconsin Watch’s <a href=\"https://wisconsinwatch.org/subscribe/\">free weekly politics newsletter</a>, you will know I love diving into our state’s history and seeing what it can teach us about what is happening in Wisconsin today.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img alt=\"People sit at a wooden desk with laptops and a video camera on the desk.\" class=\"wp-image-1314385\" height=\"520\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse20260217-State-of-the-State-Timmerman-004.jpg?resize=780%2C520&#038;quality=100&#038;ssl=1\" width=\"780\" /><figcaption class=\"wp-element-caption\">Wisconsin Watch statehouse reporter Brittany Carloni takes notes as Wisconsin Gov. Tony Evers delivers his final State of the State address at the Wisconsin State Capitol on Feb. 17, 2026, in Madison, Wis. (Joe Timmerman / Wisconsin Watch)</figcaption></figure>\n</div>\n\n\n<p>My curiosity and my past reporting experiences in other states have driven my work so far. In November, I looked into <a href=\"https://wisconsinwatch.org/2025/11/wisconsin-evers-veto-republican-democrat-lawmakers-bills-senate-assembly-election/\">why Republican lawmakers sent bills to the governor’s desk</a> that Evers would never sign. When WisconsinEye, the public affairs network, went dark for weeks between December and January, <a href=\"https://wisconsinwatch.org/2026/01/wisconsin-wisconsineye-video-recording-state-legislature-senate-assembly-capitol/\">I looked beyond our borders</a> to understand how neighboring states film legislative proceedings. As voters face another Wisconsin Supreme Court election, I asked the candidates <a href=\"https://wisconsinwatch.org/2026/02/wisconsin-supreme-court-candidates-lazar-taylor-election-judicial-philosophies-same-case/\">about their past rulings</a> and how they reflect how each candidate would serve on the court.&nbsp;</p>\n\n\n\n<p>I’ve largely found people willing to share their perspectives and point me in the direction of others who can provide the information to explain complicated topics. I’ve particularly enjoyed the times I’ve heard “Welcome home,” as I’ve shared what brought me back to Wisconsin.&nbsp;</p>\n\n\n\n<p>Evers&#8217; address and the last year in the governor’s office signal an end to one chapter of Wisconsin’s history. I feel like I am just getting started. If you have tips, ideas, questions or feedback, email me at <a href=\"mailto:bcarloni@wisconsinwatch.org\">bcarloni@wisconsinwatch.org</a>.</p>\n\n\n\n<div class=\"wp-block-media-text\"><figure class=\"wp-block-media-text__media\"><img alt=\"\" class=\"wp-image-1279368 size-full\" height=\"644\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2023/05/WCIJ_Logo_Stacked_FullColor_RGB-1.png?resize=780%2C644&#038;quality=100&#038;ssl=1\" width=\"780\" /></figure><div class=\"wp-block-media-text__content\">\n<p><em><strong><a href=\"https://www.wisconsinwatch.org/\">Wisconsin Watch</a></strong> is a nonprofit, nonpartisan newsroom. Subscribe to our <a href=\"https://www.wisconsinwatch.org/subscribe\">newsletters</a> for original stories and our Friday news roundup. </em></p>\n</div></div>\n<p><a href=\"https://wisconsinwatch.org/2026/02/wisconsin-governor-tony-evers-final-state-of-the-state-brittany-carloni/\">As the Tony Evers chapter of Wisconsin history draws to a close, a new chapter is just beginning</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/wisconsin-governor-tony-evers-final-state-of-the-state-brittany-carloni/",
    "publication_date": "Wed, 18 Feb 2026 12:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:57.060579",
    "country": "US",
    "organization": "Wisconsin Watch"
  },
  {
    "title": "Justice delayed: More than 10,000 felony matters unresolved in Milwaukee County",
    "content": "<figure><img alt=\"The exterior of a building shows large arched windows, stone walls and a sign reading &quot;MILWAUKEE COUNTY COURTHOUSE&quot; next to an entrance with the word &quot;JUSTICE&quot; above a door.\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"683\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse6328139-scaled.jpg?fit=1024%2C683&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> 4</span> <span class=\"rt-label rt-postfix\">minutes</span></span>\n<p>The backlog of unresolved felony-related matters in Milwaukee County has surpassed the pandemic-era peak, topping more than 10,000 as of Oct. 13, according to data obtained from the Milwaukee County District Attorney’s Office through an NNS open records request.</p>\n\n\n\n<p>As cases linger, people throughout the criminal justice system feel the effects, including victims and their families, people accused of crimes and the broader community, said Kent Lovern, Milwaukee County district attorney. </p>\n\n\n\n<p>“‘Justice delayed, justice denied’ applies to everybody,” Lovern said.&nbsp;</p>\n\n\n\n<p>One recent high-profile incident reaffirms how case backlogs could have tragic and life-altering consequences.&nbsp;</p>\n\n\n\n<p>On Feb. 5, a Milwaukee man, Mile Dukic, allegedly stabbed and killed 44-year-old Amanda Varisco on West National Avenue and S. 36th Street. At the time of the killing, Dukic had separate open felony cases in Milwaukee County Circuit Court – for bail jumping and stalking. He was charged with another felony, first-degree intentional homicide, on Feb. 9.</p>\n\n\n\n<p>Dukic is currently in custody with bail set at $500,000. </p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Two backlogs</strong></h2>\n\n\n\n<p>The district attorney’s office plays a pivotal role at both ends of the felony pipeline, said a spokesperson for the Wisconsin State Public Defender’s Office: referrals from police awaiting a charging decision, plus charged felony cases working their way through the courts.</p>\n\n\n\n<p>The Milwaukee Police Department made 5,650 summary felony arrests in 2025, according to an MPD spokesperson. The department continues to work with the Milwaukee County District Attorney’s Office to best address the felony backlog, the MPD spokesperson said.</p>\n\n\n\n<p>District attorney records show 2,924 pending uncharged felony cases as of October 2025.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>State office wants county to change approach, charge fewer felonies</strong></h2>\n\n\n\n<p>The spokesperson for the Wisconsin State Public Defender’s Office said the district attorney’s office can and should do more to address the growing backlog by adjusting its approach.&nbsp;</p>\n\n\n\n<p>“We believe prosecutors should be exercising more discretion in which referrals they are charging,” the spokesperson said. The spokesperson said the office regularly sees clients charged with relatively minor offenses lose jobs or housing as a result – consequences that can outweigh the underlying charge.</p>\n\n\n\n<p>When the prosecutor’s office officially presses felony charges, these cases can get bogged down and stay in the courts. Resolution to the cases depends not only on prosecutors but also on defense attorneys, judges, court staff and other resources that are strained as well, Lovern said.&nbsp;</p>\n\n\n\n<p>Based on the district attorney’s internal case-tracking system, more than 7,000 felony cases were charged but not yet resolved as of Oct. 13.&nbsp;</p>\n\n\n\n<p>“The influx of felony charges coming out of the DA’s office isn’t benefiting the court system or public safety,” said State Public Defender Jennifer Bias. “It’s a waste of our scarce attorney resources.”</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Increase in serious criminal activity</strong></h2>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img alt=\"A person in a suit and striped tie, with an American flag and shelves of books in the background\" class=\"wp-image-1304960\" height=\"439\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2025/04/asseKent-Lovern.jpg?resize=780%2C439&#038;quality=100&#038;ssl=1\" width=\"780\" /><figcaption class=\"wp-element-caption\">Milwaukee County District Attorney Kent Lovern is shown being interviewed by reporters for Wisconsin Watch, the Milwaukee Journal Sentinel and TMJ4 News in January 2025. Lovern oversees the county’s felony prosecutions. Since the COVID-19 pandemic, the backlog of felony cases in the county has only grown. (TMJ4 News)</figcaption></figure>\n</div>\n\n\n<p>Lovern pushes back on the idea that prosecutors are charging too many cases.</p>\n\n\n\n<p>“I want to make it very clear: I don&#8217;t have goals for what we ought to be charging,” he said. “I don&#8217;t have a directive of what the percentage of our charging rate should be.”</p>\n\n\n\n<p>Prosecutors decline to move forward on many referrals, said Jeffrey Altenburg, Milwaukee’s chief deputy district attorney.&nbsp;</p>\n\n\n\n<p>On a basic public safety level, there are simply more serious felonies being committed, Lovern and Altenburg said.</p>\n\n\n\n<p>“I think that that’s exactly what we’re seeing,” Altenburg said. “We’re seeing more referrals coming to this office that involve firearms, violence, sexual violence.”&nbsp;</p>\n\n\n\n<p>Milwaukee Police Department <a href=\"https://city.milwaukee.gov/police/Information-Services/Crime-Maps-and-Statistics\" id=\"https://city.milwaukee.gov/police/Information-Services/Crime-Maps-and-Statistics\" type=\"link\">data</a> show reports of the majority of the most serious offenses declined from 2024 to 2025, with the exception of homicides and human trafficking, which increased slightly.</p>\n\n\n\n<p>Violent crime in Milwaukee has generally declined in the past few years – but from historic highs seen during the pandemic, according to <a href=\"https://counciloncj.org/crime-trends-in-u-s-cities-mid-year-2025-update/#offense-dashboard\">data from the Council on Criminal Justice</a>.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>When to charge</strong></h2>\n\n\n\n<p>Charging decisions begin with a decision about whether a case is provable beyond a reasonable doubt, Altenburg said.</p>\n\n\n\n<p>“We adhere to that standard very scrupulously in this office,” he said.&nbsp;&nbsp;</p>\n\n\n\n<p>Once that is determined, the district attorney’s office moves to the question of whether prosecution is necessary or a different kind of intervention is more appropriate, Altenburg said.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Alternatives to traditional prosecution</strong></h2>\n\n\n\n<p>In Milwaukee, there are two alternative interventions: diversion and deferred prosecution.</p>\n\n\n\n<p>Diversion allows a person to complete requirements, such as treatment, restitution or community service, without a criminal charge.&nbsp;</p>\n\n\n\n<p>Deferred prosecution involves issuing charges with an agreement in which a conviction is withheld if the person meets various conditions.</p>\n\n\n\n<p>Lovern said local prosecutors created an early-intervention approach designed to steer nonviolent cases driven by substance use or mental health challenges out of the criminal justice system when appropriate.&nbsp;</p>\n\n\n\n<p>In 2020, Milwaukee County intervened in roughly 600 cases, Altenburg said. Last year, the county intervened in roughly 1,600 cases.</p>\n\n\n\n\n\n\n\n<p>Lovern said the nature of modern policing – and modern evidence – has fundamentally changed prosecutors’ workload.</p>\n\n\n\n<p>The sheer volume of evidence that must be reviewed contributes to growing wait times before charging decisions can be made, Lovern said.&nbsp;</p>\n\n\n\n<p>More evidence is generated because of modern technologies and other tools used by police. A single incident can, for example, generate hours of body camera footage that prosecutors review before making charging decisions, Lovern said. </p>\n\n\n\n<p>In 2020, there were 84,000 pieces of evidence in Milwaukee’s database. In 2024, there were 1.7 million items.&nbsp;</p>\n\n\n\n<p>“I’m sure last year, it was even higher. That’s just where we’re headed,” Lovern said.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Staffing and system capacity</strong></h2>\n\n\n\n<p>Something that adds to both backlogs – uncharged cases awaiting a decision and charged cases in the system – is insufficient staffing levels throughout the court system, a trend that has continued since the pandemic.&nbsp;</p>\n\n\n\n<p>The district attorney’s office has about 125 full-time prosecutors, Lovern said.&nbsp;</p>\n\n\n\n<p>“Now that is a lot. It&#8217;s the same number that we had when (Altenburg) and I started in this office 28 years ago, though.”</p>\n\n\n\n<p>The State Public Defender’s Office also faces staffing challenges, according to its spokesperson.&nbsp;</p>\n\n\n\n<p>“Broadly speaking, our agency needs more staff statewide,” the spokesperson said. “This wouldn’t address delays caused by prosecutors, but it would help to decrease the time it takes to appoint attorneys to indigent defendants and reduce the turnover in staff that office experiences due to burnout.”</p>\n\n\n\n<p>There is also a need for support staff who help with administrative tasks, freeing up attorneys.</p>\n\n\n\n<p>Lovern said unstable funding adds to staffing pressures.</p>\n\n\n\n<p>About a third of legal staff in the county had been funded with federal grant money, which has been a little less predictable in the last couple of years, Lovern said.  </p>\n\n\n\n<p>“We can use more positions,” Lovern said. “There&#8217;s no question about that.”</p>\n<p><a href=\"https://wisconsinwatch.org/2026/02/milwaukee-county-wisconsin-felony-backlog-district-attorney-prosecutors-police-crime/\">Justice delayed: More than 10,000 felony matters unresolved in Milwaukee County</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/milwaukee-county-wisconsin-felony-backlog-district-attorney-prosecutors-police-crime/",
    "publication_date": "Wed, 18 Feb 2026 11:55:00 +0000",
    "date_gathered": "2026-02-24T04:09:57.060583",
    "country": "US",
    "organization": "Wisconsin Watch"
  },
  {
    "title": "How Milwaukee residents rallied to save North Division High School from closure during 1970s integration fight",
    "content": "<figure><img alt=\"People walk on a street holding signs, including one reading &quot;EQUAL RIGHTS,&quot; with buildings and a church steeple in the background.\" class=\"attachment-rss-image-size size-rss-image-size wp-post-image\" height=\"844\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/March-CSND-scaled-1.jpeg?fit=1024%2C844&amp;quality=100&amp;ssl=1\" width=\"1024\" /></figure><span class=\"span-reading-time rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\"><b>Reading Time: </b></span> <span class=\"rt-time\"> 4</span> <span class=\"rt-label rt-postfix\">minutes</span></span>\n<p>North Division High School had always been a staple in Milwaukee’s Black community.&nbsp;</p>\n\n\n\n<p>But a Jan. 19, 1976, order by federal Judge John Reynolds for Milwaukee Public Schools to desegregate almost changed that.&nbsp;</p>\n\n\n\n<p>The ruling led MPS to propose changes three years later with the goal to integrate the 97% Black North Side high school.&nbsp;</p>\n\n\n\n<p>The solution? Close North Division as the neighborhood knew it and reopen it as a citywide magnet school for medical and science technology. Magnet schools offer special instruction and programs that are typically not available elsewhere.&nbsp;&nbsp;</p>\n\n\n\n<p>The district had utilized a similar strategy in the years prior to integrate Rufus King High School and Golda Meir School by changing them to magnet schools.&nbsp;</p>\n\n\n\n<p>The proposal for North Division would integrate the school by drawing more white students from other parts of the city but would also limit enrollment options for students in the surrounding neighborhoods.&nbsp;</p>\n\n\n\n<p>Residents quickly fought back, organizing the Coalition to Save North Division.&nbsp;</p>\n\n\n\n<p>Howard Fuller, who led the coalition, remembers the community’s reaction when the plan was first announced.  </p>\n\n\n\n<p>“We ended up filling up the auditorium at the board meeting at Central Office,” said Fuller, who went on to become superintendent of MPS from 1991 to 1995. “That&#8217;s when I gave the speech and ended by saying ‘enough is enough.’ That then became the slogan for the Coalition to Save North.”</p>\n\n\n\n<p>Fuller said the group organized marches and meetings, canvassed across the neighborhood and eventually took legal action and won.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Desegregation at MPS</strong></h2>\n\n\n\n<p>Lawyer and politician Lloyd Barbee, among others, filed a lawsuit against the Milwaukee Public School Board of Directors in 1965 to desegregate MPS, Milwaukee historian and author James Nelsen said.&nbsp;&nbsp;</p>\n\n\n\n<p><a href=\"https://uwm.edu/marchonmilwaukee/keyterms/amos-et-al-v-board-of-school-dir/\">The suit alleged</a> that the district’s policy of assigning students to their neighborhood school maintained school segregation because of the widespread residential segregation across the city.&nbsp;</p>\n\n\n\n<p>The case ran until 1976, when Reynolds ruled that Milwaukee Public Schools needed to take action to desegregate the district.&nbsp;</p>\n\n\n\n<p>Reynolds then established a monitoring board to enforce and oversee districtwide desegregation plans.</p>\n\n\n\n\n\n<p>Nelsen said shortly before the ruling, the Board of Directors welcomed new Superintendent Lee McMurrin, who had implemented magnet schools in Toledo, Ohio.</p>\n\n\n\n<p>Once he came to Milwaukee, McMurrin pushed to rebrand some neighborhood high schools as magnet schools, encouraging students from across the city to go to different schools.</p>\n\n\n\n<p>When a new North Division building opened in 1978, the district tried attracting white students to the school but was unsuccessful. </p>\n\n\n\n<p>This, in combination with low performing grades at the school, led McMurrin to target North Division to become the city’s newest magnet school. The school would open a medical and science technology program for high schoolers across the city.</p>\n\n\n\n<p>“We’re not satisfied with the results at North Division,” McMurrin said in a 1979 Milwaukee Sentinel article. “We will not have a change about unless we make it a brand new school.”</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Community pushes back</strong></h2>\n\n\n\n<p>Fuller, students and the neighborhood had major concerns about the new plan.&nbsp;</p>\n\n\n\n<p>“The thing that concerned me the most was that once they built the brand-new building, then the first thing they were going to do then was to put all of the neighborhood kids out,” Fuller said. “In part, it was also a pushback against the way that desegregation was being implemented in the city at that time.”</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-full\"><img alt=\"A person speaks into multiple microphones while holding papers, wearing a green shirt reading &quot;ENOUGH IS ENOUGH HELP SAVE NORTH,&quot; with others standing in the background.\" class=\"wp-image-1314310\" height=\"881\" src=\"https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/Howard-Fuller.jpg?resize=600%2C881&#038;quality=100&#038;ssl=1\" width=\"600\" /><figcaption class=\"wp-element-caption\">Howard Fuller speaks to a crowd of students and community members in protest of Milwaukee Public Schools’ plan to turn the predominantly Black neighborhood school into a magnet school. (Courtesy of Howard Fuller)</figcaption></figure>\n</div>\n\n\n<p>North Division’s student council organized a rally in which 400 students walked out of school and marched to the Central Office in protest, according to local news reports.&nbsp;</p>\n\n\n\n<p>The plan would close enrollment to freshmen and sophomores. Willie Washington, then a North Division junior, spoke out against the plan during the protest.&nbsp;&nbsp;</p>\n\n\n\n<p>“We feel that we should not be used as guinea pigs for integration,” Washington told the Milwaukee Journal.</p>\n\n\n\n<p>Fuller said the coalition spent the summer going door to door in the neighborhood, held community meetings and built a parent group.</p>\n\n\n\n<p>When the new school year started in September 1979, Fuller and over 200 students gathered for a mass meeting on North Division’s front lawn. Fuller told students to study hard and “demand that they be educated.”</p>\n\n\n\n<p>After months of protesting, Fuller said, the coalition escalated to legal action through the monitoring board, established to observe desegregation efforts.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Success at a cost</strong></h2>\n\n\n\n<p>Fuller said the Board of Directors eventually reached an out-of-court settlement and dropped the plan.</p>\n\n\n\n<p>“It was the first battle where the board reversed its decision on closing a school in the Black community because all of the protests before had never gained any traction,” Fuller said.&nbsp;</p>\n\n\n\n<p>The school would remain a neighborhood school but also offer a career specialty program, according to the settlement.&nbsp;</p>\n\n\n\n<p>The agreement said the school should aim for about 2,000 students, 60% Black and 40% white. A set number of seats would be set aside for non-Black students, and Black students could not fill those spots.</p>\n\n\n\n<p>As those changes were implemented, problems at North Division High School continued, Fuller said.&nbsp;</p>\n\n\n\n<p>Fuller said nobody knew he would eventually become a superintendent of MPS. When he took on the role in 1991, he gained access to documents and information nobody thought he would see.&nbsp;</p>\n\n\n\n<p>An assistant superintendent at the time told him that the board had taken actions to sabotage North Division after the coalition won.</p>\n\n\n\n<p>“Some of the problems that exist at North today can be traced back to the conscious attempt to sabotage North once we won in court,” Fuller said. “There was such anger on the part of the administration that they had to do this.”</p>\n\n\n\n<p>For example, Fuller said the coalition worked with North Division Principal Bob Jasna to set up a program and curriculum for the school, then replaced Jasna with a middle school principal who knew nothing about the work he and Fuller did.</p>\n\n\n\n<p>“That sabotaged the entire effort that we had made,” Fuller said.</p>\n\n\n\n<p>Today, North Division High School remains predominantly Black — 90.5%, according to the <a href=\"https://mps.school/north/wp-content/uploads/sites/37/2025/11/SRCDetail-Public-North-Division-High-2024-25.pdf\">latest state report card</a>. The school scored an overall 54.9 on the report card, meeting few expectations, according to the Wisconsin Department of Education.</p>\n\n\n\n<p>“For me, this struggle around North Division has never ended,” Fuller said. “It’s been ongoing for 30, 40 years.”</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><em>Alex Klaus is the education solutions reporter for Milwaukee Neighborhood News Service and a corps member of Report for America, a national service program that places journalists in local newsrooms to report on under-covered issues and communities. Report for America plays no role in editorial decisions in the NNS newsroom.</em></p>\n<p><a href=\"https://wisconsinwatch.org/2026/02/milwaukee-coalition-to-save-north-division-high-school-integration-1970s/\">How Milwaukee residents rallied to save North Division High School from closure during 1970s integration fight</a> is a post from <a href=\"https://wisconsinwatch.org\">Wisconsin Watch</a>, a non-profit investigative news site covering Wisconsin since 2009. Please consider making a contribution to support our journalism.</p>",
    "url": "https://wisconsinwatch.org/2026/02/milwaukee-coalition-to-save-north-division-high-school-integration-1970s/",
    "publication_date": "Tue, 17 Feb 2026 15:00:00 +0000",
    "date_gathered": "2026-02-24T04:09:57.060586",
    "country": "US",
    "organization": "Wisconsin Watch"
  }
]